
/********************************************************
*                                                       *
*   Package generated using UEDumper by Spuckwaffel.    *
*                                                       *
********************************************************/

#pragma once
#include "BasicType.h"
#include "AssetRegistry.h"
#include "AudioExtensions.h"
#include "AudioPlatformConfiguration.h"
#include "Chaos.h"
#include "ClothingSystemRuntimeInterface.h"
#include "CoreUObject.h"
#include "DeveloperSettings.h"
#include "InputCore.h"
#include "PacketHandler.h"
#include "PhysicsCore.h"
#include "PropertyAccess.h"
#include "PropertyPath.h"
#include "Slate.h"
#include "SlateCore.h"
#include "StaticMeshDescription.h"

#pragma pack(push, 0x1)

class AActor;
class AAmbientSound;
class AAtmosphericFog;
class AAudioVolume;
class ABandwidthTestActor;
class ABlockingVolume;
class ABoxReflectionCapture;
class ABrush;
class ABrushShape;
class ACameraActor;
class ACameraBlockingVolume;
class ACameraShakeSourceActor;
class ACharacter;
class AController;
class ACullDistanceVolume;
class ADebugCameraController;
class ADebugCameraHUD;
class ADecalActor;
class ADefaultPawn;
class ADefaultPhysicsVolume;
class ADirectionalLight;
class ADocumentationActor;
class AEmitter;
class AEmitterCameraLensEffectBase;
class AExponentialHeightFog;
class AGameMode;
class AGameModeBase;
class AGameNetworkManager;
class AGameSession;
class AGameState;
class AGameStateBase;

class UStereoLayerFunctionLibrary;
class UStereoLayerShape;
class UStereoLayerShapeCubemap;
class UStereoLayerShapeCylinder;
class UStereoLayerShapeEquirect;
class UStereoLayerShapeQuad;
class UStreamableRenderAsset;
class UStreamingSettings;
class UStringTable;
class USubUVAnimation;
class USubmixEffectDynamicsProcessorPreset;
class USubmixEffectReverbPreset;
class USubmixEffectSubmixEQPreset;
class USubsurfaceProfile;
class USubsystem;
class USubsystemBlueprintLibrary;
class USynthComponent;
class USynthSound;
class USystemTimeTimecodeProvider;
class UTestMovieSceneSection;
class UTestMovieSceneSequence;
class UTestMovieSceneSubSection;
class UTestMovieSceneSubTrack;
class UTestMovieSceneTrack;
class UTextBinding;
class UTextBlock;
class UTextLayoutWidget;
class UTextPropertyTestObject;
class UTextRenderComponent;
class UTexture;
class UTexture2D;
class UTexture2DArray;
class UTexture2DDynamic;
class UTextureCube;
class UTextureLODSettings;
class UTextureLightProfile;
class UTextureMipDataProviderFactory;
class UTextureRenderTarget;
class UTextureRenderTarget2D;
class UTextureRenderTarget2DArray;
class UTextureRenderTargetCube;
class UTextureRenderTargetVolume;
class UThrobber;
class UThumbnailInfo;
class UTileView;
class UTimecodeProvider;
class UTimelineComponent;
class UTimelineTemplate;
class UTireType;
class UTouchInterface;
class UTreeView;
class UTwitterIntegrationBase;
class UUMGSequencePlayer;
class UUMGSequenceTickManager;
class UUniformGridPanel;
class UUniformGridSlot;
class UUserDefinedEnum;
class UUserDefinedStruct;
class UUserInterfaceSettings;
class UUserListEntry;
class UUserListEntryLibrary;
class UUserObjectListEntry;
class UUserObjectListEntryLibrary;
class UUserWidget;
class UVOIPStatics;
class UVOIPTalker;
class UVectorField;
class UVectorFieldAnimated;
class UVectorFieldComponent;
class UVectorFieldStatic;
class UVerticalBox;
class UVerticalBoxSlot;
class UViewModeUtils;
class UViewport;
class UViewportStatsSubsystem;
class UVirtualTexture;
class UVirtualTexture2D;
class UVirtualTextureBuilder;
class UVirtualTexturePoolConfig;
class UVisibilityBinding;
class UVisual;
class UVisualLoggerAutomationTests;
class UVisualLoggerDebugSnapshotInterface;
class UVisualLoggerKismetLibrary;
class UVoiceChannel;
class UVolumeTexture;
class UVolumetricCloudComponent;
class UWeightAndEasingEvaluatorSystem;
class UWidget;
class UWidgetAnimation;
class UWidgetAnimationDelegateBinding;
class UWidgetAnimationPlayCallbackProxy;
class UWidgetBinding;
class UWidgetBlueprintGeneratedClass;
class UWidgetBlueprintLibrary;
class UWidgetComponent;
class UWidgetInteractionComponent;
class UWidgetLayoutLibrary;
class UWidgetNavigation;
class UWidgetSwitcher;
class UWidgetSwitcherSlot;
class UWidgetTree;
class UWindDirectionalSourceComponent;
class UWindowTitleBarArea;
class UWindowTitleBarAreaSlot;
class UWorld;
class UWorldComposition;
class UWorldSubsystem;
class UWrapBox;
class UWrapBoxSlot;

/// Enum /Script/AudioMixer.EMusicalNoteName
/// Size: 0x01 (1 bytes)
enum class EMusicalNoteName : uint8_t
{
	EMusicalNoteName__C                                                              = 0,
	EMusicalNoteName__Db                                                             = 1,
	EMusicalNoteName__D                                                              = 2,
	EMusicalNoteName__Eb                                                             = 3,
	EMusicalNoteName__E                                                              = 4,
	EMusicalNoteName__F                                                              = 5,
	EMusicalNoteName__Gb                                                             = 6,
	EMusicalNoteName__G                                                              = 7,
	EMusicalNoteName__Ab                                                             = 8,
	EMusicalNoteName__A                                                              = 9,
	EMusicalNoteName__Bb                                                             = 10,
	EMusicalNoteName__B                                                              = 11
};

/// Enum /Script/AudioMixer.ESubmixEffectDynamicsChannelLinkMode
/// Size: 0x01 (1 bytes)
enum class ESubmixEffectDynamicsChannelLinkMode : uint8_t
{
	ESubmixEffectDynamicsChannelLinkMode__Disabled                                   = 0,
	ESubmixEffectDynamicsChannelLinkMode__Average                                    = 1,
	ESubmixEffectDynamicsChannelLinkMode__Peak                                       = 2,
	ESubmixEffectDynamicsChannelLinkMode__Count                                      = 3
};

/// Enum /Script/AudioMixer.ESubmixEffectDynamicsPeakMode
/// Size: 0x01 (1 bytes)
enum class ESubmixEffectDynamicsPeakMode : uint8_t
{
	ESubmixEffectDynamicsPeakMode__MeanSquared                                       = 0,
	ESubmixEffectDynamicsPeakMode__RootMeanSquared                                   = 1,
	ESubmixEffectDynamicsPeakMode__Peak                                              = 2,
	ESubmixEffectDynamicsPeakMode__Count                                             = 3
};

/// Enum /Script/AudioMixer.ESubmixEffectDynamicsProcessorType
/// Size: 0x01 (1 bytes)
enum class ESubmixEffectDynamicsProcessorType : uint8_t
{
	ESubmixEffectDynamicsProcessorType__Compressor                                   = 0,
	ESubmixEffectDynamicsProcessorType__Limiter                                      = 1,
	ESubmixEffectDynamicsProcessorType__Expander                                     = 2,
	ESubmixEffectDynamicsProcessorType__Gate                                         = 3,
	ESubmixEffectDynamicsProcessorType__Count                                        = 4
};

/// Enum /Script/Engine.ETextGender
/// Size: 0x01 (1 bytes)
enum class ETextGender : uint8_t
{
	ETextGender__Masculine                                                           = 0,
	ETextGender__Feminine                                                            = 1,
	ETextGender__Neuter                                                              = 2
};

/// Enum /Script/Engine.EFormatArgumentType
/// Size: 0x01 (1 bytes)
enum class EFormatArgumentType : uint8_t
{
	EFormatArgumentType__Int                                                         = 0,
	EFormatArgumentType__UInt                                                        = 1,
	EFormatArgumentType__Float                                                       = 2,
	EFormatArgumentType__Double                                                      = 3,
	EFormatArgumentType__Text                                                        = 4,
	EFormatArgumentType__Gender                                                      = 5
};

/// Enum /Script/Engine.EEndPlayReason
/// Size: 0x01 (1 bytes)
enum class EEndPlayReason : uint8_t
{
	EEndPlayReason__Destroyed                                                        = 0,
	EEndPlayReason__LevelTransition                                                  = 1,
	EEndPlayReason__EndPlayInEditor                                                  = 2,
	EEndPlayReason__RemovedFromWorld                                                 = 3,
	EEndPlayReason__Quit                                                             = 4
};

/// Enum /Script/Engine.ETickingGroup
/// Size: 0x01 (1 bytes)
enum class ETickingGroup : uint8_t
{
	TG_PrePhysics                                                                    = 0,
	TG_StartPhysics                                                                  = 1,
	TG_DuringPhysics                                                                 = 2,
	TG_EndPhysics                                                                    = 3,
	TG_PostPhysics                                                                   = 4,
	TG_PostUpdateWork                                                                = 5,
	TG_LastDemotable                                                                 = 6,
	TG_NewlySpawned                                                                  = 7
};

/// Enum /Script/Engine.EComponentCreationMethod
/// Size: 0x01 (1 bytes)
enum class EComponentCreationMethod : uint8_t
{
	EComponentCreationMethod__Native                                                 = 0,
	EComponentCreationMethod__SimpleConstructionScript                               = 1,
	EComponentCreationMethod__UserConstructionScript                                 = 2,
	EComponentCreationMethod__Instance                                               = 3
};

/// Enum /Script/Engine.ETemperatureSeverityType
/// Size: 0x01 (1 bytes)
enum class ETemperatureSeverityType : uint8_t
{
	ETemperatureSeverityType__Unknown                                                = 0,
	ETemperatureSeverityType__Good                                                   = 1,
	ETemperatureSeverityType__Bad                                                    = 2,
	ETemperatureSeverityType__Serious                                                = 3,
	ETemperatureSeverityType__Critical                                               = 4,
	ETemperatureSeverityType__NumSeverities                                          = 5
};

/// Enum /Script/Engine.EQuartzCommandQuantization
/// Size: 0x01 (1 bytes)
enum class EQuartzCommandQuantization : uint8_t
{
	EQuartzCommandQuantization__Bar                                                  = 0,
	EQuartzCommandQuantization__Beat                                                 = 1,
	EQuartzCommandQuantization__ThirtySecondNote                                     = 2,
	EQuartzCommandQuantization__SixteenthNote                                        = 3,
	EQuartzCommandQuantization__EighthNote                                           = 4,
	EQuartzCommandQuantization__QuarterNote                                          = 5,
	EQuartzCommandQuantization__HalfNote                                             = 6,
	EQuartzCommandQuantization__WholeNote                                            = 7,
	EQuartzCommandQuantization__DottedSixteenthNote                                  = 8,
	EQuartzCommandQuantization__DottedEighthNote                                     = 9,
	EQuartzCommandQuantization__DottedQuarterNote                                    = 10,
	EQuartzCommandQuantization__DottedHalfNote                                       = 11,
	EQuartzCommandQuantization__DottedWholeNote                                      = 12,
	EQuartzCommandQuantization__SixteenthNoteTriplet                                 = 13,
	EQuartzCommandQuantization__EighthNoteTriplet                                    = 14,
	EQuartzCommandQuantization__QuarterNoteTriplet                                   = 15,
	EQuartzCommandQuantization__HalfNoteTriplet                                      = 16,
	EQuartzCommandQuantization__Tick                                                 = 17,
	EQuartzCommandQuantization__Count                                                = 18
};

/// Enum /Script/Engine.EQuartzCommandDelegateSubType
/// Size: 0x01 (1 bytes)
enum class EQuartzCommandDelegateSubType : uint8_t
{
	EQuartzCommandDelegateSubType__CommandOnFailedToQueue                            = 0,
	EQuartzCommandDelegateSubType__CommandOnQueued                                   = 1,
	EQuartzCommandDelegateSubType__CommandOnCanceled                                 = 2,
	EQuartzCommandDelegateSubType__CommandOnAboutToStart                             = 3,
	EQuartzCommandDelegateSubType__CommandOnStarted                                  = 4,
	EQuartzCommandDelegateSubType__Count                                             = 5
};

/// Enum /Script/Engine.EAudioComponentPlayState
/// Size: 0x01 (1 bytes)
enum class EAudioComponentPlayState : uint8_t
{
	EAudioComponentPlayState__Playing                                                = 0,
	EAudioComponentPlayState__Stopped                                                = 1,
	EAudioComponentPlayState__Paused                                                 = 2,
	EAudioComponentPlayState__FadingIn                                               = 3,
	EAudioComponentPlayState__FadingOut                                              = 4,
	EAudioComponentPlayState__Count                                                  = 5
};

/// Enum /Script/Engine.EPlaneConstraintAxisSetting
/// Size: 0x01 (1 bytes)
enum class EPlaneConstraintAxisSetting : uint8_t
{
	EPlaneConstraintAxisSetting__Custom                                              = 0,
	EPlaneConstraintAxisSetting__X                                                   = 1,
	EPlaneConstraintAxisSetting__Y                                                   = 2,
	EPlaneConstraintAxisSetting__Z                                                   = 3,
	EPlaneConstraintAxisSetting__UseGlobalPhysicsSetting                             = 4
};

/// Enum /Script/Engine.EInterpToBehaviourType
/// Size: 0x01 (1 bytes)
enum class EInterpToBehaviourType : uint8_t
{
	EInterpToBehaviourType__OneShot                                                  = 0,
	EInterpToBehaviourType__OneShot_Reverse                                          = 1,
	EInterpToBehaviourType__Loop_Reset                                               = 2,
	EInterpToBehaviourType__PingPong                                                 = 3
};

/// Enum /Script/Engine.ETeleportType
/// Size: 0x01 (1 bytes)
enum class ETeleportType : uint8_t
{
	ETeleportType__None                                                              = 0,
	ETeleportType__TeleportPhysics                                                   = 1,
	ETeleportType__ResetPhysics                                                      = 2
};

/// Enum /Script/Engine.EPlatformInterfaceDataType
/// Size: 0x01 (1 bytes)
enum class EPlatformInterfaceDataType : uint8_t
{
	PIDT_None                                                                        = 0,
	PIDT_Int                                                                         = 1,
	PIDT_Float                                                                       = 2,
	PIDT_String                                                                      = 3,
	PIDT_Object                                                                      = 4,
	PIDT_Custom                                                                      = 5
};

/// Enum /Script/Engine.EMovementMode
/// Size: 0x01 (1 bytes)
enum class EMovementMode : uint8_t
{
	MOVE_None                                                                        = 0,
	MOVE_Walking                                                                     = 1,
	MOVE_NavWalking                                                                  = 2,
	MOVE_Falling                                                                     = 3,
	MOVE_Swimming                                                                    = 4,
	MOVE_Flying                                                                      = 5,
	MOVE_Custom                                                                      = 6
};

/// Enum /Script/Engine.ENetworkFailure
/// Size: 0x01 (1 bytes)
enum class ENetworkFailure : uint8_t
{
	ENetworkFailure__NetDriverAlreadyExists                                          = 0,
	ENetworkFailure__NetDriverCreateFailure                                          = 1,
	ENetworkFailure__NetDriverListenFailure                                          = 2,
	ENetworkFailure__ConnectionLost                                                  = 3,
	ENetworkFailure__ConnectionTimeout                                               = 4,
	ENetworkFailure__FailureReceived                                                 = 5,
	ENetworkFailure__OutdatedClient                                                  = 6,
	ENetworkFailure__OutdatedServer                                                  = 7,
	ENetworkFailure__PendingConnectionFailure                                        = 8,
	ENetworkFailure__NetGuidMismatch                                                 = 9,
	ENetworkFailure__NetChecksumMismatch                                             = 10
};

/// Enum /Script/Engine.ETravelFailure
/// Size: 0x01 (1 bytes)
enum class ETravelFailure : uint8_t
{
	ETravelFailure__NoLevel                                                          = 0,
	ETravelFailure__LoadMapFailure                                                   = 1,
	ETravelFailure__InvalidURL                                                       = 2,
	ETravelFailure__PackageMissing                                                   = 3,
	ETravelFailure__PackageVersion                                                   = 4,
	ETravelFailure__NoDownload                                                       = 5,
	ETravelFailure__TravelFailure                                                    = 6,
	ETravelFailure__CheatCommands                                                    = 7,
	ETravelFailure__PendingNetGameCreateFailure                                      = 8,
	ETravelFailure__CloudSaveFailure                                                 = 9,
	ETravelFailure__ServerTravelFailure                                              = 10,
	ETravelFailure__ClientTravelFailure                                              = 11
};

/// Enum /Script/Engine.EScreenOrientation
/// Size: 0x01 (1 bytes)
enum class EScreenOrientation : uint8_t
{
	EScreenOrientation__Unknown                                                      = 0,
	EScreenOrientation__Portrait                                                     = 1,
	EScreenOrientation__PortraitUpsideDown                                           = 2,
	EScreenOrientation__LandscapeLeft                                                = 3,
	EScreenOrientation__LandscapeRight                                               = 4,
	EScreenOrientation__FaceUp                                                       = 5,
	EScreenOrientation__FaceDown                                                     = 6
};

/// Enum /Script/Engine.EApplicationState
/// Size: 0x01 (1 bytes)
enum class EApplicationState : uint8_t
{
	EApplicationState__Unknown                                                       = 0,
	EApplicationState__Inactive                                                      = 1,
	EApplicationState__Background                                                    = 2,
	EApplicationState__Active                                                        = 3
};

/// Enum /Script/Engine.EObjectTypeQuery
/// Size: 0x01 (1 bytes)
enum class EObjectTypeQuery : uint8_t
{
	ObjectTypeQuery1                                                                 = 0,
	ObjectTypeQuery2                                                                 = 1,
	ObjectTypeQuery3                                                                 = 2,
	ObjectTypeQuery4                                                                 = 3,
	ObjectTypeQuery5                                                                 = 4,
	ObjectTypeQuery6                                                                 = 5,
	ObjectTypeQuery7                                                                 = 6,
	ObjectTypeQuery8                                                                 = 7,
	ObjectTypeQuery9                                                                 = 8,
	ObjectTypeQuery10                                                                = 9,
	ObjectTypeQuery11                                                                = 10,
	ObjectTypeQuery12                                                                = 11,
	ObjectTypeQuery13                                                                = 12,
	ObjectTypeQuery14                                                                = 13,
	ObjectTypeQuery15                                                                = 14,
	ObjectTypeQuery16                                                                = 15,
	ObjectTypeQuery17                                                                = 16,
	ObjectTypeQuery18                                                                = 17,
	ObjectTypeQuery19                                                                = 18,
	ObjectTypeQuery20                                                                = 19,
	ObjectTypeQuery21                                                                = 20,
	ObjectTypeQuery22                                                                = 21,
	ObjectTypeQuery23                                                                = 22,
	ObjectTypeQuery24                                                                = 23,
	ObjectTypeQuery25                                                                = 24,
	ObjectTypeQuery26                                                                = 25,
	ObjectTypeQuery27                                                                = 26,
	ObjectTypeQuery28                                                                = 27,
	ObjectTypeQuery29                                                                = 28,
	ObjectTypeQuery30                                                                = 29,
	ObjectTypeQuery31                                                                = 30,
	ObjectTypeQuery32                                                                = 31
};

/// Enum /Script/Engine.EDrawDebugTrace
/// Size: 0x01 (1 bytes)
enum class EDrawDebugTrace : uint8_t
{
	EDrawDebugTrace__None                                                            = 0,
	EDrawDebugTrace__ForOneFrame                                                     = 1,
	EDrawDebugTrace__ForDuration                                                     = 2,
	EDrawDebugTrace__Persistent                                                      = 3
};

/// Enum /Script/Engine.ETraceTypeQuery
/// Size: 0x01 (1 bytes)
enum class ETraceTypeQuery : uint8_t
{
	TraceTypeQuery1                                                                  = 0,
	TraceTypeQuery2                                                                  = 1,
	TraceTypeQuery3                                                                  = 2,
	TraceTypeQuery4                                                                  = 3,
	TraceTypeQuery5                                                                  = 4,
	TraceTypeQuery6                                                                  = 5,
	TraceTypeQuery7                                                                  = 6,
	TraceTypeQuery8                                                                  = 7,
	TraceTypeQuery9                                                                  = 8,
	TraceTypeQuery10                                                                 = 9,
	TraceTypeQuery11                                                                 = 10,
	TraceTypeQuery12                                                                 = 11,
	TraceTypeQuery13                                                                 = 12,
	TraceTypeQuery14                                                                 = 13,
	TraceTypeQuery15                                                                 = 14,
	TraceTypeQuery16                                                                 = 15,
	TraceTypeQuery17                                                                 = 16,
	TraceTypeQuery18                                                                 = 17,
	TraceTypeQuery19                                                                 = 18,
	TraceTypeQuery20                                                                 = 19,
	TraceTypeQuery21                                                                 = 20,
	TraceTypeQuery22                                                                 = 21,
	TraceTypeQuery23                                                                 = 22,
	TraceTypeQuery24                                                                 = 23,
	TraceTypeQuery25                                                                 = 24,
	TraceTypeQuery26                                                                 = 25,
	TraceTypeQuery27                                                                 = 26,
	TraceTypeQuery28                                                                 = 27,
	TraceTypeQuery29                                                                 = 28,
	TraceTypeQuery30                                                                 = 29,
	TraceTypeQuery31                                                                 = 30,
	TraceTypeQuery32                                                                 = 31
};

/// Enum /Script/Engine.EMoveComponentAction
/// Size: 0x01 (1 bytes)
enum class EMoveComponentAction : uint8_t
{
	EMoveComponentAction__Move                                                       = 0,
	EMoveComponentAction__Stop                                                       = 1,
	EMoveComponentAction__Return                                                     = 2
};

/// Enum /Script/Engine.EQuitPreference
/// Size: 0x01 (1 bytes)
enum class EQuitPreference : uint8_t
{
	EQuitPreference__Quit                                                            = 0,
	EQuitPreference__Background                                                      = 1
};

/// Enum /Script/Engine.EInputEvent
/// Size: 0x01 (1 bytes)
enum class EInputEvent : uint8_t
{
	IE_Pressed                                                                       = 0,
	IE_Released                                                                      = 1,
	IE_Repeat                                                                        = 2,
	IE_DoubleClick                                                                   = 3,
	IE_Axis                                                                          = 4
};

/// Enum /Script/Engine.ERelativeTransformSpace
/// Size: 0x01 (1 bytes)
enum class ERelativeTransformSpace : uint8_t
{
	RTS_World                                                                        = 0,
	RTS_Actor                                                                        = 1,
	RTS_Component                                                                    = 2,
	RTS_ParentBoneSpace                                                              = 3
};

/// Enum /Script/Engine.EAttachLocation
/// Size: 0x01 (1 bytes)
enum class EAttachLocation : uint8_t
{
	EAttachLocation__KeepRelativeOffset                                              = 0,
	EAttachLocation__KeepWorldPosition                                               = 1,
	EAttachLocation__SnapToTarget                                                    = 2,
	EAttachLocation__SnapToTargetIncludingScale                                      = 3
};

/// Enum /Script/Engine.EAttachmentRule
/// Size: 0x01 (1 bytes)
enum class EAttachmentRule : uint8_t
{
	EAttachmentRule__KeepRelative                                                    = 0,
	EAttachmentRule__KeepWorld                                                       = 1,
	EAttachmentRule__SnapToTarget                                                    = 2
};

/// Enum /Script/Engine.EDetachmentRule
/// Size: 0x01 (1 bytes)
enum class EDetachmentRule : uint8_t
{
	EDetachmentRule__KeepRelative                                                    = 0,
	EDetachmentRule__KeepWorld                                                       = 1
};

/// Enum /Script/Engine.EComponentMobility
/// Size: 0x01 (1 bytes)
enum class EComponentMobility : uint8_t
{
	EComponentMobility__Static                                                       = 0,
	EComponentMobility__Stationary                                                   = 1,
	EComponentMobility__Movable                                                      = 2
};

/// Enum /Script/Engine.EDetailMode
/// Size: 0x01 (1 bytes)
enum class EDetailMode : uint8_t
{
	DM_Low                                                                           = 0,
	DM_Medium                                                                        = 1,
	DM_High                                                                          = 2
};

/// Enum /Script/Engine.ENetRole
/// Size: 0x01 (1 bytes)
enum class ENetRole : uint8_t
{
	ROLE_None                                                                        = 0,
	ROLE_SimulatedProxy                                                              = 1,
	ROLE_AutonomousProxy                                                             = 2,
	ROLE_Authority                                                                   = 3
};

/// Enum /Script/Engine.ENetDormancy
/// Size: 0x01 (1 bytes)
enum class ENetDormancy : uint8_t
{
	DORM_Never                                                                       = 0,
	DORM_Awake                                                                       = 1,
	DORM_DormantAll                                                                  = 2,
	DORM_DormantPartial                                                              = 3,
	DORM_Initial                                                                     = 4
};

/// Enum /Script/Engine.EAutoReceiveInput
/// Size: 0x01 (1 bytes)
enum class EAutoReceiveInput : uint8_t
{
	EAutoReceiveInput__Disabled                                                      = 0,
	EAutoReceiveInput__Player0                                                       = 1,
	EAutoReceiveInput__Player1                                                       = 2,
	EAutoReceiveInput__Player2                                                       = 3,
	EAutoReceiveInput__Player3                                                       = 4,
	EAutoReceiveInput__Player4                                                       = 5,
	EAutoReceiveInput__Player5                                                       = 6,
	EAutoReceiveInput__Player6                                                       = 7,
	EAutoReceiveInput__Player7                                                       = 8
};

/// Enum /Script/Engine.ESpawnActorCollisionHandlingMethod
/// Size: 0x01 (1 bytes)
enum class ESpawnActorCollisionHandlingMethod : uint8_t
{
	ESpawnActorCollisionHandlingMethod__Undefined                                    = 0,
	ESpawnActorCollisionHandlingMethod__AlwaysSpawn                                  = 1,
	ESpawnActorCollisionHandlingMethod__AdjustIfPossibleButAlwaysSpawn               = 2,
	ESpawnActorCollisionHandlingMethod__AdjustIfPossibleButDontSpawnIfColliding      = 3,
	ESpawnActorCollisionHandlingMethod__DontSpawnIfColliding                         = 4
};

/// Enum /Script/Engine.ERotatorQuantization
/// Size: 0x01 (1 bytes)
enum class ERotatorQuantization : uint8_t
{
	ERotatorQuantization__ByteComponents                                             = 0,
	ERotatorQuantization__ShortComponents                                            = 1
};

/// Enum /Script/Engine.EVectorQuantization
/// Size: 0x01 (1 bytes)
enum class EVectorQuantization : uint8_t
{
	EVectorQuantization__RoundWholeNumber                                            = 0,
	EVectorQuantization__RoundOneDecimal                                             = 1,
	EVectorQuantization__RoundTwoDecimals                                            = 2
};

/// Enum /Script/Engine.EActorUpdateOverlapsMethod
/// Size: 0x01 (1 bytes)
enum class EActorUpdateOverlapsMethod : uint8_t
{
	EActorUpdateOverlapsMethod__UseConfigDefault                                     = 0,
	EActorUpdateOverlapsMethod__AlwaysUpdate                                         = 1,
	EActorUpdateOverlapsMethod__OnlyUpdateMovable                                    = 2,
	EActorUpdateOverlapsMethod__NeverUpdate                                          = 3
};

/// Enum /Script/Engine.EMouseLockMode
/// Size: 0x01 (1 bytes)
enum class EMouseLockMode : uint8_t
{
	EMouseLockMode__DoNotLock                                                        = 0,
	EMouseLockMode__LockOnCapture                                                    = 1,
	EMouseLockMode__LockAlways                                                       = 2,
	EMouseLockMode__LockInFullscreen                                                 = 3
};

/// Enum /Script/Engine.EWindowTitleBarMode
/// Size: 0x01 (1 bytes)
enum class EWindowTitleBarMode : uint8_t
{
	EWindowTitleBarMode__Overlay                                                     = 0,
	EWindowTitleBarMode__VerticalBox                                                 = 1
};

/// Enum /Script/Engine.EAlphaBlendOption
/// Size: 0x01 (1 bytes)
enum class EAlphaBlendOption : uint8_t
{
	EAlphaBlendOption__Linear                                                        = 0,
	EAlphaBlendOption__Cubic                                                         = 1,
	EAlphaBlendOption__HermiteCubic                                                  = 2,
	EAlphaBlendOption__Sinusoidal                                                    = 3,
	EAlphaBlendOption__QuadraticInOut                                                = 4,
	EAlphaBlendOption__CubicInOut                                                    = 5,
	EAlphaBlendOption__QuarticInOut                                                  = 6,
	EAlphaBlendOption__QuinticInOut                                                  = 7,
	EAlphaBlendOption__CircularIn                                                    = 8,
	EAlphaBlendOption__CircularOut                                                   = 9,
	EAlphaBlendOption__CircularInOut                                                 = 10,
	EAlphaBlendOption__ExpIn                                                         = 11,
	EAlphaBlendOption__ExpOut                                                        = 12,
	EAlphaBlendOption__ExpInOut                                                      = 13,
	EAlphaBlendOption__Custom                                                        = 14
};

/// Enum /Script/Engine.EAnimSyncGroupScope
/// Size: 0x01 (1 bytes)
enum class EAnimSyncGroupScope : uint8_t
{
	EAnimSyncGroupScope__Local                                                       = 0,
	EAnimSyncGroupScope__Component                                                   = 1
};

/// Enum /Script/Engine.EAnimGroupRole
/// Size: 0x01 (1 bytes)
enum class EAnimGroupRole : uint8_t
{
	EAnimGroupRole__CanBeLeader                                                      = 0,
	EAnimGroupRole__AlwaysFollower                                                   = 1,
	EAnimGroupRole__AlwaysLeader                                                     = 2,
	EAnimGroupRole__TransitionLeader                                                 = 3,
	EAnimGroupRole__TransitionFollower                                               = 4
};

/// Enum /Script/Engine.EPreviewAnimationBlueprintApplicationMethod
/// Size: 0x01 (1 bytes)
enum class EPreviewAnimationBlueprintApplicationMethod : uint8_t
{
	EPreviewAnimationBlueprintApplicationMethod__LinkedLayers                        = 0,
	EPreviewAnimationBlueprintApplicationMethod__LinkedAnimGraph                     = 1
};

/// Enum /Script/Engine.AnimationKeyFormat
/// Size: 0x01 (1 bytes)
enum class AnimationKeyFormat : uint8_t
{
	AKF_ConstantKeyLerp                                                              = 0,
	AKF_VariableKeyLerp                                                              = 1,
	AKF_PerTrackCompression                                                          = 2
};

/// Enum /Script/Engine.ERawCurveTrackTypes
/// Size: 0x01 (1 bytes)
enum class ERawCurveTrackTypes : uint8_t
{
	ERawCurveTrackTypes__RCT_Float                                                   = 0,
	ERawCurveTrackTypes__RCT_Vector                                                  = 1,
	ERawCurveTrackTypes__RCT_Transform                                               = 2
};

/// Enum /Script/Engine.EAnimAssetCurveFlags
/// Size: 0x01 (1 bytes)
enum class EAnimAssetCurveFlags : uint8_t
{
	AACF_NONE                                                                        = 0,
	AACF_DriveMorphTarget_DEPRECATED                                                 = 1,
	AACF_DriveAttribute_DEPRECATED                                                   = 2,
	AACF_Editable                                                                    = 4,
	AACF_DriveMaterial_DEPRECATED                                                    = 8,
	AACF_Metadata                                                                    = 16,
	AACF_DriveTrack                                                                  = 32,
	AACF_Disabled                                                                    = 64
};

/// Enum /Script/Engine.AnimationCompressionFormat
/// Size: 0x01 (1 bytes)
enum class AnimationCompressionFormat : uint8_t
{
	ACF_None                                                                         = 0,
	ACF_Float96NoW                                                                   = 1,
	ACF_Fixed48NoW                                                                   = 2,
	ACF_IntervalFixed32NoW                                                           = 3,
	ACF_Fixed32NoW                                                                   = 4,
	ACF_Float32NoW                                                                   = 5,
	ACF_Identity                                                                     = 6
};

/// Enum /Script/Engine.EAdditiveBasePoseType
/// Size: 0x01 (1 bytes)
enum class EAdditiveBasePoseType : uint8_t
{
	ABPT_None                                                                        = 0,
	ABPT_RefPose                                                                     = 1,
	ABPT_AnimScaled                                                                  = 2,
	ABPT_AnimFrame                                                                   = 3
};

/// Enum /Script/Engine.ERootMotionMode
/// Size: 0x01 (1 bytes)
enum class ERootMotionMode : uint8_t
{
	ERootMotionMode__NoRootMotionExtraction                                          = 0,
	ERootMotionMode__IgnoreRootMotion                                                = 1,
	ERootMotionMode__RootMotionFromEverything                                        = 2,
	ERootMotionMode__RootMotionFromMontagesOnly                                      = 3
};

/// Enum /Script/Engine.ERootMotionRootLock
/// Size: 0x01 (1 bytes)
enum class ERootMotionRootLock : uint8_t
{
	ERootMotionRootLock__RefPose                                                     = 0,
	ERootMotionRootLock__AnimFirstFrame                                              = 1,
	ERootMotionRootLock__Zero                                                        = 2
};

/// Enum /Script/Engine.EMontagePlayReturnType
/// Size: 0x01 (1 bytes)
enum class EMontagePlayReturnType : uint8_t
{
	EMontagePlayReturnType__MontageLength                                            = 0,
	EMontagePlayReturnType__Duration                                                 = 1
};

/// Enum /Script/Engine.EDrawDebugItemType
/// Size: 0x01 (1 bytes)
enum class EDrawDebugItemType : uint8_t
{
	EDrawDebugItemType__DirectionalArrow                                             = 0,
	EDrawDebugItemType__Sphere                                                       = 1,
	EDrawDebugItemType__Line                                                         = 2,
	EDrawDebugItemType__OnScreenMessage                                              = 3,
	EDrawDebugItemType__CoordinateSystem                                             = 4
};

/// Enum /Script/Engine.EAnimLinkMethod
/// Size: 0x01 (1 bytes)
enum class EAnimLinkMethod : uint8_t
{
	EAnimLinkMethod__Absolute                                                        = 0,
	EAnimLinkMethod__Relative                                                        = 1,
	EAnimLinkMethod__Proportional                                                    = 2
};

/// Enum /Script/Engine.EMontageSubStepResult
/// Size: 0x01 (1 bytes)
enum class EMontageSubStepResult : uint8_t
{
	EMontageSubStepResult__Moved                                                     = 0,
	EMontageSubStepResult__NotMoved                                                  = 1,
	EMontageSubStepResult__InvalidSection                                            = 2,
	EMontageSubStepResult__InvalidMontage                                            = 3
};

/// Enum /Script/Engine.EAnimNotifyEventType
/// Size: 0x01 (1 bytes)
enum class EAnimNotifyEventType : uint8_t
{
	EAnimNotifyEventType__Begin                                                      = 0,
	EAnimNotifyEventType__End                                                        = 1
};

/// Enum /Script/Engine.EInertializationSpace
/// Size: 0x01 (1 bytes)
enum class EInertializationSpace : uint8_t
{
	EInertializationSpace__Default                                                   = 0,
	EInertializationSpace__WorldSpace                                                = 1,
	EInertializationSpace__WorldRotation                                             = 2
};

/// Enum /Script/Engine.EInertializationBoneState
/// Size: 0x01 (1 bytes)
enum class EInertializationBoneState : uint8_t
{
	EInertializationBoneState__Invalid                                               = 0,
	EInertializationBoneState__Valid                                                 = 1,
	EInertializationBoneState__Excluded                                              = 2
};

/// Enum /Script/Engine.EInertializationState
/// Size: 0x01 (1 bytes)
enum class EInertializationState : uint8_t
{
	EInertializationState__Inactive                                                  = 0,
	EInertializationState__Pending                                                   = 1,
	EInertializationState__Active                                                    = 2
};

/// Enum /Script/Engine.EEvaluatorMode
/// Size: 0x01 (1 bytes)
enum class EEvaluatorMode : uint8_t
{
	EEvaluatorMode__EM_Standard                                                      = 0,
	EEvaluatorMode__EM_Freeze                                                        = 1,
	EEvaluatorMode__EM_DelayedFreeze                                                 = 2
};

/// Enum /Script/Engine.EEvaluatorDataSource
/// Size: 0x01 (1 bytes)
enum class EEvaluatorDataSource : uint8_t
{
	EEvaluatorDataSource__EDS_SourcePose                                             = 0,
	EEvaluatorDataSource__EDS_DestinationPose                                        = 1
};

/// Enum /Script/Engine.EPostCopyOperation
/// Size: 0x01 (1 bytes)
enum class EPostCopyOperation : uint8_t
{
	EPostCopyOperation__None                                                         = 0,
	EPostCopyOperation__LogicalNegateBool                                            = 1
};

/// Enum /Script/Engine.EPinHidingMode
/// Size: 0x01 (1 bytes)
enum class EPinHidingMode : uint8_t
{
	EPinHidingMode__NeverAsPin                                                       = 0,
	EPinHidingMode__PinHiddenByDefault                                               = 1,
	EPinHidingMode__PinShownByDefault                                                = 2,
	EPinHidingMode__AlwaysAsPin                                                      = 3
};

/// Enum /Script/Engine.AnimPhysCollisionType
/// Size: 0x01 (1 bytes)
enum class AnimPhysCollisionType : uint8_t
{
	AnimPhysCollisionType__CoM                                                       = 0,
	AnimPhysCollisionType__CustomSphere                                              = 1,
	AnimPhysCollisionType__InnerSphere                                               = 2,
	AnimPhysCollisionType__OuterSphere                                               = 3
};

/// Enum /Script/Engine.AnimPhysTwistAxis
/// Size: 0x01 (1 bytes)
enum class AnimPhysTwistAxis : uint8_t
{
	AnimPhysTwistAxis__AxisX                                                         = 0,
	AnimPhysTwistAxis__AxisY                                                         = 1,
	AnimPhysTwistAxis__AxisZ                                                         = 2
};

/// Enum /Script/Engine.ETypeAdvanceAnim
/// Size: 0x01 (1 bytes)
enum class ETypeAdvanceAnim : uint8_t
{
	ETAA_Default                                                                     = 0,
	ETAA_Finished                                                                    = 1,
	ETAA_Looped                                                                      = 2
};

/// Enum /Script/Engine.ETransitionLogicType
/// Size: 0x01 (1 bytes)
enum class ETransitionLogicType : uint8_t
{
	ETransitionLogicType__TLT_StandardBlend                                          = 0,
	ETransitionLogicType__TLT_Inertialization                                        = 1,
	ETransitionLogicType__TLT_Custom                                                 = 2
};

/// Enum /Script/Engine.ETransitionBlendMode
/// Size: 0x01 (1 bytes)
enum class ETransitionBlendMode : uint8_t
{
	ETransitionBlendMode__TBM_Linear                                                 = 0,
	ETransitionBlendMode__TBM_Cubic                                                  = 1
};

/// Enum /Script/Engine.EComponentType
/// Size: 0x01 (1 bytes)
enum class EComponentType : uint8_t
{
	EComponentType__None                                                             = 0,
	EComponentType__TranslationX                                                     = 1,
	EComponentType__TranslationY                                                     = 2,
	EComponentType__TranslationZ                                                     = 3,
	EComponentType__RotationX                                                        = 4,
	EComponentType__RotationY                                                        = 5,
	EComponentType__RotationZ                                                        = 6,
	EComponentType__Scale                                                            = 7,
	EComponentType__ScaleX                                                           = 8,
	EComponentType__ScaleY                                                           = 9,
	EComponentType__ScaleZ                                                           = 10
};

/// Enum /Script/Engine.EAxisOption
/// Size: 0x01 (1 bytes)
enum class EAxisOption : uint8_t
{
	EAxisOption__X                                                                   = 0,
	EAxisOption__Y                                                                   = 1,
	EAxisOption__Z                                                                   = 2,
	EAxisOption__X_Neg                                                               = 3,
	EAxisOption__Y_Neg                                                               = 4,
	EAxisOption__Z_Neg                                                               = 5,
	EAxisOption__Custom                                                              = 6
};

/// Enum /Script/Engine.EAnimInterpolationType
/// Size: 0x01 (1 bytes)
enum class EAnimInterpolationType : uint8_t
{
	EAnimInterpolationType__Linear                                                   = 0,
	EAnimInterpolationType__Step                                                     = 1
};

/// Enum /Script/Engine.ECurveBlendOption
/// Size: 0x01 (1 bytes)
enum class ECurveBlendOption : uint8_t
{
	ECurveBlendOption__Override                                                      = 0,
	ECurveBlendOption__DoNotOverride                                                 = 1,
	ECurveBlendOption__NormalizeByWeight                                             = 2,
	ECurveBlendOption__BlendByWeight                                                 = 3,
	ECurveBlendOption__UseBasePose                                                   = 4,
	ECurveBlendOption__UseMaxValue                                                   = 5,
	ECurveBlendOption__UseMinValue                                                   = 6
};

/// Enum /Script/Engine.EAdditiveAnimationType
/// Size: 0x01 (1 bytes)
enum class EAdditiveAnimationType : uint8_t
{
	AAT_None                                                                         = 0,
	AAT_LocalSpaceBase                                                               = 1,
	AAT_RotationOffsetMeshSpace                                                      = 2
};

/// Enum /Script/Engine.ENotifyFilterType
/// Size: 0x01 (1 bytes)
enum class ENotifyFilterType : uint8_t
{
	ENotifyFilterType__NoFiltering                                                   = 0,
	ENotifyFilterType__LOD                                                           = 1
};

/// Enum /Script/Engine.EMontageNotifyTickType
/// Size: 0x01 (1 bytes)
enum class EMontageNotifyTickType : uint8_t
{
	EMontageNotifyTickType__Queued                                                   = 0,
	EMontageNotifyTickType__BranchingPoint                                           = 1
};

/// Enum /Script/Engine.EBoneRotationSource
/// Size: 0x01 (1 bytes)
enum class EBoneRotationSource : uint8_t
{
	BRS_KeepComponentSpaceRotation                                                   = 0,
	BRS_KeepLocalSpaceRotation                                                       = 1,
	BRS_CopyFromTarget                                                               = 2
};

/// Enum /Script/Engine.EBoneControlSpace
/// Size: 0x01 (1 bytes)
enum class EBoneControlSpace : uint8_t
{
	BCS_WorldSpace                                                                   = 0,
	BCS_ComponentSpace                                                               = 1,
	BCS_ParentBoneSpace                                                              = 2,
	BCS_BoneSpace                                                                    = 3
};

/// Enum /Script/Engine.EBoneAxis
/// Size: 0x01 (1 bytes)
enum class EBoneAxis : uint8_t
{
	BA_X                                                                             = 0,
	BA_Y                                                                             = 1,
	BA_Z                                                                             = 2
};

/// Enum /Script/Engine.EPrimaryAssetCookRule
/// Size: 0x01 (1 bytes)
enum class EPrimaryAssetCookRule : uint8_t
{
	EPrimaryAssetCookRule__Unknown                                                   = 0,
	EPrimaryAssetCookRule__NeverCook                                                 = 1,
	EPrimaryAssetCookRule__DevelopmentCook                                           = 2,
	EPrimaryAssetCookRule__DevelopmentAlwaysCook                                     = 3,
	EPrimaryAssetCookRule__AlwaysCook                                                = 4
};

/// Enum /Script/Engine.ENaturalSoundFalloffMode
/// Size: 0x01 (1 bytes)
enum class ENaturalSoundFalloffMode : uint8_t
{
	ENaturalSoundFalloffMode__Continues                                              = 0,
	ENaturalSoundFalloffMode__Silent                                                 = 1,
	ENaturalSoundFalloffMode__Hold                                                   = 2
};

/// Enum /Script/Engine.EAttenuationShape
/// Size: 0x01 (1 bytes)
enum class EAttenuationShape : uint8_t
{
	EAttenuationShape__Sphere                                                        = 0,
	EAttenuationShape__Capsule                                                       = 1,
	EAttenuationShape__Box                                                           = 2,
	EAttenuationShape__Cone                                                          = 3
};

/// Enum /Script/Engine.EAttenuationDistanceModel
/// Size: 0x01 (1 bytes)
enum class EAttenuationDistanceModel : uint8_t
{
	EAttenuationDistanceModel__Linear                                                = 0,
	EAttenuationDistanceModel__Logarithmic                                           = 1,
	EAttenuationDistanceModel__Inverse                                               = 2,
	EAttenuationDistanceModel__LogReverse                                            = 3,
	EAttenuationDistanceModel__NaturalSound                                          = 4,
	EAttenuationDistanceModel__Custom                                                = 5
};

/// Enum /Script/Engine.EAudioBusChannels
/// Size: 0x01 (1 bytes)
enum class EAudioBusChannels : uint8_t
{
	EAudioBusChannels__Mono                                                          = 0,
	EAudioBusChannels__Stereo                                                        = 1
};

/// Enum /Script/Engine.EAudioFaderCurve
/// Size: 0x01 (1 bytes)
enum class EAudioFaderCurve : uint8_t
{
	EAudioFaderCurve__Linear                                                         = 0,
	EAudioFaderCurve__Logarithmic                                                    = 1,
	EAudioFaderCurve__SCurve                                                         = 2,
	EAudioFaderCurve__Sin                                                            = 3,
	EAudioFaderCurve__Count                                                          = 4
};

/// Enum /Script/Engine.EAudioOutputTarget
/// Size: 0x01 (1 bytes)
enum class EAudioOutputTarget : uint8_t
{
	EAudioOutputTarget__Speaker                                                      = 0,
	EAudioOutputTarget__Controller                                                   = 1,
	EAudioOutputTarget__ControllerFallbackToSpeaker                                  = 2
};

/// Enum /Script/Engine.EMonoChannelUpmixMethod
/// Size: 0x01 (1 bytes)
enum class EMonoChannelUpmixMethod : uint8_t
{
	EMonoChannelUpmixMethod__Linear                                                  = 0,
	EMonoChannelUpmixMethod__EqualPower                                              = 1,
	EMonoChannelUpmixMethod__FullVolume                                              = 2
};

/// Enum /Script/Engine.EPanningMethod
/// Size: 0x01 (1 bytes)
enum class EPanningMethod : uint8_t
{
	EPanningMethod__Linear                                                           = 0,
	EPanningMethod__EqualPower                                                       = 1
};

/// Enum /Script/Engine.EVoiceSampleRate
/// Size: 0x04 (4 bytes)
enum class EVoiceSampleRate : uint32_t
{
	EVoiceSampleRate__Low16000Hz                                                     = 16000,
	EVoiceSampleRate__Normal24000Hz                                                  = 24000
};

/// Enum /Script/Engine.EAudioVolumeLocationState
/// Size: 0x01 (1 bytes)
enum class EAudioVolumeLocationState : uint8_t
{
	EAudioVolumeLocationState__InsideTheVolume                                       = 0,
	EAudioVolumeLocationState__OutsideTheVolume                                      = 1
};

/// Enum /Script/Engine.EBlendableLocation
/// Size: 0x01 (1 bytes)
enum class EBlendableLocation : uint8_t
{
	BL_AfterTonemapping                                                              = 0,
	BL_BeforeTonemapping                                                             = 1,
	BL_BeforeTranslucency                                                            = 2,
	BL_Distortion                                                                    = 3,
	BL_AfterUpscale                                                                  = 4,
	BL_BloomCombine                                                                  = 5,
	BL_HalfResSetup                                                                  = 6,
	BL_ReplacingTonemapper                                                           = 7,
	BL_SSRInput                                                                      = 8
};

/// Enum /Script/Engine.ENotifyTriggerMode
/// Size: 0x01 (1 bytes)
enum class ENotifyTriggerMode : uint8_t
{
	ENotifyTriggerMode__AllAnimations                                                = 0,
	ENotifyTriggerMode__HighestWeightedAnimation                                     = 1,
	ENotifyTriggerMode__None                                                         = 2
};

/// Enum /Script/Engine.EBlendSpaceAxis
/// Size: 0x01 (1 bytes)
enum class EBlendSpaceAxis : uint8_t
{
	BSA_None                                                                         = 0,
	BSA_X                                                                            = 1,
	BSA_Y                                                                            = 2,
	BSA_Max                                                                          = 3
};

/// Enum /Script/Engine.EBlueprintNativizationFlag
/// Size: 0x01 (1 bytes)
enum class EBlueprintNativizationFlag : uint8_t
{
	EBlueprintNativizationFlag__Disabled                                             = 0,
	EBlueprintNativizationFlag__Dependency                                           = 1,
	EBlueprintNativizationFlag__ExplicitlyEnabled                                    = 2
};

/// Enum /Script/Engine.EBlueprintCompileMode
/// Size: 0x01 (1 bytes)
enum class EBlueprintCompileMode : uint8_t
{
	EBlueprintCompileMode__Default                                                   = 0,
	EBlueprintCompileMode__Development                                               = 1,
	EBlueprintCompileMode__FinalRelease                                              = 2
};

/// Enum /Script/Engine.EBlueprintType
/// Size: 0x01 (1 bytes)
enum class EBlueprintType : uint8_t
{
	BPTYPE_Normal                                                                    = 0,
	BPTYPE_Const                                                                     = 1,
	BPTYPE_MacroLibrary                                                              = 2,
	BPTYPE_Interface                                                                 = 3,
	BPTYPE_LevelScript                                                               = 4,
	BPTYPE_FunctionLibrary                                                           = 5
};

/// Enum /Script/Engine.EBlueprintStatus
/// Size: 0x01 (1 bytes)
enum class EBlueprintStatus : uint8_t
{
	BS_Unknown                                                                       = 0,
	BS_Dirty                                                                         = 1,
	BS_Error                                                                         = 2,
	BS_UpToDate                                                                      = 3,
	BS_BeingCreated                                                                  = 4,
	BS_UpToDateWithWarnings                                                          = 5
};

/// Enum /Script/Engine.EDOFMode
/// Size: 0x01 (1 bytes)
enum class EDOFMode : uint8_t
{
	EDOFMode__Default                                                                = 0,
	EDOFMode__SixDOF                                                                 = 1,
	EDOFMode__YZPlane                                                                = 2,
	EDOFMode__XZPlane                                                                = 3,
	EDOFMode__XYPlane                                                                = 4,
	EDOFMode__CustomPlane                                                            = 5,
	EDOFMode__None                                                                   = 6
};

/// Enum /Script/Engine.EBrushType
/// Size: 0x01 (1 bytes)
enum class EBrushType : uint8_t
{
	Brush_Default                                                                    = 0,
	Brush_Add                                                                        = 1,
	Brush_Subtract                                                                   = 2
};

/// Enum /Script/Engine.ECsgOper
/// Size: 0x01 (1 bytes)
enum class ECsgOper : uint8_t
{
	CSG_Active                                                                       = 0,
	CSG_Add                                                                          = 1,
	CSG_Subtract                                                                     = 2,
	CSG_Intersect                                                                    = 3,
	CSG_Deintersect                                                                  = 4,
	CSG_None                                                                         = 5
};

/// Enum /Script/Engine.EInitialOscillatorOffset
/// Size: 0x01 (1 bytes)
enum class EInitialOscillatorOffset : uint8_t
{
	EOO_OffsetRandom                                                                 = 0,
	EOO_OffsetZero                                                                   = 1
};

/// Enum /Script/Engine.EOscillatorWaveform
/// Size: 0x01 (1 bytes)
enum class EOscillatorWaveform : uint8_t
{
	EOscillatorWaveform__SineWave                                                    = 0,
	EOscillatorWaveform__PerlinNoise                                                 = 1
};

/// Enum /Script/Engine.ECameraShakeDurationType
/// Size: 0x01 (1 bytes)
enum class ECameraShakeDurationType : uint8_t
{
	ECameraShakeDurationType__Fixed                                                  = 0,
	ECameraShakeDurationType__Infinite                                               = 1,
	ECameraShakeDurationType__Custom                                                 = 2
};

/// Enum /Script/Engine.ECameraShakeUpdateResultFlags
/// Size: 0x01 (1 bytes)
enum class ECameraShakeUpdateResultFlags : uint8_t
{
	ECameraShakeUpdateResultFlags__ApplyAsAbsolute                                   = 1,
	ECameraShakeUpdateResultFlags__SkipAutoScale                                     = 2,
	ECameraShakeUpdateResultFlags__SkipAutoPlaySpace                                 = 4,
	ECameraShakeUpdateResultFlags__Default                                           = 0
};

/// Enum /Script/Engine.ECameraShakeAttenuation
/// Size: 0x01 (1 bytes)
enum class ECameraShakeAttenuation : uint8_t
{
	ECameraShakeAttenuation__Linear                                                  = 0,
	ECameraShakeAttenuation__Quadratic                                               = 1
};

/// Enum /Script/Engine.ECameraAlphaBlendMode
/// Size: 0x01 (1 bytes)
enum class ECameraAlphaBlendMode : uint8_t
{
	ECameraAlphaBlendMode__CABM_Linear                                               = 0,
	ECameraAlphaBlendMode__CABM_Cubic                                                = 1
};

/// Enum /Script/Engine.ECameraShakePlaySpace
/// Size: 0x01 (1 bytes)
enum class ECameraShakePlaySpace : uint8_t
{
	ECameraShakePlaySpace__CameraLocal                                               = 0,
	ECameraShakePlaySpace__World                                                     = 1,
	ECameraShakePlaySpace__UserDefined                                               = 2
};

/// Enum /Script/Engine.ECameraProjectionMode
/// Size: 0x01 (1 bytes)
enum class ECameraProjectionMode : uint8_t
{
	ECameraProjectionMode__Perspective                                               = 0,
	ECameraProjectionMode__Orthographic                                              = 1
};

/// Enum /Script/Engine.ECloudStorageDelegate
/// Size: 0x01 (1 bytes)
enum class ECloudStorageDelegate : uint8_t
{
	CSD_KeyValueReadComplete                                                         = 0,
	CSD_KeyValueWriteComplete                                                        = 1,
	CSD_ValueChanged                                                                 = 2,
	CSD_DocumentQueryComplete                                                        = 3,
	CSD_DocumentReadComplete                                                         = 4,
	CSD_DocumentWriteComplete                                                        = 5,
	CSD_DocumentConflictDetected                                                     = 6
};

/// Enum /Script/Engine.EAngularDriveMode
/// Size: 0x01 (1 bytes)
enum class EAngularDriveMode : uint8_t
{
	EAngularDriveMode__SLERP                                                         = 0,
	EAngularDriveMode__TwistAndSwing                                                 = 1
};

/// Enum /Script/Engine.ECurveTableMode
/// Size: 0x01 (1 bytes)
enum class ECurveTableMode : uint8_t
{
	ECurveTableMode__Empty                                                           = 0,
	ECurveTableMode__SimpleCurves                                                    = 1,
	ECurveTableMode__RichCurves                                                      = 2
};

/// Enum /Script/Engine.ECustomAttributeBlendType
/// Size: 0x01 (1 bytes)
enum class ECustomAttributeBlendType : uint8_t
{
	ECustomAttributeBlendType__Override                                              = 0,
	ECustomAttributeBlendType__Blend                                                 = 1
};

/// Enum /Script/Engine.EEvaluateCurveTableResult
/// Size: 0x01 (1 bytes)
enum class EEvaluateCurveTableResult : uint8_t
{
	EEvaluateCurveTableResult__RowFound                                              = 0,
	EEvaluateCurveTableResult__RowNotFound                                           = 1
};

/// Enum /Script/Engine.EGrammaticalNumber
/// Size: 0x01 (1 bytes)
enum class EGrammaticalNumber : uint8_t
{
	EGrammaticalNumber__Singular                                                     = 0,
	EGrammaticalNumber__Plural                                                       = 1
};

/// Enum /Script/Engine.EGrammaticalGender
/// Size: 0x01 (1 bytes)
enum class EGrammaticalGender : uint8_t
{
	EGrammaticalGender__Neuter                                                       = 0,
	EGrammaticalGender__Masculine                                                    = 1,
	EGrammaticalGender__Feminine                                                     = 2,
	EGrammaticalGender__Mixed                                                        = 3
};

/// Enum /Script/Engine.DistributionParamMode
/// Size: 0x01 (1 bytes)
enum class DistributionParamMode : uint8_t
{
	DPM_Normal                                                                       = 0,
	DPM_Abs                                                                          = 1,
	DPM_Direct                                                                       = 2
};

/// Enum /Script/Engine.EDistributionVectorMirrorFlags
/// Size: 0x01 (1 bytes)
enum class EDistributionVectorMirrorFlags : uint8_t
{
	EDVMF_Same                                                                       = 0,
	EDVMF_Different                                                                  = 1,
	EDVMF_Mirror                                                                     = 2
};

/// Enum /Script/Engine.EDistributionVectorLockFlags
/// Size: 0x01 (1 bytes)
enum class EDistributionVectorLockFlags : uint8_t
{
	EDVLF_None                                                                       = 0,
	EDVLF_XY                                                                         = 1,
	EDVLF_XZ                                                                         = 2,
	EDVLF_YZ                                                                         = 3,
	EDVLF_XYZ                                                                        = 4
};

/// Enum /Script/Engine.ENodeEnabledState
/// Size: 0x01 (1 bytes)
enum class ENodeEnabledState : uint8_t
{
	ENodeEnabledState__Enabled                                                       = 0,
	ENodeEnabledState__Disabled                                                      = 1,
	ENodeEnabledState__DevelopmentOnly                                               = 2
};

/// Enum /Script/Engine.ENodeAdvancedPins
/// Size: 0x01 (1 bytes)
enum class ENodeAdvancedPins : uint8_t
{
	ENodeAdvancedPins__NoPins                                                        = 0,
	ENodeAdvancedPins__Shown                                                         = 1,
	ENodeAdvancedPins__Hidden                                                        = 2
};

/// Enum /Script/Engine.ENodeTitleType
/// Size: 0x01 (1 bytes)
enum class ENodeTitleType : uint8_t
{
	ENodeTitleType__FullTitle                                                        = 0,
	ENodeTitleType__ListView                                                         = 1,
	ENodeTitleType__EditableTitle                                                    = 2,
	ENodeTitleType__MenuTitle                                                        = 3,
	ENodeTitleType__MAX_TitleTypes                                                   = 4
};

/// Enum /Script/Engine.EPinContainerType
/// Size: 0x01 (1 bytes)
enum class EPinContainerType : uint8_t
{
	EPinContainerType__None                                                          = 0,
	EPinContainerType__Array                                                         = 1,
	EPinContainerType__Set                                                           = 2,
	EPinContainerType__Map                                                           = 3
};

/// Enum /Script/Engine.EEdGraphPinDirection
/// Size: 0x01 (1 bytes)
enum class EEdGraphPinDirection : uint8_t
{
	EGPD_Input                                                                       = 0,
	EGPD_Output                                                                      = 1
};

/// Enum /Script/Engine.EBlueprintPinStyleType
/// Size: 0x01 (1 bytes)
enum class EBlueprintPinStyleType : uint8_t
{
	BPST_Original                                                                    = 0,
	BPST_VariantA                                                                    = 1
};

/// Enum /Script/Engine.ECanCreateConnectionResponse
/// Size: 0x01 (1 bytes)
enum class ECanCreateConnectionResponse : uint8_t
{
	CONNECT_RESPONSE_MAKE                                                            = 0,
	CONNECT_RESPONSE_DISALLOW                                                        = 1,
	CONNECT_RESPONSE_BREAK_OTHERS_A                                                  = 2,
	CONNECT_RESPONSE_BREAK_OTHERS_B                                                  = 3,
	CONNECT_RESPONSE_BREAK_OTHERS_AB                                                 = 4,
	CONNECT_RESPONSE_MAKE_WITH_CONVERSION_NODE                                       = 5
};

/// Enum /Script/Engine.EGraphType
/// Size: 0x01 (1 bytes)
enum class EGraphType : uint8_t
{
	GT_Function                                                                      = 0,
	GT_Ubergraph                                                                     = 1,
	GT_Macro                                                                         = 2,
	GT_Animation                                                                     = 3,
	GT_StateMachine                                                                  = 4
};

/// Enum /Script/Engine.ETransitionType
/// Size: 0x01 (1 bytes)
enum class ETransitionType : uint8_t
{
	ETransitionType__None                                                            = 0,
	ETransitionType__Paused                                                          = 1,
	ETransitionType__Loading                                                         = 2,
	ETransitionType__Saving                                                          = 3,
	ETransitionType__Connecting                                                      = 4,
	ETransitionType__Precaching                                                      = 5,
	ETransitionType__WaitingToConnect                                                = 6
};

/// Enum /Script/Engine.EFullyLoadPackageType
/// Size: 0x01 (1 bytes)
enum class EFullyLoadPackageType : uint8_t
{
	FULLYLOAD_Map                                                                    = 0,
	FULLYLOAD_Game_PreLoadClass                                                      = 1,
	FULLYLOAD_Game_PostLoadClass                                                     = 2,
	FULLYLOAD_Always                                                                 = 3,
	FULLYLOAD_Mutator                                                                = 4
};

/// Enum /Script/Engine.EViewModeIndex
/// Size: 0x01 (1 bytes)
enum class EViewModeIndex : uint8_t
{
	VMI_BrushWireframe                                                               = 0,
	VMI_Wireframe                                                                    = 1,
	VMI_Unlit                                                                        = 2,
	VMI_Lit                                                                          = 3,
	VMI_Lit_DetailLighting                                                           = 4,
	VMI_LightingOnly                                                                 = 5,
	VMI_LightComplexity                                                              = 6,
	VMI_ShaderComplexity                                                             = 8,
	VMI_LightmapDensity                                                              = 9,
	VMI_LitLightmapDensity                                                           = 10,
	VMI_ReflectionOverride                                                           = 11,
	VMI_VisualizeBuffer                                                              = 12,
	VMI_StationaryLightOverlap                                                       = 14,
	VMI_CollisionPawn                                                                = 15,
	VMI_CollisionVisibility                                                          = 16,
	VMI_LODColoration                                                                = 18,
	VMI_QuadOverdraw                                                                 = 19,
	VMI_PrimitiveDistanceAccuracy                                                    = 20,
	VMI_MeshUVDensityAccuracy                                                        = 21,
	VMI_ShaderComplexityWithQuadOverdraw                                             = 22,
	VMI_HLODColoration                                                               = 23,
	VMI_GroupLODColoration                                                           = 24,
	VMI_MaterialTextureScaleAccuracy                                                 = 25,
	VMI_RequiredTextureResolution                                                    = 26,
	VMI_PathTracing                                                                  = 27,
	VMI_RayTracingDebug                                                              = 28,
	VMI_Max                                                                          = 29,
	VMI_Unknown                                                                      = 255
};

/// Enum /Script/Engine.EDemoPlayFailure
/// Size: 0x01 (1 bytes)
enum class EDemoPlayFailure : uint8_t
{
	EDemoPlayFailure__Generic                                                        = 0,
	EDemoPlayFailure__DemoNotFound                                                   = 1,
	EDemoPlayFailure__Corrupt                                                        = 2,
	EDemoPlayFailure__InvalidVersion                                                 = 3,
	EDemoPlayFailure__InitBase                                                       = 4,
	EDemoPlayFailure__GameSpecificHeader                                             = 5,
	EDemoPlayFailure__ReplayStreamerInternal                                         = 6,
	EDemoPlayFailure__LoadMap                                                        = 7,
	EDemoPlayFailure__Serialization                                                  = 8
};

/// Enum /Script/Engine.ETravelType
/// Size: 0x01 (1 bytes)
enum class ETravelType : uint8_t
{
	TRAVEL_Absolute                                                                  = 0,
	TRAVEL_Partial                                                                   = 1,
	TRAVEL_Relative                                                                  = 2
};

/// Enum /Script/Engine.ENetworkLagState
/// Size: 0x01 (1 bytes)
enum class ENetworkLagState : uint8_t
{
	ENetworkLagState__NotLagging                                                     = 0,
	ENetworkLagState__Lagging                                                        = 1
};

/// Enum /Script/Engine.EMouseCaptureMode
/// Size: 0x01 (1 bytes)
enum class EMouseCaptureMode : uint8_t
{
	EMouseCaptureMode__NoCapture                                                     = 0,
	EMouseCaptureMode__CapturePermanently                                            = 1,
	EMouseCaptureMode__CapturePermanently_IncludingInitialMouseDown                  = 2,
	EMouseCaptureMode__CaptureDuringMouseDown                                        = 3,
	EMouseCaptureMode__CaptureDuringRightMouseDown                                   = 4
};

/// Enum /Script/Engine.ECustomTimeStepSynchronizationState
/// Size: 0x01 (1 bytes)
enum class ECustomTimeStepSynchronizationState : uint8_t
{
	ECustomTimeStepSynchronizationState__Closed                                      = 0,
	ECustomTimeStepSynchronizationState__Error                                       = 1,
	ECustomTimeStepSynchronizationState__Synchronized                                = 2,
	ECustomTimeStepSynchronizationState__Synchronizing                               = 3
};

/// Enum /Script/Engine.EMeshBufferAccess
/// Size: 0x01 (1 bytes)
enum class EMeshBufferAccess : uint8_t
{
	EMeshBufferAccess__Default                                                       = 0,
	EMeshBufferAccess__ForceCPUAndGPU                                                = 1
};

/// Enum /Script/Engine.EComponentSocketType
/// Size: 0x01 (1 bytes)
enum class EComponentSocketType : uint8_t
{
	EComponentSocketType__Invalid                                                    = 0,
	EComponentSocketType__Bone                                                       = 1,
	EComponentSocketType__Socket                                                     = 2
};

/// Enum /Script/Engine.EPhysicalMaterialMaskColor
/// Size: 0x01 (1 bytes)
enum class EPhysicalMaterialMaskColor : uint8_t
{
	EPhysicalMaterialMaskColor__Red                                                  = 0,
	EPhysicalMaterialMaskColor__Green                                                = 1,
	EPhysicalMaterialMaskColor__Blue                                                 = 2,
	EPhysicalMaterialMaskColor__Cyan                                                 = 3,
	EPhysicalMaterialMaskColor__Magenta                                              = 4,
	EPhysicalMaterialMaskColor__Yellow                                               = 5,
	EPhysicalMaterialMaskColor__White                                                = 6,
	EPhysicalMaterialMaskColor__Black                                                = 7
};

/// Enum /Script/Engine.EWalkableSlopeBehavior
/// Size: 0x01 (1 bytes)
enum class EWalkableSlopeBehavior : uint8_t
{
	WalkableSlope_Default                                                            = 0,
	WalkableSlope_Increase                                                           = 1,
	WalkableSlope_Decrease                                                           = 2,
	WalkableSlope_Unwalkable                                                         = 3,
	WalkableSlope_Max                                                                = 4
};

/// Enum /Script/Engine.EAutoPossessAI
/// Size: 0x01 (1 bytes)
enum class EAutoPossessAI : uint8_t
{
	EAutoPossessAI__Disabled                                                         = 0,
	EAutoPossessAI__PlacedInWorld                                                    = 1,
	EAutoPossessAI__Spawned                                                          = 2,
	EAutoPossessAI__PlacedInWorldOrSpawned                                           = 3
};

/// Enum /Script/Engine.EUpdateRateShiftBucket
/// Size: 0x01 (1 bytes)
enum class EUpdateRateShiftBucket : uint8_t
{
	EUpdateRateShiftBucket__ShiftBucket0                                             = 0,
	EUpdateRateShiftBucket__ShiftBucket1                                             = 1,
	EUpdateRateShiftBucket__ShiftBucket2                                             = 2,
	EUpdateRateShiftBucket__ShiftBucket3                                             = 3,
	EUpdateRateShiftBucket__ShiftBucket4                                             = 4,
	EUpdateRateShiftBucket__ShiftBucket5                                             = 5,
	EUpdateRateShiftBucket__ShiftBucketMax                                           = 6
};

/// Enum /Script/Engine.EShadowMapFlags
/// Size: 0x01 (1 bytes)
enum class EShadowMapFlags : uint8_t
{
	SMF_None                                                                         = 0,
	SMF_Streamed                                                                     = 1
};

/// Enum /Script/Engine.ELightMapPaddingType
/// Size: 0x01 (1 bytes)
enum class ELightMapPaddingType : uint8_t
{
	LMPT_NormalPadding                                                               = 0,
	LMPT_PrePadding                                                                  = 1,
	LMPT_NoPadding                                                                   = 2
};

/// Enum /Script/Engine.ECollisionEnabled
/// Size: 0x01 (1 bytes)
enum class ECollisionEnabled : uint8_t
{
	ECollisionEnabled__NoCollision                                                   = 0,
	ECollisionEnabled__QueryOnly                                                     = 1,
	ECollisionEnabled__PhysicsOnly                                                   = 2,
	ECollisionEnabled__QueryAndPhysics                                               = 3
};

/// Enum /Script/Engine.ETimelineSigType
/// Size: 0x01 (1 bytes)
enum class ETimelineSigType : uint8_t
{
	ETS_EventSignature                                                               = 0,
	ETS_FloatSignature                                                               = 1,
	ETS_VectorSignature                                                              = 2,
	ETS_LinearColorSignature                                                         = 3,
	ETS_InvalidSignature                                                             = 4
};

/// Enum /Script/Engine.EFilterInterpolationType
/// Size: 0x01 (1 bytes)
enum class EFilterInterpolationType : uint8_t
{
	BSIT_Average                                                                     = 0,
	BSIT_Linear                                                                      = 1,
	BSIT_Cubic                                                                       = 2
};

/// Enum /Script/Engine.ECollisionResponse
/// Size: 0x01 (1 bytes)
enum class ECollisionResponse : uint8_t
{
	ECR_Ignore                                                                       = 0,
	ECR_Overlap                                                                      = 1,
	ECR_Block                                                                        = 2
};

/// Enum /Script/Engine.EOverlapFilterOption
/// Size: 0x01 (1 bytes)
enum class EOverlapFilterOption : uint8_t
{
	OverlapFilter_All                                                                = 0,
	OverlapFilter_DynamicOnly                                                        = 1,
	OverlapFilter_StaticOnly                                                         = 2
};

/// Enum /Script/Engine.ECollisionChannel
/// Size: 0x01 (1 bytes)
enum class ECollisionChannel : uint8_t
{
	ECC_WorldStatic                                                                  = 0,
	ECC_WorldDynamic                                                                 = 1,
	ECC_Pawn                                                                         = 2,
	ECC_Visibility                                                                   = 3,
	ECC_Camera                                                                       = 4,
	ECC_PhysicsBody                                                                  = 5,
	ECC_Vehicle                                                                      = 6,
	ECC_Destructible                                                                 = 7,
	ECC_EngineTraceChannel1                                                          = 8,
	ECC_EngineTraceChannel2                                                          = 9,
	ECC_EngineTraceChannel3                                                          = 10,
	ECC_EngineTraceChannel4                                                          = 11,
	ECC_EngineTraceChannel5                                                          = 12,
	ECC_EngineTraceChannel6                                                          = 13,
	ECC_GameTraceChannel1                                                            = 14,
	ECC_GameTraceChannel2                                                            = 15,
	ECC_GameTraceChannel3                                                            = 16,
	ECC_GameTraceChannel4                                                            = 17,
	ECC_GameTraceChannel5                                                            = 18,
	ECC_GameTraceChannel6                                                            = 19,
	ECC_GameTraceChannel7                                                            = 20,
	ECC_GameTraceChannel8                                                            = 21,
	ECC_GameTraceChannel9                                                            = 22,
	ECC_GameTraceChannel10                                                           = 23,
	ECC_GameTraceChannel11                                                           = 24,
	ECC_GameTraceChannel12                                                           = 25,
	ECC_GameTraceChannel13                                                           = 26,
	ECC_GameTraceChannel14                                                           = 27,
	ECC_GameTraceChannel15                                                           = 28,
	ECC_GameTraceChannel16                                                           = 29,
	ECC_GameTraceChannel17                                                           = 30,
	ECC_GameTraceChannel18                                                           = 31,
	ECC_OverlapAll_Deprecated                                                        = 32
};

/// Enum /Script/Engine.ENetworkSmoothingMode
/// Size: 0x01 (1 bytes)
enum class ENetworkSmoothingMode : uint8_t
{
	ENetworkSmoothingMode__Disabled                                                  = 0,
	ENetworkSmoothingMode__Linear                                                    = 1,
	ENetworkSmoothingMode__Exponential                                               = 2,
	ENetworkSmoothingMode__Replay                                                    = 3
};

/// Enum /Script/Engine.ELightingBuildQuality
/// Size: 0x01 (1 bytes)
enum class ELightingBuildQuality : uint8_t
{
	Quality_Preview                                                                  = 0,
	Quality_Medium                                                                   = 1,
	Quality_High                                                                     = 2,
	Quality_Production                                                               = 3
};

/// Enum /Script/Engine.EMaterialShadingRate
/// Size: 0x01 (1 bytes)
enum class EMaterialShadingRate : uint8_t
{
	MSR_1x1                                                                          = 0,
	MSR_2x1                                                                          = 1,
	MSR_1x2                                                                          = 2,
	MSR_2x2                                                                          = 3,
	MSR_4x2                                                                          = 4,
	MSR_2x4                                                                          = 5,
	MSR_4x4                                                                          = 6,
	MSR_Count                                                                        = 7
};

/// Enum /Script/Engine.EMaterialStencilCompare
/// Size: 0x01 (1 bytes)
enum class EMaterialStencilCompare : uint8_t
{
	MSC_Less                                                                         = 0,
	MSC_LessEqual                                                                    = 1,
	MSC_Greater                                                                      = 2,
	MSC_GreaterEqual                                                                 = 3,
	MSC_Equal                                                                        = 4,
	MSC_NotEqual                                                                     = 5,
	MSC_Never                                                                        = 6,
	MSC_Always                                                                       = 7,
	MSC_Count                                                                        = 8
};

/// Enum /Script/Engine.EMaterialSamplerType
/// Size: 0x01 (1 bytes)
enum class EMaterialSamplerType : uint8_t
{
	SAMPLERTYPE_Color                                                                = 0,
	SAMPLERTYPE_Grayscale                                                            = 1,
	SAMPLERTYPE_Alpha                                                                = 2,
	SAMPLERTYPE_Normal                                                               = 3,
	SAMPLERTYPE_Masks                                                                = 4,
	SAMPLERTYPE_DistanceFieldFont                                                    = 5,
	SAMPLERTYPE_LinearColor                                                          = 6,
	SAMPLERTYPE_LinearGrayscale                                                      = 7,
	SAMPLERTYPE_Data                                                                 = 8,
	SAMPLERTYPE_External                                                             = 9,
	SAMPLERTYPE_VirtualColor                                                         = 10,
	SAMPLERTYPE_VirtualGrayscale                                                     = 11,
	SAMPLERTYPE_VirtualAlpha                                                         = 12,
	SAMPLERTYPE_VirtualNormal                                                        = 13,
	SAMPLERTYPE_VirtualMasks                                                         = 14,
	SAMPLERTYPE_VirtualLinearColor                                                   = 15,
	SAMPLERTYPE_VirtualLinearGrayscale                                               = 16
};

/// Enum /Script/Engine.EMaterialTessellationMode
/// Size: 0x01 (1 bytes)
enum class EMaterialTessellationMode : uint8_t
{
	MTM_NoTessellation                                                               = 0,
	MTM_FlatTessellation                                                             = 1,
	MTM_PNTriangles                                                                  = 2
};

/// Enum /Script/Engine.EMaterialShadingModel
/// Size: 0x01 (1 bytes)
enum class EMaterialShadingModel : uint8_t
{
	MSM_Unlit                                                                        = 0,
	MSM_DefaultLit                                                                   = 1,
	MSM_Subsurface                                                                   = 2,
	MSM_PreintegratedSkin                                                            = 3,
	MSM_ClearCoat                                                                    = 4,
	MSM_SubsurfaceProfile                                                            = 5,
	MSM_TwoSidedFoliage                                                              = 6,
	MSM_Hair                                                                         = 7,
	MSM_Cloth                                                                        = 8,
	MSM_Eye                                                                          = 9,
	MSM_SingleLayerWater                                                             = 10,
	MSM_ThinTranslucent                                                              = 11,
	MSM_NUM                                                                          = 12,
	MSM_FromMaterialExpression                                                       = 13
};

/// Enum /Script/Engine.EParticleCollisionMode
/// Size: 0x01 (1 bytes)
enum class EParticleCollisionMode : uint8_t
{
	EParticleCollisionMode__SceneDepth                                               = 0,
	EParticleCollisionMode__DistanceField                                            = 1
};

/// Enum /Script/Engine.ETrailWidthMode
/// Size: 0x01 (1 bytes)
enum class ETrailWidthMode : uint8_t
{
	ETrailWidthMode_FromCentre                                                       = 0,
	ETrailWidthMode_FromFirst                                                        = 1,
	ETrailWidthMode_FromSecond                                                       = 2
};

/// Enum /Script/Engine.EGBufferFormat
/// Size: 0x01 (1 bytes)
enum class EGBufferFormat : uint8_t
{
	EGBufferFormat__Force8BitsPerChannel                                             = 0,
	EGBufferFormat__Default                                                          = 1,
	EGBufferFormat__HighPrecisionNormals                                             = 3,
	EGBufferFormat__Force16BitsPerChannel                                            = 5
};

/// Enum /Script/Engine.ESceneCaptureCompositeMode
/// Size: 0x01 (1 bytes)
enum class ESceneCaptureCompositeMode : uint8_t
{
	SCCM_Overwrite                                                                   = 0,
	SCCM_Additive                                                                    = 1,
	SCCM_Composite                                                                   = 2
};

/// Enum /Script/Engine.ESceneCaptureSource
/// Size: 0x01 (1 bytes)
enum class ESceneCaptureSource : uint8_t
{
	SCS_SceneColorHDR                                                                = 0,
	SCS_SceneColorHDRNoAlpha                                                         = 1,
	SCS_FinalColorLDR                                                                = 2,
	SCS_SceneColorSceneDepth                                                         = 3,
	SCS_SceneDepth                                                                   = 4,
	SCS_DeviceDepth                                                                  = 5,
	SCS_Normal                                                                       = 6,
	SCS_BaseColor                                                                    = 7,
	SCS_FinalColorHDR                                                                = 8,
	SCS_FinalToneCurveHDR                                                            = 9
};

/// Enum /Script/Engine.ETranslucentSortPolicy
/// Size: 0x01 (1 bytes)
enum class ETranslucentSortPolicy : uint8_t
{
	ETranslucentSortPolicy__SortByDistance                                           = 0,
	ETranslucentSortPolicy__SortByProjectedZ                                         = 1,
	ETranslucentSortPolicy__SortAlongAxis                                            = 2
};

/// Enum /Script/Engine.ERefractionMode
/// Size: 0x01 (1 bytes)
enum class ERefractionMode : uint8_t
{
	RM_IndexOfRefraction                                                             = 0,
	RM_PixelNormalOffset                                                             = 1
};

/// Enum /Script/Engine.ETranslucencyLightingMode
/// Size: 0x01 (1 bytes)
enum class ETranslucencyLightingMode : uint8_t
{
	TLM_VolumetricNonDirectional                                                     = 0,
	TLM_VolumetricDirectional                                                        = 1,
	TLM_VolumetricPerVertexNonDirectional                                            = 2,
	TLM_VolumetricPerVertexDirectional                                               = 3,
	TLM_Surface                                                                      = 4,
	TLM_SurfacePerPixelLighting                                                      = 5
};

/// Enum /Script/Engine.ESamplerSourceMode
/// Size: 0x01 (1 bytes)
enum class ESamplerSourceMode : uint8_t
{
	SSM_FromTextureAsset                                                             = 0,
	SSM_Wrap_WorldGroupSettings                                                      = 1,
	SSM_Clamp_WorldGroupSettings                                                     = 2
};

/// Enum /Script/Engine.EMobileMaterialType
/// Size: 0x01 (1 bytes)
enum class EMobileMaterialType : uint8_t
{
	MMT_Default                                                                      = 0,
	MMT_PBR                                                                          = 1,
	MMT_Metal                                                                        = 2,
	MMT_Skin                                                                         = 3,
	MMT_Face                                                                         = 4,
	MMT_Hair                                                                         = 5,
	MMT_Eye                                                                          = 6,
	MMT_Cel                                                                          = 7,
	MMT_Sheen                                                                        = 8,
	MMT_Fabric                                                                       = 9,
	MMT_Foliage                                                                      = 10,
	MMT_Particle                                                                     = 11,
	MMT_Water                                                                        = 12,
	MMT_PlaceHold0                                                                   = 13,
	MMT_PlaceHold1                                                                   = 14,
	MMT_PlaceHold2                                                                   = 15,
	MMT_PlaceHold3                                                                   = 16,
	MMT_PlaceHold4                                                                   = 17,
	MMT_PlaceHold5                                                                   = 18,
	MMT_Outline                                                                      = 19,
	MMT_DualNormal                                                                   = 20,
	MMT_Billboard                                                                    = 21
};

/// Enum /Script/Engine.EBlendMode
/// Size: 0x01 (1 bytes)
enum class EBlendMode : uint8_t
{
	BLEND_Opaque                                                                     = 0,
	BLEND_Masked                                                                     = 1,
	BLEND_Translucent                                                                = 2,
	BLEND_Additive                                                                   = 3,
	BLEND_Modulate                                                                   = 4,
	BLEND_AlphaComposite                                                             = 5,
	BLEND_AlphaHoldout                                                               = 6
};

/// Enum /Script/Engine.EOcclusionCombineMode
/// Size: 0x01 (1 bytes)
enum class EOcclusionCombineMode : uint8_t
{
	OCM_Minimum                                                                      = 0,
	OCM_Multiply                                                                     = 1
};

/// Enum /Script/Engine.ELightmapType
/// Size: 0x01 (1 bytes)
enum class ELightmapType : uint8_t
{
	ELightmapType__Default                                                           = 0,
	ELightmapType__ForceSurface                                                      = 1,
	ELightmapType__ForceVolumetric                                                   = 2
};

/// Enum /Script/Engine.EIndirectLightingCacheQuality
/// Size: 0x01 (1 bytes)
enum class EIndirectLightingCacheQuality : uint8_t
{
	ILCQ_Off                                                                         = 0,
	ILCQ_Point                                                                       = 1,
	ILCQ_Volume                                                                      = 2
};

/// Enum /Script/Engine.ESceneDepthPriorityGroup
/// Size: 0x01 (1 bytes)
enum class ESceneDepthPriorityGroup : uint8_t
{
	SDPG_World                                                                       = 0,
	SDPG_Foreground                                                                  = 1
};

/// Enum /Script/Engine.EAspectRatioAxisConstraint
/// Size: 0x01 (1 bytes)
enum class EAspectRatioAxisConstraint : uint8_t
{
	AspectRatio_MaintainYFOV                                                         = 0,
	AspectRatio_MaintainXFOV                                                         = 1,
	AspectRatio_MajorAxisFOV                                                         = 2
};

/// Enum /Script/Engine.EFontCacheType
/// Size: 0x01 (1 bytes)
enum class EFontCacheType : uint8_t
{
	EFontCacheType__Offline                                                          = 0,
	EFontCacheType__Runtime                                                          = 1
};

/// Enum /Script/Engine.EFontImportCharacterSet
/// Size: 0x01 (1 bytes)
enum class EFontImportCharacterSet : uint8_t
{
	FontICS_Default                                                                  = 0,
	FontICS_Ansi                                                                     = 1,
	FontICS_Symbol                                                                   = 2
};

/// Enum /Script/Engine.EStandbyType
/// Size: 0x01 (1 bytes)
enum class EStandbyType : uint8_t
{
	STDBY_Rx                                                                         = 0,
	STDBY_Tx                                                                         = 1,
	STDBY_BadPing                                                                    = 2
};

/// Enum /Script/Engine.ESuggestProjVelocityTraceOption
/// Size: 0x01 (1 bytes)
enum class ESuggestProjVelocityTraceOption : uint8_t
{
	ESuggestProjVelocityTraceOption__DoNotTrace                                      = 0,
	ESuggestProjVelocityTraceOption__TraceFullPath                                   = 1,
	ESuggestProjVelocityTraceOption__OnlyTraceWhileAscending                         = 2
};

/// Enum /Script/Engine.EWindowMode
/// Size: 0x01 (1 bytes)
enum class EWindowMode : uint8_t
{
	EWindowMode__Fullscreen                                                          = 0,
	EWindowMode__WindowedFullscreen                                                  = 1,
	EWindowMode__Windowed                                                            = 2
};

/// Enum /Script/Engine.EHitProxyPriority
/// Size: 0x01 (1 bytes)
enum class EHitProxyPriority : uint8_t
{
	HPP_World                                                                        = 0,
	HPP_Wireframe                                                                    = 1,
	HPP_Foreground                                                                   = 2,
	HPP_UI                                                                           = 3
};

/// Enum /Script/Engine.EImportanceWeight
/// Size: 0x01 (1 bytes)
enum class EImportanceWeight : uint8_t
{
	EImportanceWeight__Luminance                                                     = 0,
	EImportanceWeight__Red                                                           = 1,
	EImportanceWeight__Green                                                         = 2,
	EImportanceWeight__Blue                                                          = 3,
	EImportanceWeight__Alpha                                                         = 4
};

/// Enum /Script/Engine.EAdManagerDelegate
/// Size: 0x01 (1 bytes)
enum class EAdManagerDelegate : uint8_t
{
	AMD_ClickedBanner                                                                = 0,
	AMD_UserClosedAd                                                                 = 1
};

/// Enum /Script/Engine.EControllerAnalogStick
/// Size: 0x01 (1 bytes)
enum class EControllerAnalogStick : uint8_t
{
	EControllerAnalogStick__CAS_LeftStick                                            = 0,
	EControllerAnalogStick__CAS_RightStick                                           = 1
};

/// Enum /Script/Engine.EAnimAlphaInputType
/// Size: 0x01 (1 bytes)
enum class EAnimAlphaInputType : uint8_t
{
	EAnimAlphaInputType__Float                                                       = 0,
	EAnimAlphaInputType__Bool                                                        = 1,
	EAnimAlphaInputType__Curve                                                       = 2
};

/// Enum /Script/Engine.ETrackActiveCondition
/// Size: 0x01 (1 bytes)
enum class ETrackActiveCondition : uint8_t
{
	ETAC_Always                                                                      = 0,
	ETAC_GoreEnabled                                                                 = 1,
	ETAC_GoreDisabled                                                                = 2
};

/// Enum /Script/Engine.EInterpTrackMoveRotMode
/// Size: 0x01 (1 bytes)
enum class EInterpTrackMoveRotMode : uint8_t
{
	IMR_Keyframed                                                                    = 0,
	IMR_LookAtGroup                                                                  = 1,
	IMR_Ignore                                                                       = 2
};

/// Enum /Script/Engine.EInterpMoveAxis
/// Size: 0x01 (1 bytes)
enum class EInterpMoveAxis : uint8_t
{
	AXIS_TranslationX                                                                = 0,
	AXIS_TranslationY                                                                = 1,
	AXIS_TranslationZ                                                                = 2,
	AXIS_RotationX                                                                   = 3,
	AXIS_RotationY                                                                   = 4,
	AXIS_RotationZ                                                                   = 5
};

/// Enum /Script/Engine.ETrackToggleAction
/// Size: 0x01 (1 bytes)
enum class ETrackToggleAction : uint8_t
{
	ETTA_Off                                                                         = 0,
	ETTA_On                                                                          = 1,
	ETTA_Toggle                                                                      = 2,
	ETTA_Trigger                                                                     = 3
};

/// Enum /Script/Engine.EVisibilityTrackCondition
/// Size: 0x01 (1 bytes)
enum class EVisibilityTrackCondition : uint8_t
{
	EVTC_Always                                                                      = 0,
	EVTC_GoreEnabled                                                                 = 1,
	EVTC_GoreDisabled                                                                = 2
};

/// Enum /Script/Engine.EVisibilityTrackAction
/// Size: 0x01 (1 bytes)
enum class EVisibilityTrackAction : uint8_t
{
	EVTA_Hide                                                                        = 0,
	EVTA_Show                                                                        = 1,
	EVTA_Toggle                                                                      = 2
};

/// Enum /Script/Engine.ESlateGesture
/// Size: 0x01 (1 bytes)
enum class ESlateGesture : uint8_t
{
	ESlateGesture__None                                                              = 0,
	ESlateGesture__Scroll                                                            = 1,
	ESlateGesture__Magnify                                                           = 2,
	ESlateGesture__Swipe                                                             = 3,
	ESlateGesture__Rotate                                                            = 4,
	ESlateGesture__LongPress                                                         = 5
};

/// Enum /Script/Engine.EMIDCreationFlags
/// Size: 0x01 (1 bytes)
enum class EMIDCreationFlags : uint8_t
{
	EMIDCreationFlags__None                                                          = 0,
	EMIDCreationFlags__Transient                                                     = 1
};

/// Enum /Script/Engine.EMatrixColumns
/// Size: 0x01 (1 bytes)
enum class EMatrixColumns : uint8_t
{
	EMatrixColumns__First                                                            = 0,
	EMatrixColumns__Second                                                           = 1,
	EMatrixColumns__Third                                                            = 2,
	EMatrixColumns__Fourth                                                           = 3
};

/// Enum /Script/Engine.ELerpInterpolationMode
/// Size: 0x01 (1 bytes)
enum class ELerpInterpolationMode : uint8_t
{
	ELerpInterpolationMode__QuatInterp                                               = 0,
	ELerpInterpolationMode__EulerInterp                                              = 1,
	ELerpInterpolationMode__DualQuatInterp                                           = 2
};

/// Enum /Script/Engine.EEasingFunc
/// Size: 0x01 (1 bytes)
enum class EEasingFunc : uint8_t
{
	EEasingFunc__Linear                                                              = 0,
	EEasingFunc__Step                                                                = 1,
	EEasingFunc__SinusoidalIn                                                        = 2,
	EEasingFunc__SinusoidalOut                                                       = 3,
	EEasingFunc__SinusoidalInOut                                                     = 4,
	EEasingFunc__EaseIn                                                              = 5,
	EEasingFunc__EaseOut                                                             = 6,
	EEasingFunc__EaseInOut                                                           = 7,
	EEasingFunc__ExpoIn                                                              = 8,
	EEasingFunc__ExpoOut                                                             = 9,
	EEasingFunc__ExpoInOut                                                           = 10,
	EEasingFunc__CircularIn                                                          = 11,
	EEasingFunc__CircularOut                                                         = 12,
	EEasingFunc__CircularInOut                                                       = 13
};

/// Enum /Script/Engine.ERoundingMode
/// Size: 0x01 (1 bytes)
enum class ERoundingMode : uint8_t
{
	HalfToEven                                                                       = 0,
	HalfFromZero                                                                     = 1,
	HalfToZero                                                                       = 2,
	FromZero                                                                         = 3,
	ToZero                                                                           = 4,
	ToNegativeInfinity                                                               = 5,
	ToPositiveInfinity                                                               = 6
};

/// Enum /Script/Engine.EStreamingVolumeUsage
/// Size: 0x01 (1 bytes)
enum class EStreamingVolumeUsage : uint8_t
{
	SVB_Loading                                                                      = 0,
	SVB_LoadingAndVisibility                                                         = 1,
	SVB_VisibilityBlockingOnLoad                                                     = 2,
	SVB_BlockingOnLoad                                                               = 3,
	SVB_LoadingNotVisible                                                            = 4
};

/// Enum /Script/Engine.ESyncOption
/// Size: 0x01 (1 bytes)
enum class ESyncOption : uint8_t
{
	ESyncOption__Drive                                                               = 0,
	ESyncOption__Passive                                                             = 1,
	ESyncOption__Disabled                                                            = 2
};

/// Enum /Script/Engine.EMaterialDecalResponse
/// Size: 0x01 (1 bytes)
enum class EMaterialDecalResponse : uint8_t
{
	MDR_None                                                                         = 0,
	MDR_ColorNormalRoughness                                                         = 1,
	MDR_Color                                                                        = 2,
	MDR_ColorNormal                                                                  = 3,
	MDR_ColorRoughness                                                               = 4,
	MDR_Normal                                                                       = 5,
	MDR_NormalRoughness                                                              = 6,
	MDR_Roughness                                                                    = 7
};

/// Enum /Script/Engine.EDecalBlendMode
/// Size: 0x01 (1 bytes)
enum class EDecalBlendMode : uint8_t
{
	DBM_Translucent                                                                  = 0,
	DBM_Stain                                                                        = 1,
	DBM_Normal                                                                       = 2,
	DBM_Emissive                                                                     = 3,
	DBM_DBuffer_ColorNormalRoughness                                                 = 4,
	DBM_DBuffer_Color                                                                = 5,
	DBM_DBuffer_ColorNormal                                                          = 6,
	DBM_DBuffer_ColorRoughness                                                       = 7,
	DBM_DBuffer_Normal                                                               = 8,
	DBM_DBuffer_NormalRoughness                                                      = 9,
	DBM_DBuffer_Roughness                                                            = 10,
	DBM_DBuffer_Emissive                                                             = 11,
	DBM_DBuffer_AlphaComposite                                                       = 12,
	DBM_DBuffer_EmissiveAlphaComposite                                               = 13,
	DBM_Volumetric_DistanceFunction                                                  = 14,
	DBM_AlphaComposite                                                               = 15,
	DBM_AmbientOcclusion                                                             = 16
};

/// Enum /Script/Engine.ETextureColorChannel
/// Size: 0x01 (1 bytes)
enum class ETextureColorChannel : uint8_t
{
	TCC_Red                                                                          = 0,
	TCC_Green                                                                        = 1,
	TCC_Blue                                                                         = 2,
	TCC_Alpha                                                                        = 3
};

/// Enum /Script/Engine.EMaterialAttributeBlend
/// Size: 0x01 (1 bytes)
enum class EMaterialAttributeBlend : uint8_t
{
	EMaterialAttributeBlend__Blend                                                   = 0,
	EMaterialAttributeBlend__UseA                                                    = 1,
	EMaterialAttributeBlend__UseB                                                    = 2
};

/// Enum /Script/Engine.EChannelMaskParameterColor
/// Size: 0x01 (1 bytes)
enum class EChannelMaskParameterColor : uint8_t
{
	EChannelMaskParameterColor__Red                                                  = 0,
	EChannelMaskParameterColor__Green                                                = 1,
	EChannelMaskParameterColor__Blue                                                 = 2,
	EChannelMaskParameterColor__Alpha                                                = 3
};

/// Enum /Script/Engine.EClampMode
/// Size: 0x01 (1 bytes)
enum class EClampMode : uint8_t
{
	CMODE_Clamp                                                                      = 0,
	CMODE_ClampMin                                                                   = 1,
	CMODE_ClampMax                                                                   = 2
};

/// Enum /Script/Engine.ECustomMaterialOutputType
/// Size: 0x01 (1 bytes)
enum class ECustomMaterialOutputType : uint8_t
{
	CMOT_Float1                                                                      = 0,
	CMOT_Float2                                                                      = 1,
	CMOT_Float3                                                                      = 2,
	CMOT_Float4                                                                      = 3,
	CMOT_MaterialAttributes                                                          = 4
};

/// Enum /Script/Engine.EDepthOfFieldFunctionValue
/// Size: 0x01 (1 bytes)
enum class EDepthOfFieldFunctionValue : uint8_t
{
	TDOF_NearAndFarMask                                                              = 0,
	TDOF_NearMask                                                                    = 1,
	TDOF_FarMask                                                                     = 2,
	TDOF_CircleOfConfusionRadius                                                     = 3
};

/// Enum /Script/Engine.EFunctionInputType
/// Size: 0x01 (1 bytes)
enum class EFunctionInputType : uint8_t
{
	FunctionInput_Scalar                                                             = 0,
	FunctionInput_Vector2                                                            = 1,
	FunctionInput_Vector3                                                            = 2,
	FunctionInput_Vector4                                                            = 3,
	FunctionInput_Texture2D                                                          = 4,
	FunctionInput_TextureCube                                                        = 5,
	FunctionInput_Texture2DArray                                                     = 6,
	FunctionInput_VolumeTexture                                                      = 7,
	FunctionInput_StaticBool                                                         = 8,
	FunctionInput_MaterialAttributes                                                 = 9,
	FunctionInput_TextureExternal                                                    = 10
};

/// Enum /Script/Engine.ENoiseFunction
/// Size: 0x01 (1 bytes)
enum class ENoiseFunction : uint8_t
{
	NOISEFUNCTION_SimplexTex                                                         = 0,
	NOISEFUNCTION_GradientTex                                                        = 1,
	NOISEFUNCTION_GradientTex3D                                                      = 2,
	NOISEFUNCTION_GradientALU                                                        = 3,
	NOISEFUNCTION_ValueALU                                                           = 4,
	NOISEFUNCTION_VoronoiALU                                                         = 5
};

/// Enum /Script/Engine.ERuntimeVirtualTextureTextureAddressMode
/// Size: 0x01 (1 bytes)
enum class ERuntimeVirtualTextureTextureAddressMode : uint8_t
{
	RVTTA_Clamp                                                                      = 0,
	RVTTA_Wrap                                                                       = 1
};

/// Enum /Script/Engine.ERuntimeVirtualTextureMipValueMode
/// Size: 0x01 (1 bytes)
enum class ERuntimeVirtualTextureMipValueMode : uint8_t
{
	RVTMVM_None                                                                      = 0,
	RVTMVM_MipLevel                                                                  = 1,
	RVTMVM_MipBias                                                                   = 2
};

/// Enum /Script/Engine.EMaterialSceneAttributeInputMode
/// Size: 0x01 (1 bytes)
enum class EMaterialSceneAttributeInputMode : uint8_t
{
	EMaterialSceneAttributeInputMode__Coordinates                                    = 0,
	EMaterialSceneAttributeInputMode__OffsetFraction                                 = 1
};

/// Enum /Script/Engine.ESpeedTreeLODType
/// Size: 0x01 (1 bytes)
enum class ESpeedTreeLODType : uint8_t
{
	STLOD_Pop                                                                        = 0,
	STLOD_Smooth                                                                     = 1
};

/// Enum /Script/Engine.ESpeedTreeWindType
/// Size: 0x01 (1 bytes)
enum class ESpeedTreeWindType : uint8_t
{
	STW_None                                                                         = 0,
	STW_Fastest                                                                      = 1,
	STW_Fast                                                                         = 2,
	STW_Better                                                                       = 3,
	STW_Best                                                                         = 4,
	STW_Palm                                                                         = 5,
	STW_BestPlus                                                                     = 6
};

/// Enum /Script/Engine.ESpeedTreeGeometryType
/// Size: 0x01 (1 bytes)
enum class ESpeedTreeGeometryType : uint8_t
{
	STG_Branch                                                                       = 0,
	STG_Frond                                                                        = 1,
	STG_Leaf                                                                         = 2,
	STG_FacingLeaf                                                                   = 3,
	STG_Billboard                                                                    = 4
};

/// Enum /Script/Engine.EMaterialExposedTextureProperty
/// Size: 0x01 (1 bytes)
enum class EMaterialExposedTextureProperty : uint8_t
{
	TMTM_TextureSize                                                                 = 0,
	TMTM_TexelSize                                                                   = 1
};

/// Enum /Script/Engine.ETextureMipValueMode
/// Size: 0x01 (1 bytes)
enum class ETextureMipValueMode : uint8_t
{
	TMVM_None                                                                        = 0,
	TMVM_MipLevel                                                                    = 1,
	TMVM_MipBias                                                                     = 2,
	TMVM_Derivative                                                                  = 3
};

/// Enum /Script/Engine.EMaterialVectorCoordTransform
/// Size: 0x01 (1 bytes)
enum class EMaterialVectorCoordTransform : uint8_t
{
	TRANSFORM_Tangent                                                                = 0,
	TRANSFORM_Local                                                                  = 1,
	TRANSFORM_World                                                                  = 2,
	TRANSFORM_View                                                                   = 3,
	TRANSFORM_Camera                                                                 = 4,
	TRANSFORM_ParticleWorld                                                          = 5
};

/// Enum /Script/Engine.EMaterialVectorCoordTransformSource
/// Size: 0x01 (1 bytes)
enum class EMaterialVectorCoordTransformSource : uint8_t
{
	TRANSFORMSOURCE_Tangent                                                          = 0,
	TRANSFORMSOURCE_Local                                                            = 1,
	TRANSFORMSOURCE_World                                                            = 2,
	TRANSFORMSOURCE_View                                                             = 3,
	TRANSFORMSOURCE_Camera                                                           = 4,
	TRANSFORMSOURCE_ParticleWorld                                                    = 5
};

/// Enum /Script/Engine.EMaterialPositionTransformSource
/// Size: 0x01 (1 bytes)
enum class EMaterialPositionTransformSource : uint8_t
{
	TRANSFORMPOSSOURCE_Local                                                         = 0,
	TRANSFORMPOSSOURCE_World                                                         = 1,
	TRANSFORMPOSSOURCE_TranslatedWorld                                               = 2,
	TRANSFORMPOSSOURCE_View                                                          = 3,
	TRANSFORMPOSSOURCE_Camera                                                        = 4,
	TRANSFORMPOSSOURCE_Particle                                                      = 5
};

/// Enum /Script/Engine.EVectorNoiseFunction
/// Size: 0x01 (1 bytes)
enum class EVectorNoiseFunction : uint8_t
{
	VNF_CellnoiseALU                                                                 = 0,
	VNF_VectorALU                                                                    = 1,
	VNF_GradientALU                                                                  = 2,
	VNF_CurlALU                                                                      = 3,
	VNF_VoronoiALU                                                                   = 4
};

/// Enum /Script/Engine.EMaterialExposedViewProperty
/// Size: 0x01 (1 bytes)
enum class EMaterialExposedViewProperty : uint8_t
{
	MEVP_BufferSize                                                                  = 0,
	MEVP_FieldOfView                                                                 = 1,
	MEVP_TanHalfFieldOfView                                                          = 2,
	MEVP_ViewSize                                                                    = 3,
	MEVP_WorldSpaceViewPosition                                                      = 4,
	MEVP_WorldSpaceCameraPosition                                                    = 5,
	MEVP_ViewportOffset                                                              = 6,
	MEVP_TemporalSampleCount                                                         = 7,
	MEVP_TemporalSampleIndex                                                         = 8,
	MEVP_TemporalSampleOffset                                                        = 9,
	MEVP_RuntimeVirtualTextureOutputLevel                                            = 10,
	MEVP_RuntimeVirtualTextureOutputDerivative                                       = 11,
	MEVP_PreExposure                                                                 = 12,
	MEVP_RuntimeVirtualTextureMaxLevel                                               = 13
};

/// Enum /Script/Engine.EWorldPositionIncludedOffsets
/// Size: 0x01 (1 bytes)
enum class EWorldPositionIncludedOffsets : uint8_t
{
	WPT_Default                                                                      = 0,
	WPT_ExcludeAllShaderOffsets                                                      = 1,
	WPT_CameraRelative                                                               = 2,
	WPT_CameraRelativeNoOffsets                                                      = 3
};

/// Enum /Script/Engine.EMaterialFunctionUsage
/// Size: 0x01 (1 bytes)
enum class EMaterialFunctionUsage : uint8_t
{
	EMaterialFunctionUsage__Default                                                  = 0,
	EMaterialFunctionUsage__MaterialLayer                                            = 1,
	EMaterialFunctionUsage__MaterialLayerBlend                                       = 2
};

/// Enum /Script/Engine.EMaterialUsage
/// Size: 0x01 (1 bytes)
enum class EMaterialUsage : uint8_t
{
	MATUSAGE_SkeletalMesh                                                            = 0,
	MATUSAGE_ParticleSprites                                                         = 1,
	MATUSAGE_BeamTrails                                                              = 2,
	MATUSAGE_MeshParticles                                                           = 3,
	MATUSAGE_StaticLighting                                                          = 4,
	MATUSAGE_MorphTargets                                                            = 5,
	MATUSAGE_SplineMesh                                                              = 6,
	MATUSAGE_InstancedStaticMeshes                                                   = 7,
	MATUSAGE_GeometryCollections                                                     = 8,
	MATUSAGE_Clothing                                                                = 9,
	MATUSAGE_NiagaraSprites                                                          = 10,
	MATUSAGE_NiagaraRibbons                                                          = 11,
	MATUSAGE_NiagaraMeshParticles                                                    = 12,
	MATUSAGE_GeometryCache                                                           = 13,
	MATUSAGE_Water                                                                   = 14,
	MATUSAGE_HairStrands                                                             = 15,
	MATUSAGE_LidarPointCloud                                                         = 16,
	MATUSAGE_VirtualHeightfieldMesh                                                  = 17
};

/// Enum /Script/Engine.EMaterialLayerLinkState
/// Size: 0x01 (1 bytes)
enum class EMaterialLayerLinkState : uint8_t
{
	EMaterialLayerLinkState__Uninitialized                                           = 0,
	EMaterialLayerLinkState__LinkedToParent                                          = 1,
	EMaterialLayerLinkState__UnlinkedFromParent                                      = 2,
	EMaterialLayerLinkState__NotFromParent                                           = 3
};

/// Enum /Script/Engine.EMaterialParameterAssociation
/// Size: 0x01 (1 bytes)
enum class EMaterialParameterAssociation : uint8_t
{
	LayerParameter                                                                   = 0,
	BlendParameter                                                                   = 1,
	GlobalParameter                                                                  = 2
};

/// Enum /Script/Engine.EMaterialMergeType
/// Size: 0x01 (1 bytes)
enum class EMaterialMergeType : uint8_t
{
	MaterialMergeType_Default                                                        = 0,
	MaterialMergeType_Simplygon                                                      = 1
};

/// Enum /Script/Engine.ETextureSizingType
/// Size: 0x01 (1 bytes)
enum class ETextureSizingType : uint8_t
{
	TextureSizingType_UseSingleTextureSize                                           = 0,
	TextureSizingType_UseAutomaticBiasedSizes                                        = 1,
	TextureSizingType_UseManualOverrideTextureSize                                   = 2,
	TextureSizingType_UseSimplygonAutomaticSizing                                    = 3
};

/// Enum /Script/Engine.ESceneTextureId
/// Size: 0x01 (1 bytes)
enum class ESceneTextureId : uint8_t
{
	PPI_SceneColor                                                                   = 0,
	PPI_SceneDepth                                                                   = 1,
	PPI_DiffuseColor                                                                 = 2,
	PPI_SpecularColor                                                                = 3,
	PPI_SubsurfaceColor                                                              = 4,
	PPI_BaseColor                                                                    = 5,
	PPI_Specular                                                                     = 6,
	PPI_Metallic                                                                     = 7,
	PPI_WorldNormal                                                                  = 8,
	PPI_SeparateTranslucency                                                         = 9,
	PPI_Opacity                                                                      = 10,
	PPI_Roughness                                                                    = 11,
	PPI_MaterialAO                                                                   = 12,
	PPI_CustomDepth                                                                  = 13,
	PPI_PostProcessInput0                                                            = 14,
	PPI_PostProcessInput1                                                            = 15,
	PPI_PostProcessInput2                                                            = 16,
	PPI_PostProcessInput3                                                            = 17,
	PPI_PostProcessInput4                                                            = 18,
	PPI_PostProcessInput5                                                            = 19,
	PPI_PostProcessInput6                                                            = 20,
	PPI_DecalMask                                                                    = 21,
	PPI_ShadingModelColor                                                            = 22,
	PPI_ShadingModelID                                                               = 23,
	PPI_AmbientOcclusion                                                             = 24,
	PPI_CustomStencil                                                                = 25,
	PPI_StoredBaseColor                                                              = 26,
	PPI_StoredSpecular                                                               = 27,
	PPI_Velocity                                                                     = 28,
	PPI_WorldTangent                                                                 = 29,
	PPI_Anisotropy                                                                   = 30
};

/// Enum /Script/Engine.EMaterialDomain
/// Size: 0x01 (1 bytes)
enum class EMaterialDomain : uint8_t
{
	MD_Surface                                                                       = 0,
	MD_DeferredDecal                                                                 = 1,
	MD_LightFunction                                                                 = 2,
	MD_Volume                                                                        = 3,
	MD_PostProcess                                                                   = 4,
	MD_UI                                                                            = 5,
	MD_RuntimeVirtualTexture                                                         = 6
};

/// Enum /Script/Engine.EMeshInstancingReplacementMethod
/// Size: 0x01 (1 bytes)
enum class EMeshInstancingReplacementMethod : uint8_t
{
	EMeshInstancingReplacementMethod__RemoveOriginalActors                           = 0,
	EMeshInstancingReplacementMethod__KeepOriginalActorsAsEditorOnly                 = 1
};

/// Enum /Script/Engine.EUVOutput
/// Size: 0x01 (1 bytes)
enum class EUVOutput : uint8_t
{
	EUVOutput__DoNotOutputChannel                                                    = 0,
	EUVOutput__OutputChannel                                                         = 1
};

/// Enum /Script/Engine.EMeshMergeType
/// Size: 0x01 (1 bytes)
enum class EMeshMergeType : uint8_t
{
	EMeshMergeType__MeshMergeType_Default                                            = 0,
	EMeshMergeType__MeshMergeType_MergeActor                                         = 1
};

/// Enum /Script/Engine.EMeshLODSelectionType
/// Size: 0x01 (1 bytes)
enum class EMeshLODSelectionType : uint8_t
{
	EMeshLODSelectionType__AllLODs                                                   = 0,
	EMeshLODSelectionType__SpecificLOD                                               = 1,
	EMeshLODSelectionType__CalculateLOD                                              = 2,
	EMeshLODSelectionType__LowestDetailLOD                                           = 3
};

/// Enum /Script/Engine.EProxyNormalComputationMethod
/// Size: 0x01 (1 bytes)
enum class EProxyNormalComputationMethod : uint8_t
{
	EProxyNormalComputationMethod__AngleWeighted                                     = 0,
	EProxyNormalComputationMethod__AreaWeighted                                      = 1,
	EProxyNormalComputationMethod__EqualWeighted                                     = 2
};

/// Enum /Script/Engine.ELandscapeCullingPrecision
/// Size: 0x01 (1 bytes)
enum class ELandscapeCullingPrecision : uint8_t
{
	ELandscapeCullingPrecision__High                                                 = 0,
	ELandscapeCullingPrecision__Medium                                               = 1,
	ELandscapeCullingPrecision__Low                                                  = 2
};

/// Enum /Script/Engine.EStaticMeshReductionTerimationCriterion
/// Size: 0x01 (1 bytes)
enum class EStaticMeshReductionTerimationCriterion : uint8_t
{
	EStaticMeshReductionTerimationCriterion__Triangles                               = 0,
	EStaticMeshReductionTerimationCriterion__Vertices                                = 1,
	EStaticMeshReductionTerimationCriterion__Any                                     = 2
};

/// Enum /Script/Engine.EMeshFeatureImportance
/// Size: 0x01 (1 bytes)
enum class EMeshFeatureImportance : uint8_t
{
	EMeshFeatureImportance__Off                                                      = 0,
	EMeshFeatureImportance__Lowest                                                   = 1,
	EMeshFeatureImportance__Low                                                      = 2,
	EMeshFeatureImportance__Normal                                                   = 3,
	EMeshFeatureImportance__High                                                     = 4,
	EMeshFeatureImportance__Highest                                                  = 5
};

/// Enum /Script/Engine.EVertexPaintAxis
/// Size: 0x01 (1 bytes)
enum class EVertexPaintAxis : uint8_t
{
	EVertexPaintAxis__X                                                              = 0,
	EVertexPaintAxis__Y                                                              = 1,
	EVertexPaintAxis__Z                                                              = 2
};

/// Enum /Script/Engine.EMicroTransactionResult
/// Size: 0x01 (1 bytes)
enum class EMicroTransactionResult : uint8_t
{
	MTR_Succeeded                                                                    = 0,
	MTR_Failed                                                                       = 1,
	MTR_Canceled                                                                     = 2,
	MTR_RestoredFromServer                                                           = 3
};

/// Enum /Script/Engine.EMicroTransactionDelegate
/// Size: 0x01 (1 bytes)
enum class EMicroTransactionDelegate : uint8_t
{
	MTD_PurchaseQueryComplete                                                        = 0,
	MTD_PurchaseComplete                                                             = 1
};

/// Enum /Script/Engine.FNavigationSystemRunMode
/// Size: 0x01 (1 bytes)
enum class FNavigationSystemRunMode : uint8_t
{
	FNavigationSystemRunMode__InvalidMode                                            = 0,
	FNavigationSystemRunMode__GameMode                                               = 1,
	FNavigationSystemRunMode__EditorMode                                             = 2,
	FNavigationSystemRunMode__SimulationMode                                         = 3,
	FNavigationSystemRunMode__PIEMode                                                = 4,
	FNavigationSystemRunMode__InferFromWorldMode                                     = 5
};

/// Enum /Script/Engine.ENavigationQueryResult
/// Size: 0x01 (1 bytes)
enum class ENavigationQueryResult : uint8_t
{
	ENavigationQueryResult__Invalid                                                  = 0,
	ENavigationQueryResult__Error                                                    = 1,
	ENavigationQueryResult__Fail                                                     = 2,
	ENavigationQueryResult__Success                                                  = 3
};

/// Enum /Script/Engine.ENavPathEvent
/// Size: 0x01 (1 bytes)
enum class ENavPathEvent : uint8_t
{
	ENavPathEvent__Cleared                                                           = 0,
	ENavPathEvent__NewPath                                                           = 1,
	ENavPathEvent__UpdatedDueToGoalMoved                                             = 2,
	ENavPathEvent__UpdatedDueToNavigationChanged                                     = 3,
	ENavPathEvent__Invalidated                                                       = 4,
	ENavPathEvent__RePathFailed                                                      = 5,
	ENavPathEvent__MetaPathUpdate                                                    = 6,
	ENavPathEvent__Custom                                                            = 7
};

/// Enum /Script/Engine.ENavDataGatheringModeConfig
/// Size: 0x01 (1 bytes)
enum class ENavDataGatheringModeConfig : uint8_t
{
	ENavDataGatheringModeConfig__Invalid                                             = 0,
	ENavDataGatheringModeConfig__Instant                                             = 1,
	ENavDataGatheringModeConfig__Lazy                                                = 2
};

/// Enum /Script/Engine.ENavDataGatheringMode
/// Size: 0x01 (1 bytes)
enum class ENavDataGatheringMode : uint8_t
{
	ENavDataGatheringMode__Default                                                   = 0,
	ENavDataGatheringMode__Instant                                                   = 1,
	ENavDataGatheringMode__Lazy                                                      = 2
};

/// Enum /Script/Engine.ENavigationOptionFlag
/// Size: 0x01 (1 bytes)
enum class ENavigationOptionFlag : uint8_t
{
	ENavigationOptionFlag__Default                                                   = 0,
	ENavigationOptionFlag__Enable                                                    = 1,
	ENavigationOptionFlag__Disable                                                   = 2
};

/// Enum /Script/Engine.ENavLinkDirection
/// Size: 0x01 (1 bytes)
enum class ENavLinkDirection : uint8_t
{
	ENavLinkDirection__BothWays                                                      = 0,
	ENavLinkDirection__LeftToRight                                                   = 1,
	ENavLinkDirection__RightToLeft                                                   = 2
};

/// Enum /Script/Engine.EFastArraySerializerDeltaFlags
/// Size: 0x01 (1 bytes)
enum class EFastArraySerializerDeltaFlags : uint8_t
{
	EFastArraySerializerDeltaFlags__None                                             = 0,
	EFastArraySerializerDeltaFlags__HasBeenSerialized                                = 1,
	EFastArraySerializerDeltaFlags__HasDeltaBeenRequested                            = 2,
	EFastArraySerializerDeltaFlags__IsUsingDeltaSerialization                        = 4
};

/// Enum /Script/Engine.EEmitterRenderMode
/// Size: 0x01 (1 bytes)
enum class EEmitterRenderMode : uint8_t
{
	ERM_Normal                                                                       = 0,
	ERM_Point                                                                        = 1,
	ERM_Cross                                                                        = 2,
	ERM_LightsOnly                                                                   = 3,
	ERM_None                                                                         = 4
};

/// Enum /Script/Engine.EParticleSubUVInterpMethod
/// Size: 0x01 (1 bytes)
enum class EParticleSubUVInterpMethod : uint8_t
{
	PSUVIM_None                                                                      = 0,
	PSUVIM_Linear                                                                    = 1,
	PSUVIM_Linear_Blend                                                              = 2,
	PSUVIM_Random                                                                    = 3,
	PSUVIM_Random_Blend                                                              = 4
};

/// Enum /Script/Engine.EParticleBurstMethod
/// Size: 0x01 (1 bytes)
enum class EParticleBurstMethod : uint8_t
{
	EPBM_Instant                                                                     = 0,
	EPBM_Interpolated                                                                = 1
};

/// Enum /Script/Engine.EParticleSystemInsignificanceReaction
/// Size: 0x01 (1 bytes)
enum class EParticleSystemInsignificanceReaction : uint8_t
{
	EParticleSystemInsignificanceReaction__Auto                                      = 0,
	EParticleSystemInsignificanceReaction__Complete                                  = 1,
	EParticleSystemInsignificanceReaction__DisableTick                               = 2,
	EParticleSystemInsignificanceReaction__DisableTickAndKill                        = 3,
	EParticleSystemInsignificanceReaction__Num                                       = 4
};

/// Enum /Script/Engine.EParticleSignificanceLevel
/// Size: 0x01 (1 bytes)
enum class EParticleSignificanceLevel : uint8_t
{
	EParticleSignificanceLevel__Low                                                  = 0,
	EParticleSignificanceLevel__Medium                                               = 1,
	EParticleSignificanceLevel__High                                                 = 2,
	EParticleSignificanceLevel__Critical                                             = 3,
	EParticleSignificanceLevel__Num                                                  = 4
};

/// Enum /Script/Engine.EParticleDetailMode
/// Size: 0x01 (1 bytes)
enum class EParticleDetailMode : uint8_t
{
	PDM_Low                                                                          = 0,
	PDM_Medium                                                                       = 1,
	PDM_High                                                                         = 2
};

/// Enum /Script/Engine.EParticleSourceSelectionMethod
/// Size: 0x01 (1 bytes)
enum class EParticleSourceSelectionMethod : uint8_t
{
	EPSSM_Random                                                                     = 0,
	EPSSM_Sequential                                                                 = 1
};

/// Enum /Script/Engine.EModuleType
/// Size: 0x01 (1 bytes)
enum class EModuleType : uint8_t
{
	EPMT_General                                                                     = 0,
	EPMT_TypeData                                                                    = 1,
	EPMT_Beam                                                                        = 2,
	EPMT_Trail                                                                       = 3,
	EPMT_Spawn                                                                       = 4,
	EPMT_Required                                                                    = 5,
	EPMT_Event                                                                       = 6,
	EPMT_Light                                                                       = 7,
	EPMT_SubUV                                                                       = 8
};

/// Enum /Script/Engine.EAttractorParticleSelectionMethod
/// Size: 0x01 (1 bytes)
enum class EAttractorParticleSelectionMethod : uint8_t
{
	EAPSM_Random                                                                     = 0,
	EAPSM_Sequential                                                                 = 1
};

/// Enum /Script/Engine.Beam2SourceTargetTangentMethod
/// Size: 0x01 (1 bytes)
enum class Beam2SourceTargetTangentMethod : uint8_t
{
	PEB2STTM_Direct                                                                  = 0,
	PEB2STTM_UserSet                                                                 = 1,
	PEB2STTM_Distribution                                                            = 2,
	PEB2STTM_Emitter                                                                 = 3
};

/// Enum /Script/Engine.Beam2SourceTargetMethod
/// Size: 0x01 (1 bytes)
enum class Beam2SourceTargetMethod : uint8_t
{
	PEB2STM_Default                                                                  = 0,
	PEB2STM_UserSet                                                                  = 1,
	PEB2STM_Emitter                                                                  = 2,
	PEB2STM_Particle                                                                 = 3,
	PEB2STM_Actor                                                                    = 4
};

/// Enum /Script/Engine.BeamModifierType
/// Size: 0x01 (1 bytes)
enum class BeamModifierType : uint8_t
{
	PEB2MT_Source                                                                    = 0,
	PEB2MT_Target                                                                    = 1
};

/// Enum /Script/Engine.EParticleCameraOffsetUpdateMethod
/// Size: 0x01 (1 bytes)
enum class EParticleCameraOffsetUpdateMethod : uint8_t
{
	EPCOUM_DirectSet                                                                 = 0,
	EPCOUM_Additive                                                                  = 1,
	EPCOUM_Scalar                                                                    = 2
};

/// Enum /Script/Engine.EParticleCollisionComplete
/// Size: 0x01 (1 bytes)
enum class EParticleCollisionComplete : uint8_t
{
	EPCC_Kill                                                                        = 0,
	EPCC_Freeze                                                                      = 1,
	EPCC_HaltCollisions                                                              = 2,
	EPCC_FreezeTranslation                                                           = 3,
	EPCC_FreezeRotation                                                              = 4,
	EPCC_FreezeMovement                                                              = 5
};

/// Enum /Script/Engine.EParticleCollisionResponse
/// Size: 0x01 (1 bytes)
enum class EParticleCollisionResponse : uint8_t
{
	EParticleCollisionResponse__Bounce                                               = 0,
	EParticleCollisionResponse__Stop                                                 = 1,
	EParticleCollisionResponse__Kill                                                 = 2
};

/// Enum /Script/Engine.ELocationBoneSocketSelectionMethod
/// Size: 0x01 (1 bytes)
enum class ELocationBoneSocketSelectionMethod : uint8_t
{
	BONESOCKETSEL_Sequential                                                         = 0,
	BONESOCKETSEL_Random                                                             = 1
};

/// Enum /Script/Engine.ELocationBoneSocketSource
/// Size: 0x01 (1 bytes)
enum class ELocationBoneSocketSource : uint8_t
{
	BONESOCKETSOURCE_Bones                                                           = 0,
	BONESOCKETSOURCE_Sockets                                                         = 1
};

/// Enum /Script/Engine.ELocationEmitterSelectionMethod
/// Size: 0x01 (1 bytes)
enum class ELocationEmitterSelectionMethod : uint8_t
{
	ELESM_Random                                                                     = 0,
	ELESM_Sequential                                                                 = 1
};

/// Enum /Script/Engine.CylinderHeightAxis
/// Size: 0x01 (1 bytes)
enum class CylinderHeightAxis : uint8_t
{
	PMLPC_HEIGHTAXIS_X                                                               = 0,
	PMLPC_HEIGHTAXIS_Y                                                               = 1,
	PMLPC_HEIGHTAXIS_Z                                                               = 2
};

/// Enum /Script/Engine.ELocationSkelVertSurfaceSource
/// Size: 0x01 (1 bytes)
enum class ELocationSkelVertSurfaceSource : uint8_t
{
	VERTSURFACESOURCE_Vert                                                           = 0,
	VERTSURFACESOURCE_Surface                                                        = 1
};

/// Enum /Script/Engine.EOrbitChainMode
/// Size: 0x01 (1 bytes)
enum class EOrbitChainMode : uint8_t
{
	EOChainMode_Add                                                                  = 0,
	EOChainMode_Scale                                                                = 1,
	EOChainMode_Link                                                                 = 2
};

/// Enum /Script/Engine.EParticleAxisLock
/// Size: 0x01 (1 bytes)
enum class EParticleAxisLock : uint8_t
{
	EPAL_NONE                                                                        = 0,
	EPAL_X                                                                           = 1,
	EPAL_Y                                                                           = 2,
	EPAL_Z                                                                           = 3,
	EPAL_NEGATIVE_X                                                                  = 4,
	EPAL_NEGATIVE_Y                                                                  = 5,
	EPAL_NEGATIVE_Z                                                                  = 6,
	EPAL_ROTATE_X                                                                    = 7,
	EPAL_ROTATE_Y                                                                    = 8,
	EPAL_ROTATE_Z                                                                    = 9
};

/// Enum /Script/Engine.EEmitterDynamicParameterValue
/// Size: 0x01 (1 bytes)
enum class EEmitterDynamicParameterValue : uint8_t
{
	EDPV_UserSet                                                                     = 0,
	EDPV_AutoSet                                                                     = 1,
	EDPV_VelocityX                                                                   = 2,
	EDPV_VelocityY                                                                   = 3,
	EDPV_VelocityZ                                                                   = 4,
	EDPV_VelocityMag                                                                 = 5
};

/// Enum /Script/Engine.EEmitterNormalsMode
/// Size: 0x01 (1 bytes)
enum class EEmitterNormalsMode : uint8_t
{
	ENM_CameraFacing                                                                 = 0,
	ENM_Spherical                                                                    = 1,
	ENM_Cylindrical                                                                  = 2
};

/// Enum /Script/Engine.EParticleSortMode
/// Size: 0x01 (1 bytes)
enum class EParticleSortMode : uint8_t
{
	PSORTMODE_None                                                                   = 0,
	PSORTMODE_ViewProjDepth                                                          = 1,
	PSORTMODE_DistanceToView                                                         = 2,
	PSORTMODE_Age_OldestFirst                                                        = 3,
	PSORTMODE_Age_NewestFirst                                                        = 4
};

/// Enum /Script/Engine.EParticleUVFlipMode
/// Size: 0x01 (1 bytes)
enum class EParticleUVFlipMode : uint8_t
{
	EParticleUVFlipMode__None                                                        = 0,
	EParticleUVFlipMode__FlipUV                                                      = 1,
	EParticleUVFlipMode__FlipUOnly                                                   = 2,
	EParticleUVFlipMode__FlipVOnly                                                   = 3,
	EParticleUVFlipMode__RandomFlipUV                                                = 4,
	EParticleUVFlipMode__RandomFlipUOnly                                             = 5,
	EParticleUVFlipMode__RandomFlipVOnly                                             = 6,
	EParticleUVFlipMode__RandomFlipUVIndependent                                     = 7
};

/// Enum /Script/Engine.ETrail2SourceMethod
/// Size: 0x01 (1 bytes)
enum class ETrail2SourceMethod : uint8_t
{
	PET2SRCM_Default                                                                 = 0,
	PET2SRCM_Particle                                                                = 1,
	PET2SRCM_Actor                                                                   = 2
};

/// Enum /Script/Engine.EBeamTaperMethod
/// Size: 0x01 (1 bytes)
enum class EBeamTaperMethod : uint8_t
{
	PEBTM_None                                                                       = 0,
	PEBTM_Full                                                                       = 1,
	PEBTM_Partial                                                                    = 2
};

/// Enum /Script/Engine.EBeam2Method
/// Size: 0x01 (1 bytes)
enum class EBeam2Method : uint8_t
{
	PEB2M_Distance                                                                   = 0,
	PEB2M_Target                                                                     = 1,
	PEB2M_Branch                                                                     = 2
};

/// Enum /Script/Engine.EMeshCameraFacingOptions
/// Size: 0x01 (1 bytes)
enum class EMeshCameraFacingOptions : uint8_t
{
	XAxisFacing_NoUp                                                                 = 0,
	XAxisFacing_ZUp                                                                  = 1,
	XAxisFacing_NegativeZUp                                                          = 2,
	XAxisFacing_YUp                                                                  = 3,
	XAxisFacing_NegativeYUp                                                          = 4,
	LockedAxis_ZAxisFacing                                                           = 5,
	LockedAxis_NegativeZAxisFacing                                                   = 6,
	LockedAxis_YAxisFacing                                                           = 7,
	LockedAxis_NegativeYAxisFacing                                                   = 8,
	VelocityAligned_ZAxisFacing                                                      = 9,
	VelocityAligned_NegativeZAxisFacing                                              = 10,
	VelocityAligned_YAxisFacing                                                      = 11,
	VelocityAligned_NegativeYAxisFacing                                              = 12
};

/// Enum /Script/Engine.EMeshCameraFacingUpAxis
/// Size: 0x01 (1 bytes)
enum class EMeshCameraFacingUpAxis : uint8_t
{
	CameraFacing_NoneUP                                                              = 0,
	CameraFacing_ZUp                                                                 = 1,
	CameraFacing_NegativeZUp                                                         = 2,
	CameraFacing_YUp                                                                 = 3,
	CameraFacing_NegativeYUp                                                         = 4
};

/// Enum /Script/Engine.EMeshScreenAlignment
/// Size: 0x01 (1 bytes)
enum class EMeshScreenAlignment : uint8_t
{
	PSMA_MeshFaceCameraWithRoll                                                      = 0,
	PSMA_MeshFaceCameraWithSpin                                                      = 1,
	PSMA_MeshFaceCameraWithLockedAxis                                                = 2
};

/// Enum /Script/Engine.ETrailsRenderAxisOption
/// Size: 0x01 (1 bytes)
enum class ETrailsRenderAxisOption : uint8_t
{
	Trails_CameraUp                                                                  = 0,
	Trails_SourceUp                                                                  = 1,
	Trails_WorldUp                                                                   = 2
};

/// Enum /Script/Engine.EParticleScreenAlignment
/// Size: 0x01 (1 bytes)
enum class EParticleScreenAlignment : uint8_t
{
	PSA_FacingCameraPosition                                                         = 0,
	PSA_Square                                                                       = 1,
	PSA_Rectangle                                                                    = 2,
	PSA_Velocity                                                                     = 3,
	PSA_AwayFromCenter                                                               = 4,
	PSA_TypeSpecific                                                                 = 5,
	PSA_FacingCameraDistanceBlend                                                    = 6
};

/// Enum /Script/Engine.EParticleSystemOcclusionBoundsMethod
/// Size: 0x01 (1 bytes)
enum class EParticleSystemOcclusionBoundsMethod : uint8_t
{
	EPSOBM_None                                                                      = 0,
	EPSOBM_ParticleBounds                                                            = 1,
	EPSOBM_CustomBounds                                                              = 2
};

/// Enum /Script/Engine.ParticleSystemLODMethod
/// Size: 0x01 (1 bytes)
enum class ParticleSystemLODMethod : uint8_t
{
	PARTICLESYSTEMLODMETHOD_Automatic                                                = 0,
	PARTICLESYSTEMLODMETHOD_DirectSet                                                = 1,
	PARTICLESYSTEMLODMETHOD_ActivateAutomatic                                        = 2
};

/// Enum /Script/Engine.EParticleSystemUpdateMode
/// Size: 0x01 (1 bytes)
enum class EParticleSystemUpdateMode : uint8_t
{
	EPSUM_RealTime                                                                   = 0,
	EPSUM_FixedTime                                                                  = 1
};

/// Enum /Script/Engine.EParticleEventType
/// Size: 0x01 (1 bytes)
enum class EParticleEventType : uint8_t
{
	EPET_Any                                                                         = 0,
	EPET_Spawn                                                                       = 1,
	EPET_Death                                                                       = 2,
	EPET_Collision                                                                   = 3,
	EPET_Burst                                                                       = 4,
	EPET_Blueprint                                                                   = 5
};

/// Enum /Script/Engine.ParticleReplayState
/// Size: 0x01 (1 bytes)
enum class ParticleReplayState : uint8_t
{
	PRS_Disabled                                                                     = 0,
	PRS_Capturing                                                                    = 1,
	PRS_Replaying                                                                    = 2
};

/// Enum /Script/Engine.EParticleSysParamType
/// Size: 0x01 (1 bytes)
enum class EParticleSysParamType : uint8_t
{
	PSPT_None                                                                        = 0,
	PSPT_Scalar                                                                      = 1,
	PSPT_ScalarRand                                                                  = 2,
	PSPT_Vector                                                                      = 3,
	PSPT_VectorRand                                                                  = 4,
	PSPT_Color                                                                       = 5,
	PSPT_Actor                                                                       = 6,
	PSPT_Material                                                                    = 7,
	PSPT_VectorUnitRand                                                              = 8
};

/// Enum /Script/Engine.ESettingsLockedAxis
/// Size: 0x01 (1 bytes)
enum class ESettingsLockedAxis : uint8_t
{
	ESettingsLockedAxis__None                                                        = 0,
	ESettingsLockedAxis__X                                                           = 1,
	ESettingsLockedAxis__Y                                                           = 2,
	ESettingsLockedAxis__Z                                                           = 3,
	ESettingsLockedAxis__Invalid                                                     = 4
};

/// Enum /Script/Engine.ESettingsDOF
/// Size: 0x01 (1 bytes)
enum class ESettingsDOF : uint8_t
{
	ESettingsDOF__Full3D                                                             = 0,
	ESettingsDOF__YZPlane                                                            = 1,
	ESettingsDOF__XZPlane                                                            = 2,
	ESettingsDOF__XYPlane                                                            = 3
};

/// Enum /Script/Engine.EViewTargetBlendFunction
/// Size: 0x01 (1 bytes)
enum class EViewTargetBlendFunction : uint8_t
{
	VTBlend_Linear                                                                   = 0,
	VTBlend_Cubic                                                                    = 1,
	VTBlend_EaseIn                                                                   = 2,
	VTBlend_EaseOut                                                                  = 3,
	VTBlend_EaseInOut                                                                = 4
};

/// Enum /Script/Engine.EDynamicForceFeedbackAction
/// Size: 0x01 (1 bytes)
enum class EDynamicForceFeedbackAction : uint8_t
{
	EDynamicForceFeedbackAction__Start                                               = 0,
	EDynamicForceFeedbackAction__Update                                              = 1,
	EDynamicForceFeedbackAction__Stop                                                = 2
};

/// Enum /Script/Engine.EMobileReflectionType
/// Size: 0x01 (1 bytes)
enum class EMobileReflectionType : uint8_t
{
	EMobileReflectionType__Default                                                   = 0,
	EMobileReflectionType__OnlySkyLight                                              = 1,
	EMobileReflectionType__OnlyDetail                                                = 2,
	EMobileReflectionType__SpecifiedCapture                                          = 3
};

/// Enum /Script/Engine.ERendererStencilMask
/// Size: 0x01 (1 bytes)
enum class ERendererStencilMask : uint8_t
{
	ERendererStencilMask__ERSM_Default                                               = 0,
	ERendererStencilMask__ERSM                                                       = 1,
	ERendererStencilMask__ERSM3                                                      = 2,
	ERendererStencilMask__ERSM4                                                      = 3,
	ERendererStencilMask__ERSM5                                                      = 4,
	ERendererStencilMask__ERSM6                                                      = 5,
	ERendererStencilMask__ERSM7                                                      = 6,
	ERendererStencilMask__ERSM8                                                      = 7,
	ERendererStencilMask__ERSM9                                                      = 8,
	ERendererStencilMask__ERSM10                                                     = 9
};

/// Enum /Script/Engine.EHasCustomNavigableGeometry
/// Size: 0x01 (1 bytes)
enum class EHasCustomNavigableGeometry : uint8_t
{
	EHasCustomNavigableGeometry__No                                                  = 0,
	EHasCustomNavigableGeometry__Yes                                                 = 1,
	EHasCustomNavigableGeometry__EvenIfNotCollidable                                 = 2,
	EHasCustomNavigableGeometry__DontExport                                          = 3
};

/// Enum /Script/Engine.ECanBeCharacterBase
/// Size: 0x01 (1 bytes)
enum class ECanBeCharacterBase : uint8_t
{
	ECB_No                                                                           = 0,
	ECB_Yes                                                                          = 1,
	ECB_Owner                                                                        = 2
};

/// Enum /Script/Engine.EQuarztQuantizationReference
/// Size: 0x01 (1 bytes)
enum class EQuarztQuantizationReference : uint8_t
{
	EQuarztQuantizationReference__BarRelative                                        = 0,
	EQuarztQuantizationReference__TransportRelative                                  = 1,
	EQuarztQuantizationReference__CurrentTimeRelative                                = 2,
	EQuarztQuantizationReference__Count                                              = 3
};

/// Enum /Script/Engine.EQuartzDelegateType
/// Size: 0x01 (1 bytes)
enum class EQuartzDelegateType : uint8_t
{
	EQuartzDelegateType__MetronomeTick                                               = 0,
	EQuartzDelegateType__CommandEvent                                                = 1,
	EQuartzDelegateType__Count                                                       = 2
};

/// Enum /Script/Engine.EQuartzTimeSignatureQuantization
/// Size: 0x01 (1 bytes)
enum class EQuartzTimeSignatureQuantization : uint8_t
{
	EQuartzTimeSignatureQuantization__HalfNote                                       = 0,
	EQuartzTimeSignatureQuantization__QuarterNote                                    = 1,
	EQuartzTimeSignatureQuantization__EighthNote                                     = 2,
	EQuartzTimeSignatureQuantization__SixteenthNote                                  = 3,
	EQuartzTimeSignatureQuantization__ThirtySecondNote                               = 4,
	EQuartzTimeSignatureQuantization__Count                                          = 5
};

/// Enum /Script/Engine.ERichCurveExtrapolation
/// Size: 0x01 (1 bytes)
enum class ERichCurveExtrapolation : uint8_t
{
	RCCE_Cycle                                                                       = 0,
	RCCE_CycleWithOffset                                                             = 1,
	RCCE_Oscillate                                                                   = 2,
	RCCE_Linear                                                                      = 3,
	RCCE_Constant                                                                    = 4,
	RCCE_None                                                                        = 5
};

/// Enum /Script/Engine.ERichCurveInterpMode
/// Size: 0x01 (1 bytes)
enum class ERichCurveInterpMode : uint8_t
{
	RCIM_Linear                                                                      = 0,
	RCIM_Constant                                                                    = 1,
	RCIM_Cubic                                                                       = 2,
	RCIM_None                                                                        = 3
};

/// Enum /Script/Engine.EMobileReflectionLevel
/// Size: 0x01 (1 bytes)
enum class EMobileReflectionLevel : uint8_t
{
	EMobileReflectionLevel__SkyLight                                                 = 0,
	EMobileReflectionLevel__Detail                                                   = 1
};

/// Enum /Script/Engine.EMobileReflectionCompression
/// Size: 0x01 (1 bytes)
enum class EMobileReflectionCompression : uint8_t
{
	EMobileReflectionCompression__Default                                            = 0,
	EMobileReflectionCompression__On                                                 = 1,
	EMobileReflectionCompression__Off                                                = 2
};

/// Enum /Script/Engine.EReflectionSourceType
/// Size: 0x01 (1 bytes)
enum class EReflectionSourceType : uint8_t
{
	EReflectionSourceType__CapturedScene                                             = 0,
	EReflectionSourceType__SpecifiedCubemap                                          = 1
};

/// Enum /Script/Engine.EDefaultBackBufferPixelFormat
/// Size: 0x01 (1 bytes)
enum class EDefaultBackBufferPixelFormat : uint8_t
{
	EDefaultBackBufferPixelFormat__DBBPF_B8G8R8A8                                    = 0,
	EDefaultBackBufferPixelFormat__DBBPF_A16B16G16R16_DEPRECATED                     = 1,
	EDefaultBackBufferPixelFormat__DBBPF_FloatRGB_DEPRECATED                         = 2,
	EDefaultBackBufferPixelFormat__DBBPF_FloatRGBA                                   = 3,
	EDefaultBackBufferPixelFormat__DBBPF_A2B10G10R10                                 = 4
};

/// Enum /Script/Engine.EAutoExposureMethodUI
/// Size: 0x01 (1 bytes)
enum class EAutoExposureMethodUI : uint8_t
{
	EAutoExposureMethodUI__AEM_Histogram                                             = 0,
	EAutoExposureMethodUI__AEM_Basic                                                 = 1,
	EAutoExposureMethodUI__AEM_Manual                                                = 2
};

/// Enum /Script/Engine.EAlphaChannelMode
/// Size: 0x01 (1 bytes)
enum class EAlphaChannelMode : uint8_t
{
	EAlphaChannelMode__Disabled                                                      = 0,
	EAlphaChannelMode__LinearColorSpaceOnly                                          = 1,
	EAlphaChannelMode__AllowThroughTonemapper                                        = 2
};

/// Enum /Script/Engine.EEarlyZPass
/// Size: 0x01 (1 bytes)
enum class EEarlyZPass : uint8_t
{
	EEarlyZPass__None                                                                = 0,
	EEarlyZPass__OpaqueOnly                                                          = 1,
	EEarlyZPass__OpaqueAndMasked                                                     = 2,
	EEarlyZPass__Auto                                                                = 3
};

/// Enum /Script/Engine.ECustomDepthStencil
/// Size: 0x01 (1 bytes)
enum class ECustomDepthStencil : uint8_t
{
	ECustomDepthStencil__Disabled                                                    = 0,
	ECustomDepthStencil__Enabled                                                     = 1,
	ECustomDepthStencil__EnabledOnDemand                                             = 2,
	ECustomDepthStencil__EnabledWithStencil                                          = 3
};

/// Enum /Script/Engine.EMobileMSAASampleCount
/// Size: 0x01 (1 bytes)
enum class EMobileMSAASampleCount : uint8_t
{
	EMobileMSAASampleCount__One                                                      = 1,
	EMobileMSAASampleCount__Two                                                      = 2,
	EMobileMSAASampleCount__Four                                                     = 4,
	EMobileMSAASampleCount__Eight                                                    = 8
};

/// Enum /Script/Engine.ECompositingSampleCount
/// Size: 0x01 (1 bytes)
enum class ECompositingSampleCount : uint8_t
{
	ECompositingSampleCount__One                                                     = 1,
	ECompositingSampleCount__Two                                                     = 2,
	ECompositingSampleCount__Four                                                    = 4,
	ECompositingSampleCount__Eight                                                   = 8
};

/// Enum /Script/Engine.EClearSceneOptions
/// Size: 0x01 (1 bytes)
enum class EClearSceneOptions : uint8_t
{
	EClearSceneOptions__NoClear                                                      = 0,
	EClearSceneOptions__HardwareClear                                                = 1,
	EClearSceneOptions__QuadAtMaxZ                                                   = 2
};

/// Enum /Script/Engine.EReporterLineStyle
/// Size: 0x01 (1 bytes)
enum class EReporterLineStyle : uint8_t
{
	EReporterLineStyle__Line                                                         = 0,
	EReporterLineStyle__Dash                                                         = 1
};

/// Enum /Script/Engine.ELegendPosition
/// Size: 0x01 (1 bytes)
enum class ELegendPosition : uint8_t
{
	ELegendPosition__Outside                                                         = 0,
	ELegendPosition__Inside                                                          = 1
};

/// Enum /Script/Engine.EGraphDataStyle
/// Size: 0x01 (1 bytes)
enum class EGraphDataStyle : uint8_t
{
	EGraphDataStyle__Lines                                                           = 0,
	EGraphDataStyle__Filled                                                          = 1
};

/// Enum /Script/Engine.EGraphAxisStyle
/// Size: 0x01 (1 bytes)
enum class EGraphAxisStyle : uint8_t
{
	EGraphAxisStyle__Lines                                                           = 0,
	EGraphAxisStyle__Notches                                                         = 1,
	EGraphAxisStyle__Grid                                                            = 2
};

/// Enum /Script/Engine.ReverbPreset
/// Size: 0x01 (1 bytes)
enum class ReverbPreset : uint8_t
{
	REVERB_Default                                                                   = 0,
	REVERB_Bathroom                                                                  = 1,
	REVERB_StoneRoom                                                                 = 2,
	REVERB_Auditorium                                                                = 3,
	REVERB_ConcertHall                                                               = 4,
	REVERB_Cave                                                                      = 5,
	REVERB_Hallway                                                                   = 6,
	REVERB_StoneCorridor                                                             = 7,
	REVERB_Alley                                                                     = 8,
	REVERB_Forest                                                                    = 9,
	REVERB_City                                                                      = 10,
	REVERB_Mountains                                                                 = 11,
	REVERB_Quarry                                                                    = 12,
	REVERB_Plain                                                                     = 13,
	REVERB_ParkingLot                                                                = 14,
	REVERB_SewerPipe                                                                 = 15,
	REVERB_Underwater                                                                = 16,
	REVERB_SmallRoom                                                                 = 17,
	REVERB_MediumRoom                                                                = 18,
	REVERB_LargeRoom                                                                 = 19,
	REVERB_MediumHall                                                                = 20,
	REVERB_LargeHall                                                                 = 21,
	REVERB_Plate                                                                     = 22
};

/// Enum /Script/Engine.ERichCurveKeyTimeCompressionFormat
/// Size: 0x01 (1 bytes)
enum class ERichCurveKeyTimeCompressionFormat : uint8_t
{
	RCKTCF_uint16                                                                    = 0,
	RCKTCF_float32                                                                   = 1
};

/// Enum /Script/Engine.ERichCurveCompressionFormat
/// Size: 0x01 (1 bytes)
enum class ERichCurveCompressionFormat : uint8_t
{
	RCCF_Empty                                                                       = 0,
	RCCF_Constant                                                                    = 1,
	RCCF_Linear                                                                      = 2,
	RCCF_Cubic                                                                       = 3,
	RCCF_Mixed                                                                       = 4,
	RCCF_Weighted                                                                    = 5
};

/// Enum /Script/Engine.ERichCurveTangentWeightMode
/// Size: 0x01 (1 bytes)
enum class ERichCurveTangentWeightMode : uint8_t
{
	RCTWM_WeightedNone                                                               = 0,
	RCTWM_WeightedArrive                                                             = 1,
	RCTWM_WeightedLeave                                                              = 2,
	RCTWM_WeightedBoth                                                               = 3
};

/// Enum /Script/Engine.ERichCurveTangentMode
/// Size: 0x01 (1 bytes)
enum class ERichCurveTangentMode : uint8_t
{
	RCTM_Auto                                                                        = 0,
	RCTM_User                                                                        = 1,
	RCTM_Break                                                                       = 2,
	RCTM_None                                                                        = 3
};

/// Enum /Script/Engine.EConstraintTransform
/// Size: 0x01 (1 bytes)
enum class EConstraintTransform : uint8_t
{
	EConstraintTransform__Absolute                                                   = 0,
	EConstraintTransform__Relative                                                   = 1
};

/// Enum /Script/Engine.EControlConstraint
/// Size: 0x01 (1 bytes)
enum class EControlConstraint : uint8_t
{
	EControlConstraint__Orientation                                                  = 0,
	EControlConstraint__Translation                                                  = 1
};

/// Enum /Script/Engine.ERootMotionFinishVelocityMode
/// Size: 0x01 (1 bytes)
enum class ERootMotionFinishVelocityMode : uint8_t
{
	ERootMotionFinishVelocityMode__MaintainLastRootMotionVelocity                    = 0,
	ERootMotionFinishVelocityMode__SetVelocity                                       = 1,
	ERootMotionFinishVelocityMode__ClampVelocity                                     = 2
};

/// Enum /Script/Engine.ERootMotionSourceSettingsFlags
/// Size: 0x01 (1 bytes)
enum class ERootMotionSourceSettingsFlags : uint8_t
{
	ERootMotionSourceSettingsFlags__UseSensitiveLiftoffCheck                         = 1,
	ERootMotionSourceSettingsFlags__DisablePartialEndTick                            = 2,
	ERootMotionSourceSettingsFlags__IgnoreZAccumulate                                = 4
};

/// Enum /Script/Engine.ERootMotionSourceStatusFlags
/// Size: 0x01 (1 bytes)
enum class ERootMotionSourceStatusFlags : uint8_t
{
	ERootMotionSourceStatusFlags__Prepared                                           = 1,
	ERootMotionSourceStatusFlags__Finished                                           = 2,
	ERootMotionSourceStatusFlags__MarkedForRemoval                                   = 4
};

/// Enum /Script/Engine.ERootMotionAccumulateMode
/// Size: 0x01 (1 bytes)
enum class ERootMotionAccumulateMode : uint8_t
{
	ERootMotionAccumulateMode__Override                                              = 0,
	ERootMotionAccumulateMode__Additive                                              = 1
};

/// Enum /Script/Engine.ERuntimeVirtualTextureMainPassType
/// Size: 0x01 (1 bytes)
enum class ERuntimeVirtualTextureMainPassType : uint8_t
{
	ERuntimeVirtualTextureMainPassType__Never                                        = 0,
	ERuntimeVirtualTextureMainPassType__Exclusive                                    = 1,
	ERuntimeVirtualTextureMainPassType__Always                                       = 2
};

/// Enum /Script/Engine.ERuntimeVirtualTextureMaterialType
/// Size: 0x01 (1 bytes)
enum class ERuntimeVirtualTextureMaterialType : uint8_t
{
	ERuntimeVirtualTextureMaterialType__BaseColor                                    = 0,
	ERuntimeVirtualTextureMaterialType__BaseColor_Normal_DEPRECATED                  = 1,
	ERuntimeVirtualTextureMaterialType__BaseColor_Normal_Specular                    = 2,
	ERuntimeVirtualTextureMaterialType__BaseColor_Normal_Specular_YCoCg              = 3,
	ERuntimeVirtualTextureMaterialType__BaseColor_Normal_Specular_Mask_YCoCg         = 4,
	ERuntimeVirtualTextureMaterialType__WorldHeight                                  = 5,
	ERuntimeVirtualTextureMaterialType__Count                                        = 6
};

/// Enum /Script/Engine.EMobilePixelProjectedReflectionQuality
/// Size: 0x01 (1 bytes)
enum class EMobilePixelProjectedReflectionQuality : uint8_t
{
	EMobilePixelProjectedReflectionQuality__Disabled                                 = 0,
	EMobilePixelProjectedReflectionQuality__BestPerformance                          = 1,
	EMobilePixelProjectedReflectionQuality__BetterQuality                            = 2,
	EMobilePixelProjectedReflectionQuality__BestQuality                              = 3
};

/// Enum /Script/Engine.EMobilePlanarReflectionMode
/// Size: 0x01 (1 bytes)
enum class EMobilePlanarReflectionMode : uint8_t
{
	EMobilePlanarReflectionMode__Usual                                               = 0,
	EMobilePlanarReflectionMode__MobilePPRExclusive                                  = 1,
	EMobilePlanarReflectionMode__MobilePPR                                           = 2
};

/// Enum /Script/Engine.EReflectedAndRefractedRayTracedShadows
/// Size: 0x01 (1 bytes)
enum class EReflectedAndRefractedRayTracedShadows : uint8_t
{
	EReflectedAndRefractedRayTracedShadows__Disabled                                 = 0,
	EReflectedAndRefractedRayTracedShadows__Hard_shadows                             = 1,
	EReflectedAndRefractedRayTracedShadows__Area_shadows                             = 2
};

/// Enum /Script/Engine.ERayTracingGlobalIlluminationType
/// Size: 0x01 (1 bytes)
enum class ERayTracingGlobalIlluminationType : uint8_t
{
	ERayTracingGlobalIlluminationType__Disabled                                      = 0,
	ERayTracingGlobalIlluminationType__BruteForce                                    = 1,
	ERayTracingGlobalIlluminationType__FinalGather                                   = 2
};

/// Enum /Script/Engine.ETranslucencyType
/// Size: 0x01 (1 bytes)
enum class ETranslucencyType : uint8_t
{
	ETranslucencyType__Raster                                                        = 0,
	ETranslucencyType__RayTracing                                                    = 1
};

/// Enum /Script/Engine.EReflectionsType
/// Size: 0x01 (1 bytes)
enum class EReflectionsType : uint8_t
{
	EReflectionsType__ScreenSpace                                                    = 0,
	EReflectionsType__RayTracing                                                     = 1
};

/// Enum /Script/Engine.ELightUnits
/// Size: 0x01 (1 bytes)
enum class ELightUnits : uint8_t
{
	ELightUnits__Unitless                                                            = 0,
	ELightUnits__Candelas                                                            = 1,
	ELightUnits__Lumens                                                              = 2
};

/// Enum /Script/Engine.EBloomMethod
/// Size: 0x01 (1 bytes)
enum class EBloomMethod : uint8_t
{
	BM_SOG                                                                           = 0,
	BM_FFT                                                                           = 1
};

/// Enum /Script/Engine.EAutoExposureMethod
/// Size: 0x01 (1 bytes)
enum class EAutoExposureMethod : uint8_t
{
	AEM_Histogram                                                                    = 0,
	AEM_Basic                                                                        = 1,
	AEM_Manual                                                                       = 2
};

/// Enum /Script/Engine.EAntiAliasingMethod
/// Size: 0x01 (1 bytes)
enum class EAntiAliasingMethod : uint8_t
{
	AAM_None                                                                         = 0,
	AAM_FXAA                                                                         = 1,
	AAM_TemporalAA                                                                   = 2,
	AAM_MSAA                                                                         = 3
};

/// Enum /Script/Engine.EDepthOfFieldMethod
/// Size: 0x01 (1 bytes)
enum class EDepthOfFieldMethod : uint8_t
{
	DOFM_BokehDOF                                                                    = 0,
	DOFM_Gaussian                                                                    = 1,
	DOFM_CircleDOF                                                                   = 2
};

/// Enum /Script/Engine.ESceneCapturePrimitiveRenderMode
/// Size: 0x01 (1 bytes)
enum class ESceneCapturePrimitiveRenderMode : uint8_t
{
	ESceneCapturePrimitiveRenderMode__PRM_LegacySceneCapture                         = 0,
	ESceneCapturePrimitiveRenderMode__PRM_RenderScenePrimitives                      = 1,
	ESceneCapturePrimitiveRenderMode__PRM_UseShowOnlyList                            = 2
};

/// Enum /Script/Engine.EMaterialProperty
/// Size: 0x01 (1 bytes)
enum class EMaterialProperty : uint8_t
{
	MP_EmissiveColor                                                                 = 0,
	MP_Opacity                                                                       = 1,
	MP_OpacityMask                                                                   = 2,
	MP_DiffuseColor                                                                  = 3,
	MP_SpecularColor                                                                 = 4,
	MP_BaseColor                                                                     = 5,
	MP_Metallic                                                                      = 6,
	MP_Specular                                                                      = 7,
	MP_Roughness                                                                     = 8,
	MP_Anisotropy                                                                    = 9,
	MP_Normal                                                                        = 10,
	MP_Tangent                                                                       = 11,
	MP_WorldPositionOffset                                                           = 12,
	MP_WorldDisplacement                                                             = 13,
	MP_TessellationMultiplier                                                        = 14,
	MP_SubsurfaceColor                                                               = 15,
	MP_CustomData0                                                                   = 16,
	MP_CustomData1                                                                   = 17,
	MP_AmbientOcclusion                                                              = 18,
	MP_Refraction                                                                    = 19,
	MP_CustomizedUVs0                                                                = 20,
	MP_CustomizedUVs1                                                                = 21,
	MP_CustomizedUVs2                                                                = 22,
	MP_CustomizedUVs3                                                                = 23,
	MP_CustomizedUVs4                                                                = 24,
	MP_CustomizedUVs5                                                                = 25,
	MP_CustomizedUVs6                                                                = 26,
	MP_CustomizedUVs7                                                                = 27,
	MP_PixelDepthOffset                                                              = 28,
	MP_ShadingModel                                                                  = 29,
	MP_MaterialAttributes                                                            = 30,
	MP_CustomOutput                                                                  = 31
};

/// Enum /Script/Engine.ESkinCacheDefaultBehavior
/// Size: 0x01 (1 bytes)
enum class ESkinCacheDefaultBehavior : uint8_t
{
	ESkinCacheDefaultBehavior__Exclusive                                             = 0,
	ESkinCacheDefaultBehavior__Inclusive                                             = 1
};

/// Enum /Script/Engine.ESkinCacheUsage
/// Size: 0x01 (1 bytes)
enum class ESkinCacheUsage : uint8_t
{
	ESkinCacheUsage__Auto                                                            = 0,
	ESkinCacheUsage__Disabled                                                        = 255,
	ESkinCacheUsage__Enabled                                                         = 1
};

/// Enum /Script/Engine.EPhysicsTransformUpdateMode
/// Size: 0x01 (1 bytes)
enum class EPhysicsTransformUpdateMode : uint8_t
{
	EPhysicsTransformUpdateMode__SimulationUpatesComponentTransform                  = 0,
	EPhysicsTransformUpdateMode__ComponentTransformIsKinematic                       = 1
};

/// Enum /Script/Engine.EAnimationMode
/// Size: 0x01 (1 bytes)
enum class EAnimationMode : uint8_t
{
	EAnimationMode__AnimationBlueprint                                               = 0,
	EAnimationMode__AnimationSingleNode                                              = 1,
	EAnimationMode__AnimationCustomMode                                              = 2
};

/// Enum /Script/Engine.EKinematicBonesUpdateToPhysics
/// Size: 0x01 (1 bytes)
enum class EKinematicBonesUpdateToPhysics : uint8_t
{
	EKinematicBonesUpdateToPhysics__SkipSimulatingBones                              = 0,
	EKinematicBonesUpdateToPhysics__SkipAllBones                                     = 1
};

/// Enum /Script/Engine.ECustomBoneAttributeLookup
/// Size: 0x01 (1 bytes)
enum class ECustomBoneAttributeLookup : uint8_t
{
	ECustomBoneAttributeLookup__BoneOnly                                             = 0,
	ECustomBoneAttributeLookup__ImmediateParent                                      = 1,
	ECustomBoneAttributeLookup__ParentHierarchy                                      = 2
};

/// Enum /Script/Engine.EClothMassMode
/// Size: 0x01 (1 bytes)
enum class EClothMassMode : uint8_t
{
	EClothMassMode__UniformMass                                                      = 0,
	EClothMassMode__TotalMass                                                        = 1,
	EClothMassMode__Density                                                          = 2,
	EClothMassMode__MaxClothMassMode                                                 = 3
};

/// Enum /Script/Engine.EAnimCurveType
/// Size: 0x01 (1 bytes)
enum class EAnimCurveType : uint8_t
{
	EAnimCurveType__AttributeCurve                                                   = 0,
	EAnimCurveType__MaterialCurve                                                    = 1,
	EAnimCurveType__MorphTargetCurve                                                 = 2,
	EAnimCurveType__MaxAnimCurveType                                                 = 3
};

/// Enum /Script/Engine.ESkeletalMeshSkinningImportVersions
/// Size: 0x01 (1 bytes)
enum class ESkeletalMeshSkinningImportVersions : uint8_t
{
	ESkeletalMeshSkinningImportVersions__Before_Versionning                          = 0,
	ESkeletalMeshSkinningImportVersions__SkeletalMeshBuildRefactor                   = 1,
	ESkeletalMeshSkinningImportVersions__VersionPlusOne                              = 2,
	ESkeletalMeshSkinningImportVersions__LatestVersion                               = 1
};

/// Enum /Script/Engine.ESkeletalMeshGeoImportVersions
/// Size: 0x01 (1 bytes)
enum class ESkeletalMeshGeoImportVersions : uint8_t
{
	ESkeletalMeshGeoImportVersions__Before_Versionning                               = 0,
	ESkeletalMeshGeoImportVersions__SkeletalMeshBuildRefactor                        = 1,
	ESkeletalMeshGeoImportVersions__VersionPlusOne                                   = 2,
	ESkeletalMeshGeoImportVersions__LatestVersion                                    = 1
};

/// Enum /Script/Engine.EBoneFilterActionOption
/// Size: 0x01 (1 bytes)
enum class EBoneFilterActionOption : uint8_t
{
	EBoneFilterActionOption__Remove                                                  = 0,
	EBoneFilterActionOption__Keep                                                    = 1,
	EBoneFilterActionOption__Invalid                                                 = 2
};

/// Enum /Script/Engine.SkeletalMeshOptimizationImportance
/// Size: 0x01 (1 bytes)
enum class SkeletalMeshOptimizationImportance : uint8_t
{
	SMOI_Off                                                                         = 0,
	SMOI_Lowest                                                                      = 1,
	SMOI_Low                                                                         = 2,
	SMOI_Normal                                                                      = 3,
	SMOI_High                                                                        = 4,
	SMOI_Highest                                                                     = 5
};

/// Enum /Script/Engine.SkeletalMeshOptimizationType
/// Size: 0x01 (1 bytes)
enum class SkeletalMeshOptimizationType : uint8_t
{
	SMOT_NumOfTriangles                                                              = 0,
	SMOT_MaxDeviation                                                                = 1,
	SMOT_TriangleOrDeviation                                                         = 2
};

/// Enum /Script/Engine.SkeletalMeshTerminationCriterion
/// Size: 0x01 (1 bytes)
enum class SkeletalMeshTerminationCriterion : uint8_t
{
	SMTC_NumOfTriangles                                                              = 0,
	SMTC_NumOfVerts                                                                  = 1,
	SMTC_TriangleOrVert                                                              = 2,
	SMTC_AbsNumOfTriangles                                                           = 3,
	SMTC_AbsNumOfVerts                                                               = 4,
	SMTC_AbsTriangleOrVert                                                           = 5
};

/// Enum /Script/Engine.EBoneTranslationRetargetingMode
/// Size: 0x01 (1 bytes)
enum class EBoneTranslationRetargetingMode : uint8_t
{
	EBoneTranslationRetargetingMode__Animation                                       = 0,
	EBoneTranslationRetargetingMode__Skeleton                                        = 1,
	EBoneTranslationRetargetingMode__AnimationScaled                                 = 2,
	EBoneTranslationRetargetingMode__AnimationRelative                               = 3,
	EBoneTranslationRetargetingMode__OrientAndScale                                  = 4
};

/// Enum /Script/Engine.EVertexOffsetUsageType
/// Size: 0x01 (1 bytes)
enum class EVertexOffsetUsageType : uint8_t
{
	EVertexOffsetUsageType__None                                                     = 0,
	EVertexOffsetUsageType__PreSkinningOffset                                        = 1,
	EVertexOffsetUsageType__PostSkinningOffset                                       = 2
};

/// Enum /Script/Engine.EBoneSpaces
/// Size: 0x01 (1 bytes)
enum class EBoneSpaces : uint8_t
{
	EBoneSpaces__WorldSpace                                                          = 0,
	EBoneSpaces__ComponentSpace                                                      = 1
};

/// Enum /Script/Engine.EVisibilityBasedAnimTickOption
/// Size: 0x01 (1 bytes)
enum class EVisibilityBasedAnimTickOption : uint8_t
{
	EVisibilityBasedAnimTickOption__AlwaysTickPoseAndRefreshBones                    = 0,
	EVisibilityBasedAnimTickOption__AlwaysTickPose                                   = 1,
	EVisibilityBasedAnimTickOption__OnlyTickMontagesWhenNotRendered                  = 2,
	EVisibilityBasedAnimTickOption__OnlyTickPoseWhenRendered                         = 3
};

/// Enum /Script/Engine.EPhysBodyOp
/// Size: 0x01 (1 bytes)
enum class EPhysBodyOp : uint8_t
{
	PBO_None                                                                         = 0,
	PBO_Term                                                                         = 1
};

/// Enum /Script/Engine.EBoneVisibilityStatus
/// Size: 0x01 (1 bytes)
enum class EBoneVisibilityStatus : uint8_t
{
	BVS_HiddenByParent                                                               = 0,
	BVS_Visible                                                                      = 1,
	BVS_ExplicitlyHidden                                                             = 2
};

/// Enum /Script/Engine.ESkyAtmosphereTransformMode
/// Size: 0x01 (1 bytes)
enum class ESkyAtmosphereTransformMode : uint8_t
{
	ESkyAtmosphereTransformMode__PlanetTopAtAbsoluteWorldOrigin                      = 0,
	ESkyAtmosphereTransformMode__PlanetTopAtComponentTransform                       = 1,
	ESkyAtmosphereTransformMode__PlanetCenterAtComponentTransform                    = 2
};

/// Enum /Script/Engine.ESkyLightSourceType
/// Size: 0x01 (1 bytes)
enum class ESkyLightSourceType : uint8_t
{
	SLS_CapturedScene                                                                = 0,
	SLS_SpecifiedCubemap                                                             = 1
};

/// Enum /Script/Engine.EPriorityAttenuationMethod
/// Size: 0x01 (1 bytes)
enum class EPriorityAttenuationMethod : uint8_t
{
	EPriorityAttenuationMethod__Linear                                               = 0,
	EPriorityAttenuationMethod__CustomCurve                                          = 1,
	EPriorityAttenuationMethod__Manual                                               = 2
};

/// Enum /Script/Engine.ESubmixSendMethod
/// Size: 0x01 (1 bytes)
enum class ESubmixSendMethod : uint8_t
{
	ESubmixSendMethod__Linear                                                        = 0,
	ESubmixSendMethod__CustomCurve                                                   = 1,
	ESubmixSendMethod__Manual                                                        = 2
};

/// Enum /Script/Engine.EReverbSendMethod
/// Size: 0x01 (1 bytes)
enum class EReverbSendMethod : uint8_t
{
	EReverbSendMethod__Linear                                                        = 0,
	EReverbSendMethod__CustomCurve                                                   = 1,
	EReverbSendMethod__Manual                                                        = 2
};

/// Enum /Script/Engine.EAirAbsorptionMethod
/// Size: 0x01 (1 bytes)
enum class EAirAbsorptionMethod : uint8_t
{
	EAirAbsorptionMethod__Linear                                                     = 0,
	EAirAbsorptionMethod__CustomCurve                                                = 1
};

/// Enum /Script/Engine.ESoundSpatializationAlgorithm
/// Size: 0x01 (1 bytes)
enum class ESoundSpatializationAlgorithm : uint8_t
{
	SPATIALIZATION_Default                                                           = 0,
	SPATIALIZATION_HRTF                                                              = 1
};

/// Enum /Script/Engine.ESoundDistanceCalc
/// Size: 0x01 (1 bytes)
enum class ESoundDistanceCalc : uint8_t
{
	SOUNDDISTANCE_Normal                                                             = 0,
	SOUNDDISTANCE_InfiniteXYPlane                                                    = 1,
	SOUNDDISTANCE_InfiniteXZPlane                                                    = 2,
	SOUNDDISTANCE_InfiniteYZPlane                                                    = 3
};

/// Enum /Script/Engine.EVirtualizationMode
/// Size: 0x01 (1 bytes)
enum class EVirtualizationMode : uint8_t
{
	EVirtualizationMode__Disabled                                                    = 0,
	EVirtualizationMode__PlayWhenSilent                                              = 1,
	EVirtualizationMode__Restart                                                     = 2
};

/// Enum /Script/Engine.EConcurrencyVolumeScaleMode
/// Size: 0x04 (4 bytes)
enum class EConcurrencyVolumeScaleMode : uint32_t
{
	EConcurrencyVolumeScaleMode__Default                                             = 0,
	EConcurrencyVolumeScaleMode__Distance                                            = 1,
	EConcurrencyVolumeScaleMode__Priority                                            = 2
};

/// Enum /Script/Engine.EMaxConcurrentResolutionRule
/// Size: 0x01 (1 bytes)
enum class EMaxConcurrentResolutionRule : uint8_t
{
	EMaxConcurrentResolutionRule__PreventNew                                         = 0,
	EMaxConcurrentResolutionRule__StopOldest                                         = 1,
	EMaxConcurrentResolutionRule__StopFarthestThenPreventNew                         = 2,
	EMaxConcurrentResolutionRule__StopFarthestThenOldest                             = 3,
	EMaxConcurrentResolutionRule__StopLowestPriority                                 = 4,
	EMaxConcurrentResolutionRule__StopQuietest                                       = 5,
	EMaxConcurrentResolutionRule__StopLowestPriorityThenPreventNew                   = 6,
	EMaxConcurrentResolutionRule__Count                                              = 7
};

/// Enum /Script/Engine.ESoundGroup
/// Size: 0x01 (1 bytes)
enum class ESoundGroup : uint8_t
{
	SOUNDGROUP_Default                                                               = 0,
	SOUNDGROUP_Effects                                                               = 1,
	SOUNDGROUP_UI                                                                    = 2,
	SOUNDGROUP_Music                                                                 = 3,
	SOUNDGROUP_Voice                                                                 = 4,
	SOUNDGROUP_GameSoundGroup1                                                       = 5,
	SOUNDGROUP_GameSoundGroup2                                                       = 6,
	SOUNDGROUP_GameSoundGroup3                                                       = 7,
	SOUNDGROUP_GameSoundGroup4                                                       = 8,
	SOUNDGROUP_GameSoundGroup5                                                       = 9,
	SOUNDGROUP_GameSoundGroup6                                                       = 10,
	SOUNDGROUP_GameSoundGroup7                                                       = 11,
	SOUNDGROUP_GameSoundGroup8                                                       = 12,
	SOUNDGROUP_GameSoundGroup9                                                       = 13,
	SOUNDGROUP_GameSoundGroup10                                                      = 14,
	SOUNDGROUP_GameSoundGroup11                                                      = 15,
	SOUNDGROUP_GameSoundGroup12                                                      = 16,
	SOUNDGROUP_GameSoundGroup13                                                      = 17,
	SOUNDGROUP_GameSoundGroup14                                                      = 18,
	SOUNDGROUP_GameSoundGroup15                                                      = 19,
	SOUNDGROUP_GameSoundGroup16                                                      = 20,
	SOUNDGROUP_GameSoundGroup17                                                      = 21,
	SOUNDGROUP_GameSoundGroup18                                                      = 22,
	SOUNDGROUP_GameSoundGroup19                                                      = 23,
	SOUNDGROUP_GameSoundGroup20                                                      = 24
};

/// Enum /Script/Engine.EModulationRouting
/// Size: 0x01 (1 bytes)
enum class EModulationRouting : uint8_t
{
	EModulationRouting__Disable                                                      = 0,
	EModulationRouting__Inherit                                                      = 1,
	EModulationRouting__Override                                                     = 2
};

/// Enum /Script/Engine.ModulationParamMode
/// Size: 0x01 (1 bytes)
enum class ModulationParamMode : uint8_t
{
	MPM_Normal                                                                       = 0,
	MPM_Abs                                                                          = 1,
	MPM_Direct                                                                       = 2
};

/// Enum /Script/Engine.ESourceBusChannels
/// Size: 0x01 (1 bytes)
enum class ESourceBusChannels : uint8_t
{
	ESourceBusChannels__Mono                                                         = 0,
	ESourceBusChannels__Stereo                                                       = 1
};

/// Enum /Script/Engine.ESourceBusSendLevelControlMethod
/// Size: 0x01 (1 bytes)
enum class ESourceBusSendLevelControlMethod : uint8_t
{
	ESourceBusSendLevelControlMethod__Linear                                         = 0,
	ESourceBusSendLevelControlMethod__CustomCurve                                    = 1,
	ESourceBusSendLevelControlMethod__Manual                                         = 2
};

/// Enum /Script/Engine.EGainParamMode
/// Size: 0x01 (1 bytes)
enum class EGainParamMode : uint8_t
{
	EGainParamMode__Linear                                                           = 0,
	EGainParamMode__Decibels                                                         = 1
};

/// Enum /Script/Engine.EAudioSpectrumType
/// Size: 0x01 (1 bytes)
enum class EAudioSpectrumType : uint8_t
{
	EAudioSpectrumType__MagnitudeSpectrum                                            = 0,
	EAudioSpectrumType__PowerSpectrum                                                = 1,
	EAudioSpectrumType__Decibel                                                      = 2
};

/// Enum /Script/Engine.EFFTWindowType
/// Size: 0x01 (1 bytes)
enum class EFFTWindowType : uint8_t
{
	EFFTWindowType__None                                                             = 0,
	EFFTWindowType__Hamming                                                          = 1,
	EFFTWindowType__Hann                                                             = 2,
	EFFTWindowType__Blackman                                                         = 3
};

/// Enum /Script/Engine.EFFTPeakInterpolationMethod
/// Size: 0x01 (1 bytes)
enum class EFFTPeakInterpolationMethod : uint8_t
{
	EFFTPeakInterpolationMethod__NearestNeighbor                                     = 0,
	EFFTPeakInterpolationMethod__Linear                                              = 1,
	EFFTPeakInterpolationMethod__Quadratic                                           = 2,
	EFFTPeakInterpolationMethod__ConstantQ                                           = 3
};

/// Enum /Script/Engine.EFFTSize
/// Size: 0x01 (1 bytes)
enum class EFFTSize : uint8_t
{
	EFFTSize__DefaultSize                                                            = 0,
	EFFTSize__Min                                                                    = 1,
	EFFTSize__Small                                                                  = 2,
	EFFTSize__Medium                                                                 = 3,
	EFFTSize__Large                                                                  = 4,
	EFFTSize__VeryLarge                                                              = 5,
	EFFTSize__Max                                                                    = 6
};

/// Enum /Script/Engine.ESubmixSendStage
/// Size: 0x01 (1 bytes)
enum class ESubmixSendStage : uint8_t
{
	ESubmixSendStage__PostDistanceAttenuation                                        = 0,
	ESubmixSendStage__PreDistanceAttenuation                                         = 1
};

/// Enum /Script/Engine.ESendLevelControlMethod
/// Size: 0x01 (1 bytes)
enum class ESendLevelControlMethod : uint8_t
{
	ESendLevelControlMethod__Linear                                                  = 0,
	ESendLevelControlMethod__CustomCurve                                             = 1,
	ESendLevelControlMethod__Manual                                                  = 2
};

/// Enum /Script/Engine.EAudioRecordingExportType
/// Size: 0x01 (1 bytes)
enum class EAudioRecordingExportType : uint8_t
{
	EAudioRecordingExportType__SoundWave                                             = 0,
	EAudioRecordingExportType__WavFile                                               = 1
};

/// Enum /Script/Engine.EAudioSpectrumBandPresetType
/// Size: 0x01 (1 bytes)
enum class EAudioSpectrumBandPresetType : uint8_t
{
	EAudioSpectrumBandPresetType__KickDrum                                           = 0,
	EAudioSpectrumBandPresetType__SnareDrum                                          = 1,
	EAudioSpectrumBandPresetType__Voice                                              = 2,
	EAudioSpectrumBandPresetType__Cymbals                                            = 3
};

/// Enum /Script/Engine.ESoundWaveFFTSize
/// Size: 0x01 (1 bytes)
enum class ESoundWaveFFTSize : uint8_t
{
	ESoundWaveFFTSize__VerySmall                                                     = 0,
	ESoundWaveFFTSize__Small                                                         = 1,
	ESoundWaveFFTSize__Medium                                                        = 2,
	ESoundWaveFFTSize__Large                                                         = 3,
	ESoundWaveFFTSize__VeryLarge                                                     = 4
};

/// Enum /Script/Engine.EDecompressionType
/// Size: 0x01 (1 bytes)
enum class EDecompressionType : uint8_t
{
	DTYPE_Setup                                                                      = 0,
	DTYPE_Invalid                                                                    = 1,
	DTYPE_Preview                                                                    = 2,
	DTYPE_Native                                                                     = 3,
	DTYPE_RealTime                                                                   = 4,
	DTYPE_Procedural                                                                 = 5,
	DTYPE_Xenon                                                                      = 6,
	DTYPE_Streaming                                                                  = 7
};

/// Enum /Script/Engine.ESoundWaveLoadingBehavior
/// Size: 0x01 (1 bytes)
enum class ESoundWaveLoadingBehavior : uint8_t
{
	ESoundWaveLoadingBehavior__Inherited                                             = 0,
	ESoundWaveLoadingBehavior__RetainOnLoad                                          = 1,
	ESoundWaveLoadingBehavior__PrimeOnLoad                                           = 2,
	ESoundWaveLoadingBehavior__LoadOnDemand                                          = 3,
	ESoundWaveLoadingBehavior__ForceInline                                           = 4,
	ESoundWaveLoadingBehavior__Uninitialized                                         = 255
};

/// Enum /Script/Engine.ESplineCoordinateSpace
/// Size: 0x01 (1 bytes)
enum class ESplineCoordinateSpace : uint8_t
{
	ESplineCoordinateSpace__Local                                                    = 0,
	ESplineCoordinateSpace__World                                                    = 1
};

/// Enum /Script/Engine.ESplinePointType
/// Size: 0x01 (1 bytes)
enum class ESplinePointType : uint8_t
{
	ESplinePointType__Linear                                                         = 0,
	ESplinePointType__Curve                                                          = 1,
	ESplinePointType__Constant                                                       = 2,
	ESplinePointType__CurveClamped                                                   = 3,
	ESplinePointType__CurveCustomTangent                                             = 4
};

/// Enum /Script/Engine.ESplineMeshAxis
/// Size: 0x01 (1 bytes)
enum class ESplineMeshAxis : uint8_t
{
	ESplineMeshAxis__X                                                               = 0,
	ESplineMeshAxis__Y                                                               = 1,
	ESplineMeshAxis__Z                                                               = 2
};

/// Enum /Script/Engine.EOptimizationType
/// Size: 0x01 (1 bytes)
enum class EOptimizationType : uint8_t
{
	OT_NumOfTriangles                                                                = 0,
	OT_MaxDeviation                                                                  = 1
};

/// Enum /Script/Engine.EImportanceLevel
/// Size: 0x01 (1 bytes)
enum class EImportanceLevel : uint8_t
{
	IL_Off                                                                           = 0,
	IL_Lowest                                                                        = 1,
	IL_Low                                                                           = 2,
	IL_Normal                                                                        = 3,
	IL_High                                                                          = 4,
	IL_Highest                                                                       = 5,
	TEMP_BROKEN2                                                                     = 6
};

/// Enum /Script/Engine.ENormalMode
/// Size: 0x01 (1 bytes)
enum class ENormalMode : uint8_t
{
	NM_PreserveSmoothingGroups                                                       = 0,
	NM_RecalculateNormals                                                            = 1,
	NM_RecalculateNormalsSmooth                                                      = 2,
	NM_RecalculateNormalsHard                                                        = 3,
	TEMP_BROKEN                                                                      = 4
};

/// Enum /Script/Engine.EStereoLayerShape
/// Size: 0x01 (1 bytes)
enum class EStereoLayerShape : uint8_t
{
	SLSH_QuadLayer                                                                   = 0,
	SLSH_CylinderLayer                                                               = 1,
	SLSH_CubemapLayer                                                                = 2,
	SLSH_EquirectLayer                                                               = 3
};

/// Enum /Script/Engine.EStereoLayerType
/// Size: 0x01 (1 bytes)
enum class EStereoLayerType : uint8_t
{
	SLT_WorldLocked                                                                  = 0,
	SLT_TrackerLocked                                                                = 1,
	SLT_FaceLocked                                                                   = 2
};

/// Enum /Script/Engine.EOpacitySourceMode
/// Size: 0x01 (1 bytes)
enum class EOpacitySourceMode : uint8_t
{
	OSM_Alpha                                                                        = 0,
	OSM_ColorBrightness                                                              = 1,
	OSM_RedChannel                                                                   = 2,
	OSM_GreenChannel                                                                 = 3,
	OSM_BlueChannel                                                                  = 4
};

/// Enum /Script/Engine.ESubUVBoundingVertexCount
/// Size: 0x01 (1 bytes)
enum class ESubUVBoundingVertexCount : uint8_t
{
	BVC_FourVertices                                                                 = 0,
	BVC_EightVertices                                                                = 1
};

/// Enum /Script/Engine.EVerticalTextAligment
/// Size: 0x01 (1 bytes)
enum class EVerticalTextAligment : uint8_t
{
	EVRTA_TextTop                                                                    = 0,
	EVRTA_TextCenter                                                                 = 1,
	EVRTA_TextBottom                                                                 = 2,
	EVRTA_QuadTop                                                                    = 3
};

/// Enum /Script/Engine.EHorizTextAligment
/// Size: 0x01 (1 bytes)
enum class EHorizTextAligment : uint8_t
{
	EHTA_Left                                                                        = 0,
	EHTA_Center                                                                      = 1,
	EHTA_Right                                                                       = 2
};

/// Enum /Script/Engine.ETextureLossyCompressionAmount
/// Size: 0x01 (1 bytes)
enum class ETextureLossyCompressionAmount : uint8_t
{
	TLCA_Default                                                                     = 0,
	TLCA_None                                                                        = 1,
	TLCA_Lowest                                                                      = 2,
	TLCA_Low                                                                         = 3,
	TLCA_Medium                                                                      = 4,
	TLCA_High                                                                        = 5,
	TLCA_Highest                                                                     = 6
};

/// Enum /Script/Engine.ETextureCompressionQuality
/// Size: 0x01 (1 bytes)
enum class ETextureCompressionQuality : uint8_t
{
	TCQ_Default                                                                      = 0,
	TCQ_Lowest                                                                       = 1,
	TCQ_Low                                                                          = 2,
	TCQ_Medium                                                                       = 3,
	TCQ_High                                                                         = 4,
	TCQ_Highest                                                                      = 5
};

/// Enum /Script/Engine.ETextureSourceFormat
/// Size: 0x01 (1 bytes)
enum class ETextureSourceFormat : uint8_t
{
	TSF_Invalid                                                                      = 0,
	TSF_G8                                                                           = 1,
	TSF_BGRA8                                                                        = 2,
	TSF_BGRE8                                                                        = 3,
	TSF_RGBA16                                                                       = 4,
	TSF_RGBA16F                                                                      = 5,
	TSF_R11G11B10F                                                                   = 6,
	TSF_RGBA8                                                                        = 7,
	TSF_RGBE8                                                                        = 8,
	TSF_G16                                                                          = 9
};

/// Enum /Script/Engine.ETextureSourceArtType
/// Size: 0x01 (1 bytes)
enum class ETextureSourceArtType : uint8_t
{
	TSAT_Uncompressed                                                                = 0,
	TSAT_PNGCompressed                                                               = 1,
	TSAT_DDSFile                                                                     = 2
};

/// Enum /Script/Engine.ETextureMipCount
/// Size: 0x01 (1 bytes)
enum class ETextureMipCount : uint8_t
{
	TMC_ResidentMips                                                                 = 0,
	TMC_AllMips                                                                      = 1,
	TMC_AllMipsBiased                                                                = 2
};

/// Enum /Script/Engine.ECompositeTextureMode
/// Size: 0x01 (1 bytes)
enum class ECompositeTextureMode : uint8_t
{
	CTM_Disabled                                                                     = 0,
	CTM_NormalRoughnessToRed                                                         = 1,
	CTM_NormalRoughnessToGreen                                                       = 2,
	CTM_NormalRoughnessToBlue                                                        = 3,
	CTM_NormalRoughnessToAlpha                                                       = 4
};

/// Enum /Script/Engine.TextureAddress
/// Size: 0x01 (1 bytes)
enum class TextureAddress : uint8_t
{
	TA_Wrap                                                                          = 0,
	TA_Clamp                                                                         = 1,
	TA_Mirror                                                                        = 2
};

/// Enum /Script/Engine.TextureFilter
/// Size: 0x01 (1 bytes)
enum class TextureFilter : uint8_t
{
	TF_Nearest                                                                       = 0,
	TF_Bilinear                                                                      = 1,
	TF_Trilinear                                                                     = 2,
	TF_Default                                                                       = 3
};

/// Enum /Script/Engine.TextureCompressionSettings
/// Size: 0x01 (1 bytes)
enum class TextureCompressionSettings : uint8_t
{
	TC_Default                                                                       = 0,
	TC_Normalmap                                                                     = 1,
	TC_Masks                                                                         = 2,
	TC_Grayscale                                                                     = 3,
	TC_Displacementmap                                                               = 4,
	TC_VectorDisplacementmap                                                         = 5,
	TC_HDR                                                                           = 6,
	TC_EditorIcon                                                                    = 7,
	TC_Alpha                                                                         = 8,
	TC_DistanceFieldFont                                                             = 9,
	TC_HDR_Compressed                                                                = 10,
	TC_BC7                                                                           = 11,
	TC_HalfFloat                                                                     = 12,
	TC_ReflectionCapture                                                             = 13
};

/// Enum /Script/Engine.ETextureDownscaleOptions
/// Size: 0x01 (1 bytes)
enum class ETextureDownscaleOptions : uint8_t
{
	ETextureDownscaleOptions__Default                                                = 0,
	ETextureDownscaleOptions__Unfiltered                                             = 1,
	ETextureDownscaleOptions__SimpleAverage                                          = 2,
	ETextureDownscaleOptions__Sharpen0                                               = 3,
	ETextureDownscaleOptions__Sharpen1                                               = 4,
	ETextureDownscaleOptions__Sharpen2                                               = 5,
	ETextureDownscaleOptions__Sharpen3                                               = 6,
	ETextureDownscaleOptions__Sharpen4                                               = 7,
	ETextureDownscaleOptions__Sharpen5                                               = 8,
	ETextureDownscaleOptions__Sharpen6                                               = 9,
	ETextureDownscaleOptions__Sharpen7                                               = 10,
	ETextureDownscaleOptions__Sharpen8                                               = 11,
	ETextureDownscaleOptions__Sharpen9                                               = 12,
	ETextureDownscaleOptions__Sharpen10                                              = 13,
	ETextureDownscaleOptions__Blur1                                                  = 14,
	ETextureDownscaleOptions__Blur2                                                  = 15,
	ETextureDownscaleOptions__Blur3                                                  = 16,
	ETextureDownscaleOptions__Blur4                                                  = 17,
	ETextureDownscaleOptions__Blur5                                                  = 18
};

/// Enum /Script/Engine.ETextureMipLoadOptions
/// Size: 0x01 (1 bytes)
enum class ETextureMipLoadOptions : uint8_t
{
	ETextureMipLoadOptions__Default                                                  = 0,
	ETextureMipLoadOptions__AllMips                                                  = 1,
	ETextureMipLoadOptions__OnlyFirstMip                                             = 2
};

/// Enum /Script/Engine.ETextureSamplerFilter
/// Size: 0x01 (1 bytes)
enum class ETextureSamplerFilter : uint8_t
{
	ETextureSamplerFilter__Point                                                     = 0,
	ETextureSamplerFilter__Bilinear                                                  = 1,
	ETextureSamplerFilter__Trilinear                                                 = 2,
	ETextureSamplerFilter__AnisotropicPoint                                          = 3,
	ETextureSamplerFilter__AnisotropicLinear                                         = 4
};

/// Enum /Script/Engine.ETexturePowerOfTwoSetting
/// Size: 0x01 (1 bytes)
enum class ETexturePowerOfTwoSetting : uint8_t
{
	ETexturePowerOfTwoSetting__None                                                  = 0,
	ETexturePowerOfTwoSetting__PadToPowerOfTwo                                       = 1,
	ETexturePowerOfTwoSetting__PadToSquarePowerOfTwo                                 = 2,
	ETexturePowerOfTwoSetting__ResizeToPowerOfTwo                                    = 3,
	ETexturePowerOfTwoSetting__ResizeToFitTextureCompression                         = 4
};

/// Enum /Script/Engine.TextureMipGenSettings
/// Size: 0x01 (1 bytes)
enum class TextureMipGenSettings : uint8_t
{
	TMGS_FromTextureGroup                                                            = 0,
	TMGS_SimpleAverage                                                               = 1,
	TMGS_Lanczos                                                                     = 2,
	TMGS_Sharpen0                                                                    = 3,
	TMGS_Sharpen1                                                                    = 4,
	TMGS_Sharpen2                                                                    = 5,
	TMGS_Sharpen3                                                                    = 6,
	TMGS_Sharpen4                                                                    = 7,
	TMGS_Sharpen5                                                                    = 8,
	TMGS_Sharpen6                                                                    = 9,
	TMGS_Sharpen7                                                                    = 10,
	TMGS_Sharpen8                                                                    = 11,
	TMGS_Sharpen9                                                                    = 12,
	TMGS_Sharpen10                                                                   = 13,
	TMGS_NoMipmaps                                                                   = 14,
	TMGS_LeaveExistingMips                                                           = 15,
	TMGS_Blur1                                                                       = 16,
	TMGS_Blur2                                                                       = 17,
	TMGS_Blur3                                                                       = 18,
	TMGS_Blur4                                                                       = 19,
	TMGS_Blur5                                                                       = 20,
	TMGS_Unfiltered                                                                  = 21
};

/// Enum /Script/Engine.TextureGroup
/// Size: 0x01 (1 bytes)
enum class TextureGroup : uint8_t
{
	TEXTUREGROUP_World                                                               = 0,
	TEXTUREGROUP_WorldNormalMap                                                      = 1,
	TEXTUREGROUP_WorldSpecular                                                       = 2,
	TEXTUREGROUP_Character                                                           = 3,
	TEXTUREGROUP_CharacterNormalMap                                                  = 4,
	TEXTUREGROUP_CharacterSpecular                                                   = 5,
	TEXTUREGROUP_Weapon                                                              = 6,
	TEXTUREGROUP_WeaponNormalMap                                                     = 7,
	TEXTUREGROUP_WeaponSpecular                                                      = 8,
	TEXTUREGROUP_Vehicle                                                             = 9,
	TEXTUREGROUP_VehicleNormalMap                                                    = 10,
	TEXTUREGROUP_VehicleSpecular                                                     = 11,
	TEXTUREGROUP_Cinematic                                                           = 12,
	TEXTUREGROUP_Effects                                                             = 13,
	TEXTUREGROUP_EffectsNotFiltered                                                  = 14,
	TEXTUREGROUP_Skybox                                                              = 15,
	TEXTUREGROUP_UI                                                                  = 16,
	TEXTUREGROUP_Lightmap                                                            = 17,
	TEXTUREGROUP_RenderTarget                                                        = 18,
	TEXTUREGROUP_MobileFlattened                                                     = 19,
	TEXTUREGROUP_ProcBuilding_Face                                                   = 20,
	TEXTUREGROUP_ProcBuilding_LightMap                                               = 21,
	TEXTUREGROUP_Shadowmap                                                           = 22,
	TEXTUREGROUP_ColorLookupTable                                                    = 23,
	TEXTUREGROUP_Terrain_Heightmap                                                   = 24,
	TEXTUREGROUP_Terrain_Weightmap                                                   = 25,
	TEXTUREGROUP_Bokeh                                                               = 26,
	TEXTUREGROUP_IESLightProfile                                                     = 27,
	TEXTUREGROUP_Pixels2D                                                            = 28,
	TEXTUREGROUP_HierarchicalLOD                                                     = 29,
	TEXTUREGROUP_Impostor                                                            = 30,
	TEXTUREGROUP_ImpostorNormalDepth                                                 = 31,
	TEXTUREGROUP_8BitData                                                            = 32,
	TEXTUREGROUP_16BitData                                                           = 33,
	TEXTUREGROUP_Project01                                                           = 34,
	TEXTUREGROUP_Project02                                                           = 35,
	TEXTUREGROUP_Project03                                                           = 36,
	TEXTUREGROUP_Project04                                                           = 37,
	TEXTUREGROUP_Project05                                                           = 38,
	TEXTUREGROUP_Project06                                                           = 39,
	TEXTUREGROUP_Project07                                                           = 40,
	TEXTUREGROUP_Project08                                                           = 41,
	TEXTUREGROUP_Project09                                                           = 42,
	TEXTUREGROUP_Project10                                                           = 43,
	TEXTUREGROUP_Project11                                                           = 44,
	TEXTUREGROUP_Project12                                                           = 45,
	TEXTUREGROUP_Project13                                                           = 46,
	TEXTUREGROUP_Project14                                                           = 47,
	TEXTUREGROUP_Project15                                                           = 48
};

/// Enum /Script/Engine.ETextureRenderTargetFormat
/// Size: 0x01 (1 bytes)
enum class ETextureRenderTargetFormat : uint8_t
{
	RTF_R8                                                                           = 0,
	RTF_RG8                                                                          = 1,
	RTF_RGBA8                                                                        = 2,
	RTF_RGBA8_SRGB                                                                   = 3,
	RTF_R16f                                                                         = 4,
	RTF_RG16f                                                                        = 5,
	RTF_RGBA16f                                                                      = 6,
	RTF_R32f                                                                         = 7,
	RTF_RG32f                                                                        = 8,
	RTF_RGBA32f                                                                      = 9,
	RTF_RGB10A2                                                                      = 10
};

/// Enum /Script/Engine.ETimecodeProviderSynchronizationState
/// Size: 0x01 (1 bytes)
enum class ETimecodeProviderSynchronizationState : uint8_t
{
	ETimecodeProviderSynchronizationState__Closed                                    = 0,
	ETimecodeProviderSynchronizationState__Error                                     = 1,
	ETimecodeProviderSynchronizationState__Synchronized                              = 2,
	ETimecodeProviderSynchronizationState__Synchronizing                             = 3
};

/// Enum /Script/Engine.ETimelineDirection
/// Size: 0x01 (1 bytes)
enum class ETimelineDirection : uint8_t
{
	ETimelineDirection__Forward                                                      = 0,
	ETimelineDirection__Backward                                                     = 1
};

/// Enum /Script/Engine.ETimelineLengthMode
/// Size: 0x01 (1 bytes)
enum class ETimelineLengthMode : uint8_t
{
	TL_TimelineLength                                                                = 0,
	TL_LastKeyFrame                                                                  = 1
};

/// Enum /Script/Engine.ETimeStretchCurveMapping
/// Size: 0x01 (1 bytes)
enum class ETimeStretchCurveMapping : uint8_t
{
	ETimeStretchCurveMapping__T_Original                                             = 0,
	ETimeStretchCurveMapping__T_TargetMin                                            = 1,
	ETimeStretchCurveMapping__T_TargetMax                                            = 2
};

/// Enum /Script/Engine.ETwitterIntegrationDelegate
/// Size: 0x01 (1 bytes)
enum class ETwitterIntegrationDelegate : uint8_t
{
	TID_AuthorizeComplete                                                            = 0,
	TID_TweetUIComplete                                                              = 1,
	TID_RequestComplete                                                              = 2
};

/// Enum /Script/Engine.ETwitterRequestMethod
/// Size: 0x01 (1 bytes)
enum class ETwitterRequestMethod : uint8_t
{
	TRM_Get                                                                          = 0,
	TRM_Post                                                                         = 1,
	TRM_Delete                                                                       = 2
};

/// Enum /Script/Engine.EUserDefinedStructureStatus
/// Size: 0x01 (1 bytes)
enum class EUserDefinedStructureStatus : uint8_t
{
	UDSS_UpToDate                                                                    = 0,
	UDSS_Dirty                                                                       = 1,
	UDSS_Error                                                                       = 2,
	UDSS_Duplicate                                                                   = 3
};

/// Enum /Script/Engine.EUIScalingRule
/// Size: 0x01 (1 bytes)
enum class EUIScalingRule : uint8_t
{
	EUIScalingRule__ShortestSide                                                     = 0,
	EUIScalingRule__LongestSide                                                      = 1,
	EUIScalingRule__Horizontal                                                       = 2,
	EUIScalingRule__Vertical                                                         = 3,
	EUIScalingRule__ScaleToFit                                                       = 4,
	EUIScalingRule__Custom                                                           = 5
};

/// Enum /Script/Engine.ERenderFocusRule
/// Size: 0x01 (1 bytes)
enum class ERenderFocusRule : uint8_t
{
	ERenderFocusRule__Always                                                         = 0,
	ERenderFocusRule__NonPointer                                                     = 1,
	ERenderFocusRule__NavigationOnly                                                 = 2,
	ERenderFocusRule__Never                                                          = 3
};

/// Enum /Script/Engine.EVectorFieldConstructionOp
/// Size: 0x01 (1 bytes)
enum class EVectorFieldConstructionOp : uint8_t
{
	VFCO_Extrude                                                                     = 0,
	VFCO_Revolve                                                                     = 1
};

/// Enum /Script/Engine.EWindSourceType
/// Size: 0x01 (1 bytes)
enum class EWindSourceType : uint8_t
{
	EWindSourceType__Directional                                                     = 0,
	EWindSourceType__Point                                                           = 1
};

/// Enum /Script/Engine.EPSCPoolMethod
/// Size: 0x01 (1 bytes)
enum class EPSCPoolMethod : uint8_t
{
	EPSCPoolMethod__None                                                             = 0,
	EPSCPoolMethod__AutoRelease                                                      = 1,
	EPSCPoolMethod__ManualRelease                                                    = 2,
	EPSCPoolMethod__ManualRelease_OnComplete                                         = 3,
	EPSCPoolMethod__FreeInPool                                                       = 4
};

/// Enum /Script/Engine.EVolumeLightingMethod
/// Size: 0x01 (1 bytes)
enum class EVolumeLightingMethod : uint8_t
{
	VLM_VolumetricLightmap                                                           = 0,
	VLM_SparseVolumeLightingSamples                                                  = 1
};

/// Enum /Script/Engine.EVisibilityAggressiveness
/// Size: 0x01 (1 bytes)
enum class EVisibilityAggressiveness : uint8_t
{
	VIS_LeastAggressive                                                              = 0,
	VIS_ModeratelyAggressive                                                         = 1,
	VIS_MostAggressive                                                               = 2,
	VIS_Max                                                                          = 3
};

/// Enum /Script/UMG.ESlateAccessibleBehavior
/// Size: 0x01 (1 bytes)
enum class ESlateAccessibleBehavior : uint8_t
{
	ESlateAccessibleBehavior__NotAccessible                                          = 0,
	ESlateAccessibleBehavior__Auto                                                   = 1,
	ESlateAccessibleBehavior__Summary                                                = 2,
	ESlateAccessibleBehavior__Custom                                                 = 3,
	ESlateAccessibleBehavior__ToolTip                                                = 4
};

/// Enum /Script/UMG.ESlateVisibility
/// Size: 0x01 (1 bytes)
enum class ESlateVisibility : uint8_t
{
	ESlateVisibility__Visible                                                        = 0,
	ESlateVisibility__Collapsed                                                      = 1,
	ESlateVisibility__Hidden                                                         = 2,
	ESlateVisibility__HitTestInvisible                                               = 3,
	ESlateVisibility__SelfHitTestInvisible                                           = 4
};

/// Enum /Script/UMG.EWidgetVertexEffectType
/// Size: 0x01 (1 bytes)
enum class EWidgetVertexEffectType : uint8_t
{
	EWidgetVertexEffectType__Default                                                 = 0,
	EWidgetVertexEffectType__PerspectX                                               = 1,
	EWidgetVertexEffectType__PerspectY                                               = 2
};

/// Enum /Script/UMG.EVirtualKeyboardType
/// Size: 0x01 (1 bytes)
enum class EVirtualKeyboardType : uint8_t
{
	EVirtualKeyboardType__Default                                                    = 0,
	EVirtualKeyboardType__Number                                                     = 1,
	EVirtualKeyboardType__Web                                                        = 2,
	EVirtualKeyboardType__Email                                                      = 3,
	EVirtualKeyboardType__Password                                                   = 4,
	EVirtualKeyboardType__AlphaNumeric                                               = 5
};

/// Enum /Script/UMG.EDragPivot
/// Size: 0x01 (1 bytes)
enum class EDragPivot : uint8_t
{
	EDragPivot__MouseDown                                                            = 0,
	EDragPivot__TopLeft                                                              = 1,
	EDragPivot__TopCenter                                                            = 2,
	EDragPivot__TopRight                                                             = 3,
	EDragPivot__CenterLeft                                                           = 4,
	EDragPivot__CenterCenter                                                         = 5,
	EDragPivot__CenterRight                                                          = 6,
	EDragPivot__BottomLeft                                                           = 7,
	EDragPivot__BottomCenter                                                         = 8,
	EDragPivot__BottomRight                                                          = 9
};

/// Enum /Script/UMG.EDynamicBoxType
/// Size: 0x01 (1 bytes)
enum class EDynamicBoxType : uint8_t
{
	EDynamicBoxType__Horizontal                                                      = 0,
	EDynamicBoxType__Vertical                                                        = 1,
	EDynamicBoxType__Wrap                                                            = 2,
	EDynamicBoxType__VerticalWrap                                                    = 3,
	EDynamicBoxType__Radial                                                          = 4,
	EDynamicBoxType__Overlay                                                         = 5
};

/// Enum /Script/UMG.ESlateSizeRule
/// Size: 0x01 (1 bytes)
enum class ESlateSizeRule : uint8_t
{
	ESlateSizeRule__Automatic                                                        = 0,
	ESlateSizeRule__Fill                                                             = 1
};

/// Enum /Script/UMG.EUMGSequencePlayMode
/// Size: 0x01 (1 bytes)
enum class EUMGSequencePlayMode : uint8_t
{
	EUMGSequencePlayMode__Forward                                                    = 0,
	EUMGSequencePlayMode__Reverse                                                    = 1,
	EUMGSequencePlayMode__PingPong                                                   = 2
};

/// Enum /Script/UMG.EWidgetAnimationEvent
/// Size: 0x01 (1 bytes)
enum class EWidgetAnimationEvent : uint8_t
{
	EWidgetAnimationEvent__Started                                                   = 0,
	EWidgetAnimationEvent__Finished                                                  = 1
};

/// Enum /Script/UMG.EWidgetTickFrequency
/// Size: 0x01 (1 bytes)
enum class EWidgetTickFrequency : uint8_t
{
	EWidgetTickFrequency__Never                                                      = 0,
	EWidgetTickFrequency__Auto                                                       = 1
};

/// Enum /Script/UMG.EWidgetDesignFlags
/// Size: 0x01 (1 bytes)
enum class EWidgetDesignFlags : uint8_t
{
	EWidgetDesignFlags__None                                                         = 0,
	EWidgetDesignFlags__Designing                                                    = 1,
	EWidgetDesignFlags__ShowOutline                                                  = 2,
	EWidgetDesignFlags__ExecutePreConstruct                                          = 4
};

/// Enum /Script/UMG.EBindingKind
/// Size: 0x01 (1 bytes)
enum class EBindingKind : uint8_t
{
	EBindingKind__Function                                                           = 0,
	EBindingKind__Property                                                           = 1
};

/// Enum /Script/UMG.ETickMode
/// Size: 0x01 (1 bytes)
enum class ETickMode : uint8_t
{
	ETickMode__Disabled                                                              = 0,
	ETickMode__Enabled                                                               = 1,
	ETickMode__Automatic                                                             = 2
};

/// Enum /Script/UMG.EWindowVisibility
/// Size: 0x01 (1 bytes)
enum class EWindowVisibility : uint8_t
{
	EWindowVisibility__Visible                                                       = 0,
	EWindowVisibility__SelfHitTestInvisible                                          = 1
};

/// Enum /Script/UMG.EWidgetGeometryMode
/// Size: 0x01 (1 bytes)
enum class EWidgetGeometryMode : uint8_t
{
	EWidgetGeometryMode__Plane                                                       = 0,
	EWidgetGeometryMode__Cylinder                                                    = 1
};

/// Enum /Script/UMG.EWidgetBlendMode
/// Size: 0x01 (1 bytes)
enum class EWidgetBlendMode : uint8_t
{
	EWidgetBlendMode__Opaque                                                         = 0,
	EWidgetBlendMode__Masked                                                         = 1,
	EWidgetBlendMode__Transparent                                                    = 2
};

/// Enum /Script/UMG.EWidgetTimingPolicy
/// Size: 0x01 (1 bytes)
enum class EWidgetTimingPolicy : uint8_t
{
	EWidgetTimingPolicy__RealTime                                                    = 0,
	EWidgetTimingPolicy__GameTime                                                    = 1
};

/// Enum /Script/UMG.EWidgetSpace
/// Size: 0x01 (1 bytes)
enum class EWidgetSpace : uint8_t
{
	EWidgetSpace__World                                                              = 0,
	EWidgetSpace__Screen                                                             = 1
};

/// Enum /Script/UMG.EWidgetInteractionSource
/// Size: 0x01 (1 bytes)
enum class EWidgetInteractionSource : uint8_t
{
	EWidgetInteractionSource__World                                                  = 0,
	EWidgetInteractionSource__Mouse                                                  = 1,
	EWidgetInteractionSource__CenterScreen                                           = 2,
	EWidgetInteractionSource__Custom                                                 = 3
};

/// Enum /Script/MovieScene.EMovieSceneKeyInterpolation
/// Size: 0x01 (1 bytes)
enum class EMovieSceneKeyInterpolation : uint8_t
{
	EMovieSceneKeyInterpolation__Auto                                                = 0,
	EMovieSceneKeyInterpolation__User                                                = 1,
	EMovieSceneKeyInterpolation__Break                                               = 2,
	EMovieSceneKeyInterpolation__Linear                                              = 3,
	EMovieSceneKeyInterpolation__Constant                                            = 4
};

/// Enum /Script/MovieScene.EMovieSceneBlendType
/// Size: 0x01 (1 bytes)
enum class EMovieSceneBlendType : uint8_t
{
	EMovieSceneBlendType__Invalid                                                    = 0,
	EMovieSceneBlendType__Absolute                                                   = 1,
	EMovieSceneBlendType__Additive                                                   = 2,
	EMovieSceneBlendType__Relative                                                   = 4,
	EMovieSceneBlendType__AdditiveFromBase                                           = 8
};

/// Enum /Script/MovieScene.EMovieSceneCompletionMode
/// Size: 0x01 (1 bytes)
enum class EMovieSceneCompletionMode : uint8_t
{
	EMovieSceneCompletionMode__KeepState                                             = 0,
	EMovieSceneCompletionMode__RestoreState                                          = 1,
	EMovieSceneCompletionMode__ProjectDefault                                        = 2
};

/// Enum /Script/MovieScene.EMovieSceneBuiltInEasing
/// Size: 0x01 (1 bytes)
enum class EMovieSceneBuiltInEasing : uint8_t
{
	EMovieSceneBuiltInEasing__Linear                                                 = 0,
	EMovieSceneBuiltInEasing__SinIn                                                  = 1,
	EMovieSceneBuiltInEasing__SinOut                                                 = 2,
	EMovieSceneBuiltInEasing__SinInOut                                               = 3,
	EMovieSceneBuiltInEasing__QuadIn                                                 = 4,
	EMovieSceneBuiltInEasing__QuadOut                                                = 5,
	EMovieSceneBuiltInEasing__QuadInOut                                              = 6,
	EMovieSceneBuiltInEasing__CubicIn                                                = 7,
	EMovieSceneBuiltInEasing__CubicOut                                               = 8,
	EMovieSceneBuiltInEasing__CubicInOut                                             = 9,
	EMovieSceneBuiltInEasing__QuartIn                                                = 10,
	EMovieSceneBuiltInEasing__QuartOut                                               = 11,
	EMovieSceneBuiltInEasing__QuartInOut                                             = 12,
	EMovieSceneBuiltInEasing__QuintIn                                                = 13,
	EMovieSceneBuiltInEasing__QuintOut                                               = 14,
	EMovieSceneBuiltInEasing__QuintInOut                                             = 15,
	EMovieSceneBuiltInEasing__ExpoIn                                                 = 16,
	EMovieSceneBuiltInEasing__ExpoOut                                                = 17,
	EMovieSceneBuiltInEasing__ExpoInOut                                              = 18,
	EMovieSceneBuiltInEasing__CircIn                                                 = 19,
	EMovieSceneBuiltInEasing__CircOut                                                = 20,
	EMovieSceneBuiltInEasing__CircInOut                                              = 21
};

/// Enum /Script/MovieScene.EEvaluationMethod
/// Size: 0x01 (1 bytes)
enum class EEvaluationMethod : uint8_t
{
	EEvaluationMethod__Static                                                        = 0,
	EEvaluationMethod__Swept                                                         = 1
};

/// Enum /Script/MovieScene.EMovieSceneSequenceFlags
/// Size: 0x01 (1 bytes)
enum class EMovieSceneSequenceFlags : uint8_t
{
	EMovieSceneSequenceFlags__None                                                   = 0,
	EMovieSceneSequenceFlags__Volatile                                               = 1,
	EMovieSceneSequenceFlags__BlockingEvaluation                                     = 2,
	EMovieSceneSequenceFlags__InheritedFlags                                         = 1
};

/// Enum /Script/MovieScene.EUpdateClockSource
/// Size: 0x01 (1 bytes)
enum class EUpdateClockSource : uint8_t
{
	EUpdateClockSource__Tick                                                         = 0,
	EUpdateClockSource__Platform                                                     = 1,
	EUpdateClockSource__Audio                                                        = 2,
	EUpdateClockSource__RelativeTimecode                                             = 3,
	EUpdateClockSource__Timecode                                                     = 4,
	EUpdateClockSource__Custom                                                       = 5
};

/// Enum /Script/MovieScene.EMovieSceneEvaluationType
/// Size: 0x01 (1 bytes)
enum class EMovieSceneEvaluationType : uint8_t
{
	EMovieSceneEvaluationType__FrameLocked                                           = 0,
	EMovieSceneEvaluationType__WithSubFrames                                         = 1
};

/// Enum /Script/MovieScene.EMovieScenePlayerStatus
/// Size: 0x01 (1 bytes)
enum class EMovieScenePlayerStatus : uint8_t
{
	EMovieScenePlayerStatus__Stopped                                                 = 0,
	EMovieScenePlayerStatus__Playing                                                 = 1,
	EMovieScenePlayerStatus__Recording                                               = 2,
	EMovieScenePlayerStatus__Scrubbing                                               = 3,
	EMovieScenePlayerStatus__Jumping                                                 = 4,
	EMovieScenePlayerStatus__Stepping                                                = 5,
	EMovieScenePlayerStatus__Paused                                                  = 6
};

/// Enum /Script/MovieScene.EMovieSceneObjectBindingSpace
/// Size: 0x01 (1 bytes)
enum class EMovieSceneObjectBindingSpace : uint8_t
{
	EMovieSceneObjectBindingSpace__Local                                             = 0,
	EMovieSceneObjectBindingSpace__Root                                              = 1
};

/// Enum /Script/MovieScene.ESectionEvaluationFlags
/// Size: 0x01 (1 bytes)
enum class ESectionEvaluationFlags : uint8_t
{
	ESectionEvaluationFlags__None                                                    = 0,
	ESectionEvaluationFlags__PreRoll                                                 = 1,
	ESectionEvaluationFlags__PostRoll                                                = 2
};

/// Enum /Script/MovieScene.EMovieScenePositionType
/// Size: 0x01 (1 bytes)
enum class EMovieScenePositionType : uint8_t
{
	EMovieScenePositionType__Frame                                                   = 0,
	EMovieScenePositionType__Time                                                    = 1,
	EMovieScenePositionType__MarkedFrame                                             = 2
};

/// Enum /Script/MovieScene.EUpdatePositionMethod
/// Size: 0x01 (1 bytes)
enum class EUpdatePositionMethod : uint8_t
{
	EUpdatePositionMethod__Play                                                      = 0,
	EUpdatePositionMethod__Jump                                                      = 1,
	EUpdatePositionMethod__Scrub                                                     = 2
};

/// Enum /Script/MovieScene.ESpawnOwnership
/// Size: 0x01 (1 bytes)
enum class ESpawnOwnership : uint8_t
{
	ESpawnOwnership__InnerSequence                                                   = 0,
	ESpawnOwnership__MasterSequence                                                  = 1,
	ESpawnOwnership__External                                                        = 2
};

/// Enum /Script/MovieSceneTracks.MovieScene3DPathSection_Axis
/// Size: 0x01 (1 bytes)
enum class MovieScene3DPathSection_Axis : uint8_t
{
	MovieScene3DPathSection_Axis__X                                                  = 0,
	MovieScene3DPathSection_Axis__Y                                                  = 1,
	MovieScene3DPathSection_Axis__Z                                                  = 2,
	MovieScene3DPathSection_Axis__NEG_X                                              = 3,
	MovieScene3DPathSection_Axis__NEG_Y                                              = 4,
	MovieScene3DPathSection_Axis__NEG_Z                                              = 5
};

/// Enum /Script/MovieSceneTracks.EFireEventsAtPosition
/// Size: 0x01 (1 bytes)
enum class EFireEventsAtPosition : uint8_t
{
	EFireEventsAtPosition__AtStartOfEvaluation                                       = 0,
	EFireEventsAtPosition__AtEndOfEvaluation                                         = 1,
	EFireEventsAtPosition__AfterSpawn                                                = 2
};

/// Enum /Script/MovieSceneTracks.ELevelVisibility
/// Size: 0x01 (1 bytes)
enum class ELevelVisibility : uint8_t
{
	ELevelVisibility__Visible                                                        = 0,
	ELevelVisibility__Hidden                                                         = 1
};

/// Enum /Script/MovieSceneTracks.EParticleKey
/// Size: 0x01 (1 bytes)
enum class EParticleKey : uint8_t
{
	EParticleKey__Activate                                                           = 0,
	EParticleKey__Deactivate                                                         = 1,
	EParticleKey__Trigger                                                            = 2
};

#pragma pack(pop)


static_assert(sizeof(FTickFunction) == 0x0028); // 40 bytes (0x000000 - 0x000028)
static_assert(sizeof(FActorComponentTickFunction) == 0x0030); // 48 bytes (0x000028 - 0x000030)
static_assert(sizeof(FSimpleMemberReference) == 0x0020); // 32 bytes (0x000000 - 0x000020)
static_assert(sizeof(UActorComponent) == 0x00B0); // 176 bytes (0x000028 - 0x0000B0)
static_assert(sizeof(USceneComponent) == 0x01F8); // 504 bytes (0x0000B0 - 0x0001F8)
static_assert(sizeof(FKeyHandleMap) == 0x0060); // 96 bytes (0x000000 - 0x000060)
static_assert(sizeof(FIndexedCurve) == 0x0068); // 104 bytes (0x000000 - 0x000068)
static_assert(sizeof(FRealCurve) == 0x0070); // 112 bytes (0x000068 - 0x000070)
static_assert(sizeof(FRichCurveKey) == 0x001C); // 28 bytes (0x000000 - 0x00001C)
static_assert(sizeof(FRichCurve) == 0x0080); // 128 bytes (0x000070 - 0x000080)
static_assert(sizeof(FRuntimeFloatCurve) == 0x0088); // 136 bytes (0x000000 - 0x000088)
static_assert(sizeof(FBaseAttenuationSettings) == 0x00B0); // 176 bytes (0x000000 - 0x0000B0)
static_assert(sizeof(FAttenuationSubmixSendSettings) == 0x00A8); // 168 bytes (0x000000 - 0x0000A8)
static_assert(sizeof(FSoundAttenuationPluginSettings) == 0x0030); // 48 bytes (0x000000 - 0x000030)
static_assert(sizeof(FSoundAttenuationSettings) == 0x03A0); // 928 bytes (0x0000B0 - 0x0003A0)
static_assert(sizeof(FSoundSubmixSendInfo) == 0x00B0); // 176 bytes (0x000000 - 0x0000B0)
static_assert(sizeof(FSoundSourceBusSendInfo) == 0x00B8); // 184 bytes (0x000000 - 0x0000B8)
static_assert(sizeof(USynthComponent) == 0x06C0); // 1728 bytes (0x0001F8 - 0x0006C0)
static_assert(sizeof(UAudioGenerator) == 0x00A8); // 168 bytes (0x000028 - 0x0000A8)
static_assert(sizeof(UBlueprintFunctionLibrary) == 0x0028); // 40 bytes (0x000028 - 0x000028)
static_assert(sizeof(UAudioMixerBlueprintLibrary) == 0x0028); // 40 bytes (0x000028 - 0x000028)
static_assert(sizeof(UQuartzClockHandle) == 0x0190); // 400 bytes (0x000028 - 0x000190)
static_assert(sizeof(USoundEffectPreset) == 0x0068); // 104 bytes (0x000028 - 0x000068)
static_assert(sizeof(USoundEffectSubmixPreset) == 0x0068); // 104 bytes (0x000068 - 0x000068)
static_assert(sizeof(FSubmixEffectDynamicProcessorFilterSettings) == 0x000C); // 12 bytes (0x000000 - 0x00000C)
static_assert(sizeof(FSubmixEffectDynamicsProcessorSettings) == 0x0050); // 80 bytes (0x000000 - 0x000050)
static_assert(sizeof(USubmixEffectDynamicsProcessorPreset) == 0x0130); // 304 bytes (0x000068 - 0x000130)
static_assert(sizeof(FSubmixEffectEQBand) == 0x0010); // 16 bytes (0x000000 - 0x000010)
static_assert(sizeof(FSubmixEffectSubmixEQSettings) == 0x0010); // 16 bytes (0x000000 - 0x000010)
static_assert(sizeof(USubmixEffectSubmixEQPreset) == 0x00B0); // 176 bytes (0x000068 - 0x0000B0)
static_assert(sizeof(FSubmixEffectReverbSettings) == 0x0040); // 64 bytes (0x000000 - 0x000040)
static_assert(sizeof(USubmixEffectReverbPreset) == 0x0110); // 272 bytes (0x000068 - 0x000110)
static_assert(sizeof(USubsystem) == 0x0030); // 48 bytes (0x000028 - 0x000030)
static_assert(sizeof(UWorldSubsystem) == 0x0030); // 48 bytes (0x000030 - 0x000030)
static_assert(sizeof(UQuartzSubsystem) == 0x0080); // 128 bytes (0x000030 - 0x000080)
static_assert(sizeof(FSoundConcurrencySettings) == 0x0028); // 40 bytes (0x000000 - 0x000028)
static_assert(sizeof(FSoundModulationDestinationSettings) == 0x0010); // 16 bytes (0x000000 - 0x000010)
static_assert(sizeof(FSoundModulationDefaultSettings) == 0x0040); // 64 bytes (0x000000 - 0x000040)
static_assert(sizeof(FSoundModulationDefaultRoutingSettings) == 0x0048); // 72 bytes (0x000040 - 0x000048)
static_assert(sizeof(USoundBase) == 0x01B8); // 440 bytes (0x000028 - 0x0001B8)
static_assert(sizeof(FSoundWaveSpectralDataEntry) == 0x0008); // 8 bytes (0x000000 - 0x000008)
static_assert(sizeof(FSoundWaveSpectralTimeData) == 0x0018); // 24 bytes (0x000000 - 0x000018)
static_assert(sizeof(FSoundWaveEnvelopeTimeData) == 0x0008); // 8 bytes (0x000000 - 0x000008)
static_assert(sizeof(FSubtitleCue) == 0x0020); // 32 bytes (0x000000 - 0x000020)
static_assert(sizeof(USoundWave) == 0x0370); // 880 bytes (0x0001B8 - 0x000370)
static_assert(sizeof(USoundWaveProcedural) == 0x03C0); // 960 bytes (0x000370 - 0x0003C0)
static_assert(sizeof(USynthSound) == 0x03E0); // 992 bytes (0x0003C0 - 0x0003E0)
static_assert(sizeof(UDataAsset) == 0x0030); // 48 bytes (0x000028 - 0x000030)
static_assert(sizeof(FActorTickFunction) == 0x0030); // 48 bytes (0x000028 - 0x000030)
static_assert(sizeof(FRepMovement) == 0x0034); // 52 bytes (0x000000 - 0x000034)
static_assert(sizeof(FVector_NetQuantize100) == 0x000C); // 12 bytes (0x00000C - 0x00000C)
static_assert(sizeof(FRepAttachment) == 0x0040); // 64 bytes (0x000000 - 0x000040)
static_assert(sizeof(AActor) == 0x0220); // 544 bytes (0x000028 - 0x000220)
static_assert(sizeof(FGeomSelection) == 0x000C); // 12 bytes (0x000000 - 0x00000C)
static_assert(sizeof(ABrush) == 0x0258); // 600 bytes (0x000220 - 0x000258)
static_assert(sizeof(AVolume) == 0x0258); // 600 bytes (0x000258 - 0x000258)
static_assert(sizeof(FLightingChannels) == 0x0001); // 1 bytes (0x000000 - 0x000001)
static_assert(sizeof(FCustomPrimitiveData) == 0x0010); // 16 bytes (0x000000 - 0x000010)
static_assert(sizeof(FCollisionResponseContainer) == 0x0020); // 32 bytes (0x000000 - 0x000020)
static_assert(sizeof(FResponseChannel) == 0x000C); // 12 bytes (0x000000 - 0x00000C)
static_assert(sizeof(FCollisionResponse) == 0x0030); // 48 bytes (0x000000 - 0x000030)
static_assert(sizeof(FWalkableSlopeOverride) == 0x0010); // 16 bytes (0x000000 - 0x000010)
static_assert(sizeof(FBodyInstance) == 0x0158); // 344 bytes (0x000018 - 0x000158)
static_assert(sizeof(UPrimitiveComponent) == 0x0468); // 1128 bytes (0x0001F8 - 0x000468)
static_assert(sizeof(FStreamingLevelsToConsider) == 0x0028); // 40 bytes (0x000000 - 0x000028)
static_assert(sizeof(FLevelCollection) == 0x0078); // 120 bytes (0x000000 - 0x000078)
static_assert(sizeof(FPSCPoolElem) == 0x0010); // 16 bytes (0x000000 - 0x000010)
static_assert(sizeof(FPSCPool) == 0x0038); // 56 bytes (0x000000 - 0x000038)
static_assert(sizeof(FWorldPSCPool) == 0x0058); // 88 bytes (0x000000 - 0x000058)
static_assert(sizeof(UWorld) == 0x0788); // 1928 bytes (0x000028 - 0x000788)
static_assert(sizeof(UAnimNotify) == 0x0038); // 56 bytes (0x000028 - 0x000038)
static_assert(sizeof(UBlueprintAsyncActionBase) == 0x0030); // 48 bytes (0x000028 - 0x000030)
static_assert(sizeof(UPrimaryDataAsset) == 0x0030); // 48 bytes (0x000030 - 0x000030)
static_assert(sizeof(UAssetManager) == 0x0458); // 1112 bytes (0x000028 - 0x000458)
static_assert(sizeof(UMeshComponent) == 0x0490); // 1168 bytes (0x000468 - 0x000490)
static_assert(sizeof(FVertexOffsetUsage) == 0x0004); // 4 bytes (0x000000 - 0x000004)
static_assert(sizeof(FSkelMeshComponentLODInfo) == 0x0048); // 72 bytes (0x000000 - 0x000048)
static_assert(sizeof(USkinnedMeshComponent) == 0x06C0); // 1728 bytes (0x000490 - 0x0006C0)
static_assert(sizeof(UStreamableRenderAsset) == 0x0060); // 96 bytes (0x000028 - 0x000060)
static_assert(sizeof(FMeshUVChannelInfo) == 0x0014); // 20 bytes (0x000000 - 0x000014)
static_assert(sizeof(FSkeletalMaterial) == 0x0028); // 40 bytes (0x000000 - 0x000028)
static_assert(sizeof(FBoneMirrorInfo) == 0x0008); // 8 bytes (0x000000 - 0x000008)
static_assert(sizeof(FPerPlatformFloat) == 0x0004); // 4 bytes (0x000000 - 0x000004)
static_assert(sizeof(FSkeletalMeshBuildSettings) == 0x0014); // 20 bytes (0x000000 - 0x000014)
static_assert(sizeof(FSkeletalMeshOptimizationSettings) == 0x003C); // 60 bytes (0x000000 - 0x00003C)
static_assert(sizeof(FBoneReference) == 0x0010); // 16 bytes (0x000000 - 0x000010)
static_assert(sizeof(FSkeletalMeshLODInfo) == 0x00C8); // 200 bytes (0x000000 - 0x0000C8)
static_assert(sizeof(FPerPlatformInt) == 0x0004); // 4 bytes (0x000000 - 0x000004)
static_assert(sizeof(FPerPlatformBool) == 0x0001); // 1 bytes (0x000000 - 0x000001)
static_assert(sizeof(FSkeletalMeshSamplingRegionMaterialFilter) == 0x0008); // 8 bytes (0x000000 - 0x000008)
static_assert(sizeof(FSkeletalMeshSamplingRegionBoneFilter) == 0x000C); // 12 bytes (0x000000 - 0x00000C)
static_assert(sizeof(FSkeletalMeshSamplingRegion) == 0x0030); // 48 bytes (0x000000 - 0x000030)
static_assert(sizeof(FSkeletalMeshSamplingLODBuiltData) == 0x0048); // 72 bytes (0x000000 - 0x000048)
static_assert(sizeof(FSkeletalMeshSamplingRegionBuiltData) == 0x0078); // 120 bytes (0x000000 - 0x000078)
static_assert(sizeof(FSkeletalMeshSamplingBuiltData) == 0x0020); // 32 bytes (0x000000 - 0x000020)
static_assert(sizeof(FSkeletalMeshSamplingInfo) == 0x0030); // 48 bytes (0x000000 - 0x000030)
static_assert(sizeof(FSkinWeightProfileInfo) == 0x0010); // 16 bytes (0x000000 - 0x000010)
static_assert(sizeof(USkeletalMesh) == 0x03A8); // 936 bytes (0x000060 - 0x0003A8)
static_assert(sizeof(FTouchInputControl) == 0x0068); // 104 bytes (0x000000 - 0x000068)
static_assert(sizeof(UTouchInterface) == 0x0058); // 88 bytes (0x000028 - 0x000058)
static_assert(sizeof(FStatColorMapEntry) == 0x0008); // 8 bytes (0x000000 - 0x000008)
static_assert(sizeof(FStatColorMapping) == 0x0028); // 40 bytes (0x000000 - 0x000028)
static_assert(sizeof(FGameNameRedirect) == 0x0010); // 16 bytes (0x000000 - 0x000010)
static_assert(sizeof(FClassRedirect) == 0x003C); // 60 bytes (0x000000 - 0x00003C)
static_assert(sizeof(FPluginRedirect) == 0x0020); // 32 bytes (0x000000 - 0x000020)
static_assert(sizeof(FStructRedirect) == 0x0010); // 16 bytes (0x000000 - 0x000010)
static_assert(sizeof(FDirectoryPath) == 0x0010); // 16 bytes (0x000000 - 0x000010)
static_assert(sizeof(FDropNoteInfo) == 0x0028); // 40 bytes (0x000000 - 0x000028)
static_assert(sizeof(FNetDriverDefinition) == 0x0018); // 24 bytes (0x000000 - 0x000018)
static_assert(sizeof(UEngine) == 0x0DE0); // 3552 bytes (0x000028 - 0x000DE0)
static_assert(sizeof(UScriptViewportClient) == 0x0038); // 56 bytes (0x000028 - 0x000038)
static_assert(sizeof(FDebugDisplayProperty) == 0x0020); // 32 bytes (0x000000 - 0x000020)
static_assert(sizeof(UGameViewportClient) == 0x0360); // 864 bytes (0x000038 - 0x000360)
static_assert(sizeof(AController) == 0x0298); // 664 bytes (0x000220 - 0x000298)
static_assert(sizeof(FActiveForceFeedbackEffect) == 0x0018); // 24 bytes (0x000000 - 0x000018)
static_assert(sizeof(APlayerController) == 0x0570); // 1392 bytes (0x000298 - 0x000570)
static_assert(sizeof(UPlayer) == 0x0048); // 72 bytes (0x000028 - 0x000048)
static_assert(sizeof(ULocalPlayer) == 0x0258); // 600 bytes (0x000048 - 0x000258)
static_assert(sizeof(ULocalPlayerSubsystem) == 0x0030); // 48 bytes (0x000030 - 0x000030)
static_assert(sizeof(UAssetImportData) == 0x0028); // 40 bytes (0x000028 - 0x000028)
static_assert(sizeof(UAssetUserData) == 0x0028); // 40 bytes (0x000028 - 0x000028)
static_assert(sizeof(FSingleAnimationPlayData) == 0x0018); // 24 bytes (0x000000 - 0x000018)
static_assert(sizeof(USkeletalMeshComponent) == 0x0F00); // 3840 bytes (0x0006C0 - 0x000F00)
static_assert(sizeof(FAnimNotifyEventReference) == 0x0010); // 16 bytes (0x000000 - 0x000010)
static_assert(sizeof(FAnimNotifyArray) == 0x0010); // 16 bytes (0x000000 - 0x000010)
static_assert(sizeof(FAnimNotifyQueue) == 0x0070); // 112 bytes (0x000000 - 0x000070)
static_assert(sizeof(FAnimLinkableElement) == 0x0030); // 48 bytes (0x000000 - 0x000030)
static_assert(sizeof(FAnimNotifyEvent) == 0x00B8); // 184 bytes (0x000030 - 0x0000B8)
static_assert(sizeof(UAnimInstance) == 0x02B8); // 696 bytes (0x000028 - 0x0002B8)
static_assert(sizeof(FBPComponentClassOverride) == 0x0010); // 16 bytes (0x000000 - 0x000010)
static_assert(sizeof(FBlueprintComponentChangedPropertyInfo) == 0x0018); // 24 bytes (0x000000 - 0x000018)
static_assert(sizeof(FBlueprintCookedComponentInstancingData) == 0x0048); // 72 bytes (0x000000 - 0x000048)
static_assert(sizeof(UBlueprintGeneratedClass) == 0x0328); // 808 bytes (0x000230 - 0x000328)
static_assert(sizeof(UTimecodeProvider) == 0x0030); // 48 bytes (0x000028 - 0x000030)
static_assert(sizeof(UFXSystemComponent) == 0x0468); // 1128 bytes (0x000468 - 0x000468)
static_assert(sizeof(FParticleSysParam) == 0x0080); // 128 bytes (0x000000 - 0x000080)
static_assert(sizeof(UParticleSystemComponent) == 0x06D0); // 1744 bytes (0x000468 - 0x0006D0)
static_assert(sizeof(UEngineCustomTimeStep) == 0x0028); // 40 bytes (0x000028 - 0x000028)
static_assert(sizeof(AInfo) == 0x0220); // 544 bytes (0x000220 - 0x000220)
static_assert(sizeof(AGameModeBase) == 0x02C0); // 704 bytes (0x000220 - 0x0002C0)
static_assert(sizeof(UDynamicSubsystem) == 0x0030); // 48 bytes (0x000030 - 0x000030)
static_assert(sizeof(UEngineSubsystem) == 0x0030); // 48 bytes (0x000030 - 0x000030)
static_assert(sizeof(UFXSystemAsset) == 0x0030); // 48 bytes (0x000028 - 0x000030)
static_assert(sizeof(UAnimNotifyState) == 0x0030); // 48 bytes (0x000028 - 0x000030)
static_assert(sizeof(UCommandlet) == 0x0080); // 128 bytes (0x000028 - 0x000080)
static_assert(sizeof(UGameUserSettings) == 0x0120); // 288 bytes (0x000028 - 0x000120)
static_assert(sizeof(UMaterialExpression) == 0x0040); // 64 bytes (0x000028 - 0x000040)
static_assert(sizeof(UMaterialExpressionTextureBase) == 0x0048); // 72 bytes (0x000040 - 0x000048)
static_assert(sizeof(FExpressionInput) == 0x000C); // 12 bytes (0x000000 - 0x00000C)
static_assert(sizeof(UMaterialExpressionTextureSample) == 0x0060); // 96 bytes (0x000048 - 0x000060)
static_assert(sizeof(UMaterialExpressionTextureSampleParameter) == 0x0080); // 128 bytes (0x000060 - 0x000080)
static_assert(sizeof(UMaterialExpressionTextureSampleParameter2D) == 0x0080); // 128 bytes (0x000080 - 0x000080)
static_assert(sizeof(APawn) == 0x0280); // 640 bytes (0x000220 - 0x000280)
static_assert(sizeof(FBasedMovementInfo) == 0x0030); // 48 bytes (0x000000 - 0x000030)
static_assert(sizeof(FRootMotionSourceSettings) == 0x0001); // 1 bytes (0x000000 - 0x000001)
static_assert(sizeof(FVector_NetQuantize10) == 0x000C); // 12 bytes (0x00000C - 0x00000C)
static_assert(sizeof(FRootMotionSourceGroup) == 0x0038); // 56 bytes (0x000000 - 0x000038)
static_assert(sizeof(FRootMotionMovementParams) == 0x0040); // 64 bytes (0x000000 - 0x000040)
static_assert(sizeof(FRepRootMotionMontage) == 0x0098); // 152 bytes (0x000000 - 0x000098)
static_assert(sizeof(FSimulatedRootMotionReplicatedMove) == 0x00A0); // 160 bytes (0x000000 - 0x0000A0)
static_assert(sizeof(ACharacter) == 0x04B8); // 1208 bytes (0x000280 - 0x0004B8)
static_assert(sizeof(FSplineCurves) == 0x0070); // 112 bytes (0x000000 - 0x000070)
static_assert(sizeof(USplineComponent) == 0x0560); // 1376 bytes (0x000468 - 0x000560)
static_assert(sizeof(UAnimBoneCompressionCodec) == 0x0038); // 56 bytes (0x000028 - 0x000038)
static_assert(sizeof(UAnimCurveCompressionCodec) == 0x0028); // 40 bytes (0x000028 - 0x000028)
static_assert(sizeof(FAudioComponentParam) == 0x0020); // 32 bytes (0x000000 - 0x000020)
static_assert(sizeof(UAudioComponent) == 0x0860); // 2144 bytes (0x0001F8 - 0x000860)
static_assert(sizeof(USaveGame) == 0x0028); // 40 bytes (0x000028 - 0x000028)
static_assert(sizeof(AGameMode) == 0x0308); // 776 bytes (0x0002C0 - 0x000308)
static_assert(sizeof(AGameStateBase) == 0x0270); // 624 bytes (0x000220 - 0x000270)
static_assert(sizeof(AGameState) == 0x0290); // 656 bytes (0x000270 - 0x000290)
static_assert(sizeof(UApplicationLifecycleComponent) == 0x0140); // 320 bytes (0x0000B0 - 0x000140)
static_assert(sizeof(UCameraShakeBase) == 0x0098); // 152 bytes (0x000028 - 0x000098)
static_assert(sizeof(UOnlineBlueprintCallProxyBase) == 0x0030); // 48 bytes (0x000030 - 0x000030)
static_assert(sizeof(FUniqueNetIdRepl) == 0x0028); // 40 bytes (0x000001 - 0x000028)
static_assert(sizeof(UNetConnection) == 0x1AF0); // 6896 bytes (0x000048 - 0x001AF0)
static_assert(sizeof(FChannelDefinition) == 0x0028); // 40 bytes (0x000000 - 0x000028)
static_assert(sizeof(UNetDriver) == 0x0748); // 1864 bytes (0x000028 - 0x000748)
static_assert(sizeof(UOnlineEngineInterface) == 0x0028); // 40 bytes (0x000028 - 0x000028)
static_assert(sizeof(UOnlineSession) == 0x0028); // 40 bytes (0x000028 - 0x000028)
static_assert(sizeof(UMovementComponent) == 0x00F0); // 240 bytes (0x0000B0 - 0x0000F0)
static_assert(sizeof(FMovementProperties) == 0x0001); // 1 bytes (0x000000 - 0x000001)
static_assert(sizeof(FNavAgentProperties) == 0x0030); // 48 bytes (0x000001 - 0x000030)
static_assert(sizeof(UNavMovementComponent) == 0x0130); // 304 bytes (0x0000F0 - 0x000130)
static_assert(sizeof(UPawnMovementComponent) == 0x0138); // 312 bytes (0x000130 - 0x000138)
static_assert(sizeof(FVector_NetQuantize) == 0x000C); // 12 bytes (0x00000C - 0x00000C)
static_assert(sizeof(FVector_NetQuantizeNormal) == 0x000C); // 12 bytes (0x00000C - 0x00000C)
static_assert(sizeof(FHitResult) == 0x008C); // 140 bytes (0x000000 - 0x00008C)
static_assert(sizeof(FFindFloorResult) == 0x0098); // 152 bytes (0x000000 - 0x000098)
static_assert(sizeof(FNavAvoidanceMask) == 0x0004); // 4 bytes (0x000000 - 0x000004)
static_assert(sizeof(FCharacterMovementComponentPostPhysicsTickFunction) == 0x0030); // 48 bytes (0x000028 - 0x000030)
static_assert(sizeof(UCharacterMovementComponent) == 0x0B00); // 2816 bytes (0x000138 - 0x000B00)
static_assert(sizeof(USoundEffectSourcePreset) == 0x0068); // 104 bytes (0x000068 - 0x000068)
static_assert(sizeof(FWeightedBlendable) == 0x0010); // 16 bytes (0x000000 - 0x000010)
static_assert(sizeof(FWeightedBlendables) == 0x0010); // 16 bytes (0x000000 - 0x000010)
static_assert(sizeof(FPostProcessSettings) == 0x0550); // 1360 bytes (0x000000 - 0x000550)
static_assert(sizeof(ACameraActor) == 0x07A0); // 1952 bytes (0x000220 - 0x0007A0)
static_assert(sizeof(FFOscillator) == 0x000C); // 12 bytes (0x000000 - 0x00000C)
static_assert(sizeof(FROscillator) == 0x0024); // 36 bytes (0x000000 - 0x000024)
static_assert(sizeof(FVOscillator) == 0x0024); // 36 bytes (0x000000 - 0x000024)
static_assert(sizeof(UMatineeCameraShake) == 0x0178); // 376 bytes (0x000098 - 0x000178)
static_assert(sizeof(UShapeComponent) == 0x0480); // 1152 bytes (0x000468 - 0x000480)
static_assert(sizeof(UBoxComponent) == 0x0490); // 1168 bytes (0x000480 - 0x000490)
static_assert(sizeof(USphereComponent) == 0x0490); // 1168 bytes (0x000480 - 0x000490)
static_assert(sizeof(ATriggerBase) == 0x0228); // 552 bytes (0x000220 - 0x000228)
static_assert(sizeof(ATriggerBox) == 0x0228); // 552 bytes (0x000228 - 0x000228)
static_assert(sizeof(UChildActorComponent) == 0x0230); // 560 bytes (0x0001F8 - 0x000230)
static_assert(sizeof(UGameInstance) == 0x01A8); // 424 bytes (0x000028 - 0x0001A8)
static_assert(sizeof(UArrowComponent) == 0x0480); // 1152 bytes (0x000468 - 0x000480)
static_assert(sizeof(FEngineShowFlagsSetting) == 0x0018); // 24 bytes (0x000000 - 0x000018)
static_assert(sizeof(USceneCaptureComponent) == 0x02B0); // 688 bytes (0x0001F8 - 0x0002B0)
static_assert(sizeof(USceneCaptureComponent2D) == 0x08B0); // 2224 bytes (0x0002B0 - 0x0008B0)
static_assert(sizeof(USpringArmComponent) == 0x0280); // 640 bytes (0x0001F8 - 0x000280)
static_assert(sizeof(UTextRenderComponent) == 0x04B8); // 1208 bytes (0x000468 - 0x0004B8)
static_assert(sizeof(UCameraComponent) == 0x07E0); // 2016 bytes (0x0001F8 - 0x0007E0)
static_assert(sizeof(ASkyLight) == 0x0230); // 560 bytes (0x000220 - 0x000230)
static_assert(sizeof(UTexture) == 0x00D8); // 216 bytes (0x000060 - 0x0000D8)
static_assert(sizeof(UTextureCube) == 0x0130); // 304 bytes (0x0000D8 - 0x000130)
static_assert(sizeof(FStaticMeshComponentLODInfo) == 0x0090); // 144 bytes (0x000000 - 0x000090)
static_assert(sizeof(FStreamingTextureBuildInfo) == 0x000C); // 12 bytes (0x000000 - 0x00000C)
static_assert(sizeof(FLightmassPrimitiveSettings) == 0x0018); // 24 bytes (0x000000 - 0x000018)
static_assert(sizeof(UStaticMeshComponent) == 0x04F8); // 1272 bytes (0x000490 - 0x0004F8)
static_assert(sizeof(FInstancedStaticMeshInstanceData) == 0x0040); // 64 bytes (0x000000 - 0x000040)
static_assert(sizeof(FInstancedStaticMeshMappingInfo) == 0x0008); // 8 bytes (0x000000 - 0x000008)
static_assert(sizeof(UInstancedStaticMeshComponent) == 0x05A0); // 1440 bytes (0x0004F8 - 0x0005A0)
static_assert(sizeof(UHierarchicalInstancedStaticMeshComponent) == 0x0690); // 1680 bytes (0x0005A0 - 0x000690)
static_assert(sizeof(AStaticMeshActor) == 0x0230); // 560 bytes (0x000220 - 0x000230)
static_assert(sizeof(FLightmassMaterialInterfaceSettings) == 0x0010); // 16 bytes (0x000000 - 0x000010)
static_assert(sizeof(FMaterialTextureInfo) == 0x0010); // 16 bytes (0x000000 - 0x000010)
static_assert(sizeof(UMaterialInterface) == 0x0088); // 136 bytes (0x000028 - 0x000088)
static_assert(sizeof(FMaterialParameterInfo) == 0x0010); // 16 bytes (0x000000 - 0x000010)
static_assert(sizeof(FScalarParameterValue) == 0x0024); // 36 bytes (0x000000 - 0x000024)
static_assert(sizeof(FVectorParameterValue) == 0x0030); // 48 bytes (0x000000 - 0x000030)
static_assert(sizeof(FTextureParameterValue) == 0x0028); // 40 bytes (0x000000 - 0x000028)
static_assert(sizeof(FRuntimeVirtualTextureParameterValue) == 0x0028); // 40 bytes (0x000000 - 0x000028)
static_assert(sizeof(FFontParameterValue) == 0x0030); // 48 bytes (0x000000 - 0x000030)
static_assert(sizeof(FMaterialInstanceBasePropertyOverrides) == 0x000C); // 12 bytes (0x000000 - 0x00000C)
static_assert(sizeof(FStaticParameterBase) == 0x0024); // 36 bytes (0x000000 - 0x000024)
static_assert(sizeof(FStaticSwitchParameter) == 0x0028); // 40 bytes (0x000024 - 0x000028)
static_assert(sizeof(FStaticComponentMaskParameter) == 0x0028); // 40 bytes (0x000024 - 0x000028)
static_assert(sizeof(FStaticTerrainLayerWeightParameter) == 0x002C); // 44 bytes (0x000024 - 0x00002C)
static_assert(sizeof(FMaterialLayersFunctions) == 0x0040); // 64 bytes (0x000000 - 0x000040)
static_assert(sizeof(FStaticMaterialLayersParameter) == 0x0068); // 104 bytes (0x000024 - 0x000068)
static_assert(sizeof(FStaticParameterSet) == 0x0040); // 64 bytes (0x000000 - 0x000040)
static_assert(sizeof(FMaterialCachedParameterEntry) == 0x0040); // 64 bytes (0x000000 - 0x000040)
static_assert(sizeof(FMaterialCachedParameters) == 0x01A0); // 416 bytes (0x000000 - 0x0001A0)
static_assert(sizeof(UMaterialInstance) == 0x0378); // 888 bytes (0x000088 - 0x000378)
static_assert(sizeof(UMaterialInstanceConstant) == 0x0380); // 896 bytes (0x000378 - 0x000380)
static_assert(sizeof(UMaterialExpressionCustomOutput) == 0x0040); // 64 bytes (0x000040 - 0x000040)
static_assert(sizeof(UDynamicBlueprintBinding) == 0x0028); // 40 bytes (0x000028 - 0x000028)
static_assert(sizeof(UBlueprintCore) == 0x0050); // 80 bytes (0x000028 - 0x000050)
static_assert(sizeof(UBlueprint) == 0x00A0); // 160 bytes (0x000050 - 0x0000A0)
static_assert(sizeof(UModel) == 0x0258); // 600 bytes (0x000028 - 0x000258)
static_assert(sizeof(UChannel) == 0x0070); // 112 bytes (0x000028 - 0x000070)
static_assert(sizeof(UActorChannel) == 0x0298); // 664 bytes (0x000070 - 0x000298)
static_assert(sizeof(UAnimationAsset) == 0x0080); // 128 bytes (0x000028 - 0x000080)
static_assert(sizeof(FInterpolationParameter) == 0x0008); // 8 bytes (0x000000 - 0x000008)
static_assert(sizeof(FPerBoneInterpolation) == 0x0014); // 20 bytes (0x000000 - 0x000014)
static_assert(sizeof(FBlendSample) == 0x0018); // 24 bytes (0x000000 - 0x000018)
static_assert(sizeof(FEditorElement) == 0x0018); // 24 bytes (0x000000 - 0x000018)
static_assert(sizeof(FBlendParameter) == 0x0020); // 32 bytes (0x000000 - 0x000020)
static_assert(sizeof(UBlendSpaceBase) == 0x0148); // 328 bytes (0x000080 - 0x000148)
static_assert(sizeof(UBlendSpace) == 0x0150); // 336 bytes (0x000148 - 0x000150)
static_assert(sizeof(UAimOffsetBlendSpace) == 0x0150); // 336 bytes (0x000150 - 0x000150)
static_assert(sizeof(UBlendSpace1D) == 0x0150); // 336 bytes (0x000148 - 0x000150)
static_assert(sizeof(UAimOffsetBlendSpace1D) == 0x0150); // 336 bytes (0x000150 - 0x000150)
static_assert(sizeof(UAISystemBase) == 0x0058); // 88 bytes (0x000028 - 0x000058)
static_assert(sizeof(AAmbientSound) == 0x0228); // 552 bytes (0x000220 - 0x000228)
static_assert(sizeof(FCustomAttributeSetting) == 0x0020); // 32 bytes (0x000000 - 0x000020)
static_assert(sizeof(UAnimationSettings) == 0x00D0); // 208 bytes (0x000038 - 0x0000D0)
static_assert(sizeof(FAnimGroupInfo) == 0x0018); // 24 bytes (0x000000 - 0x000018)
static_assert(sizeof(UAnimBlueprint) == 0x00C8); // 200 bytes (0x0000A0 - 0x0000C8)
static_assert(sizeof(FBakedStateExitTransition) == 0x0020); // 32 bytes (0x000000 - 0x000020)
static_assert(sizeof(FBakedAnimationState) == 0x0058); // 88 bytes (0x000000 - 0x000058)
static_assert(sizeof(FAnimationStateBase) == 0x0008); // 8 bytes (0x000000 - 0x000008)
static_assert(sizeof(FAnimationTransitionBetweenStates) == 0x0040); // 64 bytes (0x000008 - 0x000040)
static_assert(sizeof(FBakedAnimationStateMachine) == 0x0030); // 48 bytes (0x000000 - 0x000030)
static_assert(sizeof(FCachedPoseIndices) == 0x0010); // 16 bytes (0x000000 - 0x000010)
static_assert(sizeof(FExposedValueCopyRecord) == 0x0008); // 8 bytes (0x000000 - 0x000008)
static_assert(sizeof(FExposedValueHandler) == 0x0050); // 80 bytes (0x000000 - 0x000050)
static_assert(sizeof(FGraphAssetPlayerInformation) == 0x0010); // 16 bytes (0x000000 - 0x000010)
static_assert(sizeof(FAnimGraphBlendOptions) == 0x0008); // 8 bytes (0x000000 - 0x000008)
static_assert(sizeof(UAnimBlueprintGeneratedClass) == 0x05B0); // 1456 bytes (0x000328 - 0x0005B0)
static_assert(sizeof(UAnimBoneCompressionSettings) == 0x0038); // 56 bytes (0x000028 - 0x000038)
static_assert(sizeof(FAnimBlueprintFunction) == 0x0068); // 104 bytes (0x000000 - 0x000068)
static_assert(sizeof(FAnimBlueprintFunctionData) == 0x0040); // 64 bytes (0x000000 - 0x000040)
static_assert(sizeof(UAnimClassData) == 0x0330); // 816 bytes (0x000028 - 0x000330)
static_assert(sizeof(UAnimClassInterface) == 0x0028); // 40 bytes (0x000028 - 0x000028)
static_assert(sizeof(FSmartName) == 0x000C); // 12 bytes (0x000000 - 0x00000C)
static_assert(sizeof(FAnimCurveBase) == 0x0018); // 24 bytes (0x000000 - 0x000018)
static_assert(sizeof(FFloatCurve) == 0x0098); // 152 bytes (0x000018 - 0x000098)
static_assert(sizeof(FRawCurveTracks) == 0x0010); // 16 bytes (0x000000 - 0x000010)
static_assert(sizeof(UAnimSequenceBase) == 0x00A8); // 168 bytes (0x000080 - 0x0000A8)
static_assert(sizeof(UAnimCompositeBase) == 0x00A8); // 168 bytes (0x0000A8 - 0x0000A8)
static_assert(sizeof(FAnimSegment) == 0x0020); // 32 bytes (0x000000 - 0x000020)
static_assert(sizeof(FAnimTrack) == 0x0010); // 16 bytes (0x000000 - 0x000010)
static_assert(sizeof(UAnimComposite) == 0x00B8); // 184 bytes (0x0000A8 - 0x0000B8)
static_assert(sizeof(UAnimCompress) == 0x0040); // 64 bytes (0x000038 - 0x000040)
static_assert(sizeof(UAnimCompress_BitwiseCompressOnly) == 0x0040); // 64 bytes (0x000040 - 0x000040)
static_assert(sizeof(UAnimCompress_LeastDestructive) == 0x0040); // 64 bytes (0x000040 - 0x000040)
static_assert(sizeof(UAnimCompress_RemoveLinearKeys) == 0x0060); // 96 bytes (0x000040 - 0x000060)
static_assert(sizeof(UAnimCompress_PerTrackCompression) == 0x00D8); // 216 bytes (0x000060 - 0x0000D8)
static_assert(sizeof(UAnimCompress_RemoveEverySecondKey) == 0x0048); // 72 bytes (0x000040 - 0x000048)
static_assert(sizeof(UAnimCompress_RemoveTrivialKeys) == 0x0050); // 80 bytes (0x000040 - 0x000050)
static_assert(sizeof(UAnimCurveCompressionCodec_CompressedRichCurve) == 0x0028); // 40 bytes (0x000028 - 0x000028)
static_assert(sizeof(UAnimCurveCompressionCodec_UniformIndexable) == 0x0028); // 40 bytes (0x000028 - 0x000028)
static_assert(sizeof(UAnimCurveCompressionCodec_UniformlySampled) == 0x0028); // 40 bytes (0x000028 - 0x000028)
static_assert(sizeof(UAnimCurveCompressionSettings) == 0x0030); // 48 bytes (0x000028 - 0x000030)
static_assert(sizeof(UAnimLayerInterface) == 0x0028); // 40 bytes (0x000028 - 0x000028)
static_assert(sizeof(UAnimMetaData) == 0x0028); // 40 bytes (0x000028 - 0x000028)
static_assert(sizeof(FAlphaBlend) == 0x0030); // 48 bytes (0x000000 - 0x000030)
static_assert(sizeof(FAnimSyncMarker) == 0x000C); // 12 bytes (0x000000 - 0x00000C)
static_assert(sizeof(FMarkerSyncData) == 0x0020); // 32 bytes (0x000000 - 0x000020)
static_assert(sizeof(FCompositeSection) == 0x0058); // 88 bytes (0x000030 - 0x000058)
static_assert(sizeof(FSlotAnimationTrack) == 0x0018); // 24 bytes (0x000000 - 0x000018)
static_assert(sizeof(FBranchingPoint) == 0x0040); // 64 bytes (0x000030 - 0x000040)
static_assert(sizeof(FBranchingPointMarker) == 0x000C); // 12 bytes (0x000000 - 0x00000C)
static_assert(sizeof(FTimeStretchCurveMarker) == 0x0010); // 16 bytes (0x000000 - 0x000010)
static_assert(sizeof(FTimeStretchCurve) == 0x0028); // 40 bytes (0x000000 - 0x000028)
static_assert(sizeof(UAnimMontage) == 0x01D0); // 464 bytes (0x0000A8 - 0x0001D0)
static_assert(sizeof(UAnimNotify_PauseClothingSimulation) == 0x0038); // 56 bytes (0x000038 - 0x000038)
static_assert(sizeof(UAnimNotify_PlayParticleEffect) == 0x0090); // 144 bytes (0x000038 - 0x000090)
static_assert(sizeof(UAnimNotify_PlaySound) == 0x0058); // 88 bytes (0x000038 - 0x000058)
static_assert(sizeof(UAnimNotify_ResetClothingSimulation) == 0x0038); // 56 bytes (0x000038 - 0x000038)
static_assert(sizeof(UAnimNotify_ResetDynamics) == 0x0038); // 56 bytes (0x000038 - 0x000038)
static_assert(sizeof(UAnimNotify_ResumeClothingSimulation) == 0x0038); // 56 bytes (0x000038 - 0x000038)
static_assert(sizeof(UAnimNotifyState_DisableRootMotion) == 0x0030); // 48 bytes (0x000030 - 0x000030)
static_assert(sizeof(UAnimNotifyState_TimedParticleEffect) == 0x0060); // 96 bytes (0x000030 - 0x000060)
static_assert(sizeof(UAnimNotifyState_Trail) == 0x0058); // 88 bytes (0x000030 - 0x000058)
static_assert(sizeof(FTrackToSkeletonMap) == 0x0004); // 4 bytes (0x000000 - 0x000004)
static_assert(sizeof(FStringCurveKey) == 0x0018); // 24 bytes (0x000000 - 0x000018)
static_assert(sizeof(FStringCurve) == 0x0088); // 136 bytes (0x000068 - 0x000088)
static_assert(sizeof(FBakedStringCustomAttribute) == 0x0090); // 144 bytes (0x000000 - 0x000090)
static_assert(sizeof(FIntegralKey) == 0x0008); // 8 bytes (0x000000 - 0x000008)
static_assert(sizeof(FIntegralCurve) == 0x0080); // 128 bytes (0x000068 - 0x000080)
static_assert(sizeof(FBakedIntegerCustomAttribute) == 0x0088); // 136 bytes (0x000000 - 0x000088)
static_assert(sizeof(FSimpleCurveKey) == 0x0008); // 8 bytes (0x000000 - 0x000008)
static_assert(sizeof(FSimpleCurve) == 0x0088); // 136 bytes (0x000070 - 0x000088)
static_assert(sizeof(FBakedFloatCustomAttribute) == 0x0090); // 144 bytes (0x000000 - 0x000090)
static_assert(sizeof(FBakedCustomAttributePerBoneData) == 0x0038); // 56 bytes (0x000000 - 0x000038)
static_assert(sizeof(UAnimSequence) == 0x01B0); // 432 bytes (0x0000A8 - 0x0001B0)
static_assert(sizeof(FAnimSetMeshLinkup) == 0x0010); // 16 bytes (0x000000 - 0x000010)
static_assert(sizeof(UAnimSet) == 0x00F0); // 240 bytes (0x000028 - 0x0000F0)
static_assert(sizeof(UAnimSingleNodeInstance) == 0x02D0); // 720 bytes (0x0002B8 - 0x0002D0)
static_assert(sizeof(UAnimStateMachineTypes) == 0x0028); // 40 bytes (0x000028 - 0x000028)
static_assert(sizeof(UAnimStreamable) == 0x00E0); // 224 bytes (0x0000A8 - 0x0000E0)
static_assert(sizeof(UAssetExportTask) == 0x0078); // 120 bytes (0x000028 - 0x000078)
static_assert(sizeof(FPrimaryAssetRules) == 0x000C); // 12 bytes (0x000000 - 0x00000C)
static_assert(sizeof(FPrimaryAssetTypeInfo) == 0x0088); // 136 bytes (0x000000 - 0x000088)
static_assert(sizeof(FPrimaryAssetRulesOverride) == 0x001C); // 28 bytes (0x000000 - 0x00001C)
static_assert(sizeof(FPrimaryAssetRulesCustomOverride) == 0x0038); // 56 bytes (0x000000 - 0x000038)
static_assert(sizeof(FAssetManagerRedirect) == 0x0020); // 32 bytes (0x000000 - 0x000020)
static_assert(sizeof(UAssetManagerSettings) == 0x0100); // 256 bytes (0x000038 - 0x000100)
static_assert(sizeof(FAssetMapping) == 0x0010); // 16 bytes (0x000000 - 0x000010)
static_assert(sizeof(UAssetMappingTable) == 0x0038); // 56 bytes (0x000028 - 0x000038)
static_assert(sizeof(UAsyncActionHandleSaveGame) == 0x0068); // 104 bytes (0x000030 - 0x000068)
static_assert(sizeof(UAsyncActionLoadPrimaryAssetBase) == 0x0078); // 120 bytes (0x000030 - 0x000078)
static_assert(sizeof(UAsyncActionLoadPrimaryAsset) == 0x0088); // 136 bytes (0x000078 - 0x000088)
static_assert(sizeof(UAsyncActionLoadPrimaryAssetClass) == 0x0088); // 136 bytes (0x000078 - 0x000088)
static_assert(sizeof(UAsyncActionLoadPrimaryAssetList) == 0x0088); // 136 bytes (0x000078 - 0x000088)
static_assert(sizeof(UAsyncActionLoadPrimaryAssetClassList) == 0x0088); // 136 bytes (0x000078 - 0x000088)
static_assert(sizeof(UAsyncActionChangePrimaryAssetBundles) == 0x0088); // 136 bytes (0x000078 - 0x000088)
static_assert(sizeof(AAtmosphericFog) == 0x0228); // 552 bytes (0x000220 - 0x000228)
static_assert(sizeof(FAtmospherePrecomputeParameters) == 0x002C); // 44 bytes (0x000000 - 0x00002C)
static_assert(sizeof(UAtmosphericFogComponent) == 0x0300); // 768 bytes (0x0001F8 - 0x000300)
static_assert(sizeof(UAudioBus) == 0x0030); // 48 bytes (0x000028 - 0x000030)
static_assert(sizeof(FAudioQualitySettings) == 0x0020); // 32 bytes (0x000000 - 0x000020)
static_assert(sizeof(UAudioSettings) == 0x0148); // 328 bytes (0x000038 - 0x000148)
static_assert(sizeof(FReverbSettings) == 0x0020); // 32 bytes (0x000000 - 0x000020)
static_assert(sizeof(FInteriorSettings) == 0x0024); // 36 bytes (0x000000 - 0x000024)
static_assert(sizeof(FAudioVolumeSubmixSendSettings) == 0x0018); // 24 bytes (0x000000 - 0x000018)
static_assert(sizeof(FAudioVolumeSubmixOverrideSettings) == 0x0020); // 32 bytes (0x000000 - 0x000020)
static_assert(sizeof(AAudioVolume) == 0x02C8); // 712 bytes (0x000258 - 0x0002C8)
static_assert(sizeof(UAutoDestroySubsystem) == 0x0048); // 72 bytes (0x000030 - 0x000048)
static_assert(sizeof(FEditorMapPerformanceTestDefinition) == 0x0020); // 32 bytes (0x000000 - 0x000020)
static_assert(sizeof(FFilePath) == 0x0010); // 16 bytes (0x000000 - 0x000010)
static_assert(sizeof(FImportFactorySettingValues) == 0x0020); // 32 bytes (0x000000 - 0x000020)
static_assert(sizeof(FEditorImportWorkflowDefinition) == 0x0020); // 32 bytes (0x000000 - 0x000020)
static_assert(sizeof(FBuildPromotionImportWorkflowSettings) == 0x0150); // 336 bytes (0x000000 - 0x000150)
static_assert(sizeof(FBuildPromotionOpenAssetSettings) == 0x0060); // 96 bytes (0x000000 - 0x000060)
static_assert(sizeof(FBuildPromotionNewProjectSettings) == 0x0020); // 32 bytes (0x000000 - 0x000020)
static_assert(sizeof(FBuildPromotionTestSettings) == 0x01F0); // 496 bytes (0x000000 - 0x0001F0)
static_assert(sizeof(FMaterialEditorPromotionSettings) == 0x0030); // 48 bytes (0x000000 - 0x000030)
static_assert(sizeof(FParticleEditorPromotionSettings) == 0x0010); // 16 bytes (0x000000 - 0x000010)
static_assert(sizeof(FBlueprintEditorPromotionSettings) == 0x0030); // 48 bytes (0x000000 - 0x000030)
static_assert(sizeof(FExternalToolDefinition) == 0x0060); // 96 bytes (0x000000 - 0x000060)
static_assert(sizeof(FEditorImportExportTestDefinition) == 0x0038); // 56 bytes (0x000000 - 0x000038)
static_assert(sizeof(FLaunchOnTestSettings) == 0x0020); // 32 bytes (0x000000 - 0x000020)
static_assert(sizeof(UAutomationTestSettings) == 0x0340); // 832 bytes (0x000028 - 0x000340)
static_assert(sizeof(UAvoidanceManager) == 0x00E0); // 224 bytes (0x000028 - 0x0000E0)
static_assert(sizeof(FBandwidthTestItem) == 0x0010); // 16 bytes (0x000000 - 0x000010)
static_assert(sizeof(FBandwidthTestGenerator) == 0x0020); // 32 bytes (0x000000 - 0x000020)
static_assert(sizeof(ABandwidthTestActor) == 0x0240); // 576 bytes (0x000220 - 0x000240)
static_assert(sizeof(UBillboardComponent) == 0x0490); // 1168 bytes (0x000468 - 0x000490)
static_assert(sizeof(UBlendableInterface) == 0x0028); // 40 bytes (0x000028 - 0x000028)
static_assert(sizeof(FBoneNode) == 0x0010); // 16 bytes (0x000000 - 0x000010)
static_assert(sizeof(FVirtualBone) == 0x0018); // 24 bytes (0x000000 - 0x000018)
static_assert(sizeof(FSmartNameContainer) == 0x0050); // 80 bytes (0x000000 - 0x000050)
static_assert(sizeof(FAnimSlotGroup) == 0x0018); // 24 bytes (0x000000 - 0x000018)
static_assert(sizeof(USkeleton) == 0x0378); // 888 bytes (0x000028 - 0x000378)
static_assert(sizeof(FBlendProfileBoneEntry) == 0x0014); // 20 bytes (0x000000 - 0x000014)
static_assert(sizeof(UBlendProfile) == 0x0048); // 72 bytes (0x000028 - 0x000048)
static_assert(sizeof(ABlockingVolume) == 0x0258); // 600 bytes (0x000258 - 0x000258)
static_assert(sizeof(UBlueprintExtension) == 0x0028); // 40 bytes (0x000028 - 0x000028)
static_assert(sizeof(UBlueprintMapLibrary) == 0x0028); // 40 bytes (0x000028 - 0x000028)
static_assert(sizeof(UBlueprintPathsLibrary) == 0x0028); // 40 bytes (0x000028 - 0x000028)
static_assert(sizeof(UPlatformGameInstance) == 0x0278); // 632 bytes (0x0001A8 - 0x000278)
static_assert(sizeof(UBlueprintPlatformLibrary) == 0x0028); // 40 bytes (0x000028 - 0x000028)
static_assert(sizeof(UBlueprintSetLibrary) == 0x0028); // 40 bytes (0x000028 - 0x000028)
static_assert(sizeof(FKShapeElem) == 0x0030); // 48 bytes (0x000000 - 0x000030)
static_assert(sizeof(FKSphereElem) == 0x0040); // 64 bytes (0x000030 - 0x000040)
static_assert(sizeof(FKBoxElem) == 0x0058); // 88 bytes (0x000030 - 0x000058)
static_assert(sizeof(FKSphylElem) == 0x0050); // 80 bytes (0x000030 - 0x000050)
static_assert(sizeof(FKConvexElem) == 0x00B0); // 176 bytes (0x000030 - 0x0000B0)
static_assert(sizeof(FKTaperedCapsuleElem) == 0x0058); // 88 bytes (0x000030 - 0x000058)
static_assert(sizeof(FKAggregateGeom) == 0x0058); // 88 bytes (0x000000 - 0x000058)
static_assert(sizeof(UBodySetup) == 0x02A0); // 672 bytes (0x000048 - 0x0002A0)
static_assert(sizeof(FBranchFilter) == 0x000C); // 12 bytes (0x000000 - 0x00000C)
static_assert(sizeof(FInputBlendPose) == 0x0068); // 104 bytes (0x000000 - 0x000068)
static_assert(sizeof(UBoneMaskFilter) == 0x0038); // 56 bytes (0x000028 - 0x000038)
static_assert(sizeof(UBookmarkBase) == 0x0028); // 40 bytes (0x000028 - 0x000028)
static_assert(sizeof(UBookMark) == 0x0050); // 80 bytes (0x000028 - 0x000050)
static_assert(sizeof(UBookMark2D) == 0x0038); // 56 bytes (0x000028 - 0x000038)
static_assert(sizeof(UBoundsCopyComponent) == 0x0120); // 288 bytes (0x0000B0 - 0x000120)
static_assert(sizeof(AReflectionCapture) == 0x0228); // 552 bytes (0x000220 - 0x000228)
static_assert(sizeof(ABoxReflectionCapture) == 0x0228); // 552 bytes (0x000228 - 0x000228)
static_assert(sizeof(UReflectionCaptureComponent) == 0x0278); // 632 bytes (0x0001F8 - 0x000278)
static_assert(sizeof(UBoxReflectionCaptureComponent) == 0x0290); // 656 bytes (0x000278 - 0x000290)
static_assert(sizeof(UBreakpoint) == 0x0040); // 64 bytes (0x000028 - 0x000040)
static_assert(sizeof(FBuilderPoly) == 0x0020); // 32 bytes (0x000000 - 0x000020)
static_assert(sizeof(UBrushBuilder) == 0x0080); // 128 bytes (0x000028 - 0x000080)
static_assert(sizeof(UBrushComponent) == 0x0480); // 1152 bytes (0x000468 - 0x000480)
static_assert(sizeof(ABrushShape) == 0x0258); // 600 bytes (0x000258 - 0x000258)
static_assert(sizeof(UButtonStyleAsset) == 0x03D0); // 976 bytes (0x000028 - 0x0003D0)
static_assert(sizeof(UCameraAnim) == 0x05C0); // 1472 bytes (0x000028 - 0x0005C0)
static_assert(sizeof(UCameraAnimInst) == 0x0110); // 272 bytes (0x000028 - 0x000110)
static_assert(sizeof(ACameraBlockingVolume) == 0x0258); // 600 bytes (0x000258 - 0x000258)
static_assert(sizeof(UCameraModifier) == 0x0048); // 72 bytes (0x000028 - 0x000048)
static_assert(sizeof(FActiveCameraShakeInfo) == 0x0010); // 16 bytes (0x000000 - 0x000010)
static_assert(sizeof(FPooledCameraShakes) == 0x0010); // 16 bytes (0x000000 - 0x000010)
static_assert(sizeof(UCameraModifier_CameraShake) == 0x00B0); // 176 bytes (0x000048 - 0x0000B0)
static_assert(sizeof(ACameraShakeSourceActor) == 0x0228); // 552 bytes (0x000220 - 0x000228)
static_assert(sizeof(UCameraShakeSourceComponent) == 0x0220); // 544 bytes (0x0001F8 - 0x000220)
static_assert(sizeof(UCanvas) == 0x02D0); // 720 bytes (0x000028 - 0x0002D0)
static_assert(sizeof(UTextureRenderTarget) == 0x00E0); // 224 bytes (0x0000D8 - 0x0000E0)
static_assert(sizeof(UTextureRenderTarget2D) == 0x0108); // 264 bytes (0x0000E0 - 0x000108)
static_assert(sizeof(UCanvasRenderTarget2D) == 0x0128); // 296 bytes (0x000108 - 0x000128)
static_assert(sizeof(UCapsuleComponent) == 0x0490); // 1168 bytes (0x000480 - 0x000490)
static_assert(sizeof(UCheatManager) == 0x0078); // 120 bytes (0x000028 - 0x000078)
static_assert(sizeof(UCheckBoxStyleAsset) == 0x0840); // 2112 bytes (0x000028 - 0x000840)
static_assert(sizeof(UChildConnection) == 0x1AF8); // 6904 bytes (0x001AF0 - 0x001AF8)
static_assert(sizeof(FDelegateArray) == 0x0010); // 16 bytes (0x000000 - 0x000010)
static_assert(sizeof(UPlatformInterfaceBase) == 0x0038); // 56 bytes (0x000028 - 0x000038)
static_assert(sizeof(UCloudStorageBase) == 0x0050); // 80 bytes (0x000038 - 0x000050)
static_assert(sizeof(FCollisionResponseTemplate) == 0x0048); // 72 bytes (0x000000 - 0x000048)
static_assert(sizeof(FCustomChannelSetup) == 0x000C); // 12 bytes (0x000000 - 0x00000C)
static_assert(sizeof(FCustomProfile) == 0x0018); // 24 bytes (0x000000 - 0x000018)
static_assert(sizeof(FRedirector) == 0x0010); // 16 bytes (0x000000 - 0x000010)
static_assert(sizeof(UCollisionProfile) == 0x0170); // 368 bytes (0x000038 - 0x000170)
static_assert(sizeof(FBlueprintComponentDelegateBinding) == 0x0018); // 24 bytes (0x000000 - 0x000018)
static_assert(sizeof(UComponentDelegateBinding) == 0x0038); // 56 bytes (0x000028 - 0x000038)
static_assert(sizeof(UActorComponentInstanceDataTransientOuter) == 0x0028); // 40 bytes (0x000028 - 0x000028)
static_assert(sizeof(UCurveTable) == 0x00A0); // 160 bytes (0x000028 - 0x0000A0)
static_assert(sizeof(UCompositeCurveTable) == 0x00C8); // 200 bytes (0x0000A0 - 0x0000C8)
static_assert(sizeof(UDataTable) == 0x00B0); // 176 bytes (0x000028 - 0x0000B0)
static_assert(sizeof(UCompositeDataTable) == 0x00D8); // 216 bytes (0x0000B0 - 0x0000D8)
static_assert(sizeof(UConsole) == 0x0130); // 304 bytes (0x000028 - 0x000130)
static_assert(sizeof(UControlChannel) == 0x0088); // 136 bytes (0x000070 - 0x000088)
static_assert(sizeof(UStreamingSettings) == 0x0070); // 112 bytes (0x000038 - 0x000070)
